[Survived] BooleanLiteral
strategy-game-factory/game-parts/common/game-controls.tsx:27:38
       </legend>
       <div className={`flex divide-x divide-slate-300 rounded-lg overflow-hidden border text-sm
         has-focus-visible:ring-2 has-focus-visible:ring-red-400 has-focus-visible:ring-offset-1`}>
-        <label className={labelClass(!isHumanVsHumanGame, disabled)}>
+        <label className={labelClass(isHumanVsHumanGame, disabled)}>
           <input
             type="radio"

[Killed] BooleanLiteral
strategy-game-factory/game-parts/common/game-controls.tsx:33:22
             name={groupName}
             className="sr-only"
             data-testid="mode-vsComputer"
-            checked={!isHumanVsHumanGame}
+            checked={isHumanVsHumanGame}
             onChange={() => onSwitchMode('vsComputer')}
             disabled={disabled}
killedBy: switchMode resets to roleSelection when switching back to vsComputer
statusReason: Unable to find an element by: [data-testid="role-btn-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"
    >

[Killed] ArrowFunction
strategy-game-factory/game-parts/common/game-controls.tsx:34:23
             className="sr-only"
             data-testid="mode-vsComputer"
             checked={!isHumanVsHumanGame}
-            onChange={() => onSwitchMode('vsComputer')}
+            onChange={() => undefined}
             disabled={disabled}
           />
killedBy: switchMode resets to roleSelection when switching back to vsComputer
statusReason: Unable to find an element by: [data-testid="role-btn-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"
    >

[Survived] StringLiteral
strategy-game-factory/game-parts/common/game-controls.tsx:34:42
             className="sr-only"
             data-testid="mode-vsComputer"
             checked={!isHumanVsHumanGame}
-            onChange={() => onSwitchMode('vsComputer')}
+            onChange={() => onSwitchMode("")}
             disabled={disabled}
           />

[Survived] StringLiteral
strategy-game-factory/game-parts/common/game-controls.tsx:37:23
             onChange={() => onSwitchMode('vsComputer')}
             disabled={disabled}
           />
-          🤖 {t({ hu: 'Gép ellen', en: 'vs Computer' })}
+          🤖 {t({ hu: '"" en: 'vs Computer' })}
         </label>
         <label className={labelClass(isHumanVsHumanGame, disabled)}>

[Killed] ArrowFunction
strategy-game-factory/game-parts/common/game-controls.tsx:46:23
             className="sr-only"
             data-testid="mode-vsHuman"
             checked={isHumanVsHumanGame}
-            onChange={() => onSwitchMode('vsHuman')}
+            onChange={() => undefined}
             disabled={disabled}
           />
killedBy: isClientMoveAllowed allows both players to move in vsHuman mode
statusReason: Unable to find an element by: [data-testid="start-hh-game-0"]

Ignored nodes: comments, script, style
<body>
  <div />
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"

[Survived] StringLiteral
strategy-game-factory/game-parts/common/game-controls.tsx:68:34
   return (
     <fieldset>
       <legend className="text-xs text-slate-600 dark:text-slate-400 mb-1.5">
-        {t({ hu: 'Változat', en: 'Variant' })}
+        {t({ hu: 'Változat', en: "" })}
       </legend>
       <div className={`flex divide-x divide-slate-300 rounded-lg overflow-hidden border text-sm

[Survived] StringLiteral
strategy-game-factory/game-parts/common/game-controls.tsx:68:18
   return (
     <fieldset>
       <legend className="text-xs text-slate-600 dark:text-slate-400 mb-1.5">
-        {t({ hu: 'Változat', en: 'Variant' })}
+        {t({ hu: "", en: 'Variant' })}
       </legend>
       <div className={`flex divide-x divide-slate-300 rounded-lg overflow-hidden border text-sm

[Survived] StringLiteral
strategy-game-factory/game-parts/common/game-controls.tsx:70:23
       <legend className="text-xs text-slate-600 dark:text-slate-400 mb-1.5">
         {t({ hu: 'Változat', en: 'Variant' })}
       </legend>
-      <div className={`flex divide-x divide-slate-300 rounded-lg overflow-hidden border text-sm
-        has-focus-visible:ring-2 has-focus-visible:ring-red-400 has-focus-visible:ring-offset-1`}>
+      <div className={``}>
         {variants.map(v => (
           <label

[Survived] LogicalOperator
strategy-game-factory/game-parts/common/game-controls.tsx:75:70
         {variants.map(v => (
           <label
             key={v.originalIndex}
-            className={labelClass(v.originalIndex === selectedIndex, v.disabled || fieldsetDisabled)}
+            className={labelClass(v.originalIndex === selectedIndex, v.disabled && fieldsetDisabled)}
             title={v.disabled ? t({ hu: 'Nincs gépi stratégia megadva', en: 'No bot strategy defined' }) : undefined}
           >

[Survived] EqualityOperator
strategy-game-factory/game-parts/common/game-controls.tsx:75:35
         {variants.map(v => (
           <label
             key={v.originalIndex}
-            className={labelClass(v.originalIndex === selectedIndex, v.disabled || fieldsetDisabled)}
+            className={labelClass(v.originalIndex !== selectedIndex, v.disabled || fieldsetDisabled)}
             title={v.disabled ? t({ hu: 'Nincs gépi stratégia megadva', en: 'No bot strategy defined' }) : undefined}
           >

[Killed] EqualityOperator
strategy-game-factory/game-parts/common/game-controls.tsx:82:24
               type="radio"
               name={groupName}
               className="sr-only"
-              checked={v.originalIndex === selectedIndex}
+              checked={v.originalIndex !== selectedIndex}
               onChange={() => onSelect(v.originalIndex)}
               disabled={v.disabled || fieldsetDisabled}
killedBy: per-variant rule shows the default variant rule and switches when another variant is selected
statusReason: Unable to find an element with the text: RULE_TWO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"

[Killed] ConditionalExpression
strategy-game-factory/game-parts/common/game-controls.tsx:82:24
               type="radio"
               name={groupName}
               className="sr-only"
-              checked={v.originalIndex === selectedIndex}
+              checked={true}
               onChange={() => onSelect(v.originalIndex)}
               disabled={v.disabled || fieldsetDisabled}
killedBy: per-variant rule shows the default variant rule and switches when another variant is selected
statusReason: Unable to find an element with the text: RULE_TWO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"

[Killed] ArrowFunction
strategy-game-factory/game-parts/common/game-controls.tsx:83:25
               name={groupName}
               className="sr-only"
               checked={v.originalIndex === selectedIndex}
-              onChange={() => onSelect(v.originalIndex)}
+              onChange={() => undefined}
               disabled={v.disabled || fieldsetDisabled}
             />
killedBy: per-variant rule shows the default variant rule and switches when another variant is selected
statusReason: Unable to find an element with the text: RULE_TWO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"

[Survived] ConditionalExpression
strategy-game-factory/game-parts/common/game-controls.tsx:84:25
               className="sr-only"
               checked={v.originalIndex === selectedIndex}
               onChange={() => onSelect(v.originalIndex)}
-              disabled={v.disabled || fieldsetDisabled}
+              disabled={true}
             />
             {t(v.label ?? { hu: `${v.originalIndex + 1}. szint`, en: `Level ${v.originalIndex + 1}` })}

[Survived] LogicalOperator
strategy-game-factory/game-parts/common/game-controls.tsx:84:25
               className="sr-only"
               checked={v.originalIndex === selectedIndex}
               onChange={() => onSelect(v.originalIndex)}
-              disabled={v.disabled || fieldsetDisabled}
+              disabled={v.disabled && fieldsetDisabled}
             />
             {t(v.label ?? { hu: `${v.originalIndex + 1}. szint`, en: `Level ${v.originalIndex + 1}` })}

[Survived] ArithmeticOperator
strategy-game-factory/game-parts/common/game-controls.tsx:86:79
               onChange={() => onSelect(v.originalIndex)}
               disabled={v.disabled || fieldsetDisabled}
             />
-            {t(v.label ?? { hu: `${v.originalIndex + 1}. szint`, en: `Level ${v.originalIndex + 1}` })}
+            {t(v.label ?? { hu: `${v.originalIndex + 1}. szint`, en: `Level ${v.originalIndex - 1}` })}
             {v.notAlwaysOptimal && (
               <span

[Survived] ArithmeticOperator
strategy-game-factory/game-parts/common/game-controls.tsx:86:36
               onChange={() => onSelect(v.originalIndex)}
               disabled={v.disabled || fieldsetDisabled}
             />
-            {t(v.label ?? { hu: `${v.originalIndex + 1}. szint`, en: `Level ${v.originalIndex + 1}` })}
+            {t(v.label ?? { hu: `${v.originalIndex - 1}. szint`, en: `Level ${v.originalIndex + 1}` })}
             {v.notAlwaysOptimal && (
               <span

[Killed] ConditionalExpression
strategy-game-factory/game-parts/common/game-controls.tsx:87:14
               disabled={v.disabled || fieldsetDisabled}
             />
             {t(v.label ?? { hu: `${v.originalIndex + 1}. szint`, en: `Level ${v.originalIndex + 1}` })}
-            {v.notAlwaysOptimal && (
-              <span
-                className="ml-1 opacity-70 text-xs"
-                title={t({
-                  hu: 'A gép nem minden esetben tud nyerő lépést találni.',
-                  en: 'The bot may not always find a winning move.'
-                })}
-              >
-                ⓘ
-              </span>
-            )}
+            {true}
           </label>
         ))}
killedBy: DifficultySelector marks a variant whose bot is not always optimal
statusReason: Unable to find an element with the title: /nem minden esetben|not always find/i.

Ignored nodes: comments, script, style
<body>
  <div>
    <fieldset>
      <legend
        class="text-xs text-slate-600 dark:text-slate-400 mb-1.5"

[Killed] ConditionalExpression
strategy-game-factory/game-parts/common/game-controls.tsx:87:14
               disabled={v.disabled || fieldsetDisabled}
             />
             {t(v.label ?? { hu: `${v.originalIndex + 1}. szint`, en: `Level ${v.originalIndex + 1}` })}
-            {v.notAlwaysOptimal && (
-              <span
-                className="ml-1 opacity-70 text-xs"
-                title={t({
-                  hu: 'A gép nem minden esetben tud nyerő lépést találni.',
-                  en: 'The bot may not always find a winning move.'
-                })}
-              >
-                ⓘ
-              </span>
-            )}
+            {false}
           </label>
         ))}
killedBy: DifficultySelector marks a variant whose bot is not always optimal
statusReason: Unable to find an element with the title: /nem minden esetben|not always find/i.

Ignored nodes: comments, script, style
<body>
  <div>
    <fieldset>
      <legend
        class="text-xs text-slate-600 dark:text-slate-400 mb-1.5"

[Killed] ObjectLiteral
strategy-game-factory/game-parts/common/game-controls.tsx:90:26
             {v.notAlwaysOptimal && (
               <span
                 className="ml-1 opacity-70 text-xs"
-                title={t({
-                  hu: 'A gép nem minden esetben tud nyerő lépést találni.',
-                  en: 'The bot may not always find a winning move.'
-                })}
+                title={t({})}
               >
                 ⓘ
killedBy: DifficultySelector marks a variant whose bot is not always optimal
statusReason: Unable to find an element with the title: /nem minden esetben|not always find/i.

Ignored nodes: comments, script, style
<body>
  <div>
    <fieldset>
      <legend
        class="text-xs text-slate-600 dark:text-slate-400 mb-1.5"

[Killed] StringLiteral
strategy-game-factory/game-parts/common/game-controls.tsx:91:23
               <span
                 className="ml-1 opacity-70 text-xs"
                 title={t({
-                  hu: 'A gép nem minden esetben tud nyerő lépést találni.',
+                  hu: "",
                   en: 'The bot may not always find a winning move.'
                 })}
killedBy: DifficultySelector marks a variant whose bot is not always optimal
statusReason: Unable to find an element with the title: /nem minden esetben|not always find/i.

Ignored nodes: comments, script, style
<body>
  <div>
    <fieldset>
      <legend
        class="text-xs text-slate-600 dark:text-slate-400 mb-1.5"

[Survived] ArrowFunction
strategy-game-factory/game-parts/common/game-controls.tsx:105:20
   );
 };
 
-const labelClass = (active: boolean, disabled: boolean) => `
-  grow flex items-center justify-center py-1 px-2 text-center
-  ${disabled ? 'cursor-not-allowed opacity-40' : 'cursor-pointer'}
-  ${active ? 'bg-blue-500 text-white font-semibold' : 'bg-slate-100 dark:bg-slate-700'}
-  ${!active && !disabled ? 'hocus:bg-slate-200 dark:hocus:bg-slate-600' : ''}
-`;
+const labelClass = () => undefined;
 

[Survived] StringLiteral
strategy-game-factory/game-parts/common/game-controls.tsx:108:14
 const labelClass = (active: boolean, disabled: boolean) => `
   grow flex items-center justify-center py-1 px-2 text-center
   ${disabled ? 'cursor-not-allowed opacity-40' : 'cursor-pointer'}
-  ${active ? 'bg-blue-500 text-white font-semibold' : 'bg-slate-100 dark:bg-slate-700'}
+  ${active ? "" : 'bg-slate-100 dark:bg-slate-700'}
   ${!active && !disabled ? 'hocus:bg-slate-200 dark:hocus:bg-slate-600' : ''}
 `;

[Survived] ConditionalExpression
strategy-game-factory/game-parts/common/game-controls.tsx:109:5
   grow flex items-center justify-center py-1 px-2 text-center
   ${disabled ? 'cursor-not-allowed opacity-40' : 'cursor-pointer'}
   ${active ? 'bg-blue-500 text-white font-semibold' : 'bg-slate-100 dark:bg-slate-700'}
-  ${!active && !disabled ? 'hocus:bg-slate-200 dark:hocus:bg-slate-600' : ''}
+  ${true ? 'hocus:bg-slate-200 dark:hocus:bg-slate-600' : ''}
 `;
 

[Survived] ConditionalExpression
strategy-game-factory/game-parts/common/game-controls.tsx:109:5
   grow flex items-center justify-center py-1 px-2 text-center
   ${disabled ? 'cursor-not-allowed opacity-40' : 'cursor-pointer'}
   ${active ? 'bg-blue-500 text-white font-semibold' : 'bg-slate-100 dark:bg-slate-700'}
-  ${!active && !disabled ? 'hocus:bg-slate-200 dark:hocus:bg-slate-600' : ''}
+  ${false ? 'hocus:bg-slate-200 dark:hocus:bg-slate-600' : ''}
 `;
 
