[NoCoverage] BlockStatement
components/strategy-game-factory/game-parts/game-board.tsx:8:71
   children: React.ReactNode
 }
 
-export const GameBoard = ({ className, children }: GameBoardProps) => {
-  return (
-    <section className={`p-2 shrink-0 grow basis-2/3 ${className ?? ''}`}>
-      {children}
-    </section>
-  )
-}
+export const GameBoard = ({ className, children }: GameBoardProps) => {}
 

[NoCoverage] LogicalOperator
components/strategy-game-factory/game-parts/game-board.tsx:10:56
 
 export const GameBoard = ({ className, children }: GameBoardProps) => {
   return (
-    <section className={`p-2 shrink-0 grow basis-2/3 ${className ?? ''}`}>
+    <section className={`p-2 shrink-0 grow basis-2/3 ${className && ''}`}>
       {children}
     </section>
