[Killed] BlockStatement
components/strategy-game-factory/game-parts/game-end-dialog.tsx:28:47
 
   const localVariants = getVariantsForMode(localMode);
 
-  const handleModeChange = (newMode: Mode) => {
-    const newVariants = getVariantsForMode(newMode);
-    setLocalMode(newMode);
-    const stillAvailable = newVariants.find(v => v.originalIndex === localVariantIndex && !v.disabled);
-    if (!stillAvailable) {
-      const firstEnabled = newVariants.find(v => !v.disabled);
-      setLocalVariantIndex(firstEnabled?.originalIndex ?? newVariants[0]?.originalIndex ?? 0);
-    }
-  };
+  const handleModeChange = (newMode: Mode) => {};
 
   return (
killedBy: GameEndDialog lets the player draft a different mode
statusReason: expected false to be true // Object.is equality

[Survived] EqualityOperator
components/strategy-game-factory/game-parts/game-end-dialog.tsx:31:50
   const handleModeChange = (newMode: Mode) => {
     const newVariants = getVariantsForMode(newMode);
     setLocalMode(newMode);
-    const stillAvailable = newVariants.find(v => v.originalIndex === localVariantIndex && !v.disabled);
+    const stillAvailable = newVariants.find(v => v.originalIndex !== localVariantIndex && !v.disabled);
     if (!stillAvailable) {
       const firstEnabled = newVariants.find(v => !v.disabled);

[Survived] ArrowFunction
components/strategy-game-factory/game-parts/game-end-dialog.tsx:31:45
   const handleModeChange = (newMode: Mode) => {
     const newVariants = getVariantsForMode(newMode);
     setLocalMode(newMode);
-    const stillAvailable = newVariants.find(v => v.originalIndex === localVariantIndex && !v.disabled);
+    const stillAvailable = newVariants.find(() => undefined);
     if (!stillAvailable) {
       const firstEnabled = newVariants.find(v => !v.disabled);

[NoCoverage] BlockStatement
components/strategy-game-factory/game-parts/game-end-dialog.tsx:32:26
     const newVariants = getVariantsForMode(newMode);
     setLocalMode(newMode);
     const stillAvailable = newVariants.find(v => v.originalIndex === localVariantIndex && !v.disabled);
-    if (!stillAvailable) {
-      const firstEnabled = newVariants.find(v => !v.disabled);
-      setLocalVariantIndex(firstEnabled?.originalIndex ?? newVariants[0]?.originalIndex ?? 0);
-    }
+    if (!stillAvailable) {}
   };
 

[Survived] BooleanLiteral
components/strategy-game-factory/game-parts/game-end-dialog.tsx:32:9
     const newVariants = getVariantsForMode(newMode);
     setLocalMode(newMode);
     const stillAvailable = newVariants.find(v => v.originalIndex === localVariantIndex && !v.disabled);
-    if (!stillAvailable) {
+    if (stillAvailable) {
       const firstEnabled = newVariants.find(v => !v.disabled);
       setLocalVariantIndex(firstEnabled?.originalIndex ?? newVariants[0]?.originalIndex ?? 0);

[NoCoverage] BooleanLiteral
components/strategy-game-factory/game-parts/game-end-dialog.tsx:33:50
     setLocalMode(newMode);
     const stillAvailable = newVariants.find(v => v.originalIndex === localVariantIndex && !v.disabled);
     if (!stillAvailable) {
-      const firstEnabled = newVariants.find(v => !v.disabled);
+      const firstEnabled = newVariants.find(v => v.disabled);
       setLocalVariantIndex(firstEnabled?.originalIndex ?? newVariants[0]?.originalIndex ?? 0);
     }

[NoCoverage] ArrowFunction
components/strategy-game-factory/game-parts/game-end-dialog.tsx:33:45
     setLocalMode(newMode);
     const stillAvailable = newVariants.find(v => v.originalIndex === localVariantIndex && !v.disabled);
     if (!stillAvailable) {
-      const firstEnabled = newVariants.find(v => !v.disabled);
+      const firstEnabled = newVariants.find(() => undefined);
       setLocalVariantIndex(firstEnabled?.originalIndex ?? newVariants[0]?.originalIndex ?? 0);
     }

[NoCoverage] LogicalOperator
components/strategy-game-factory/game-parts/game-end-dialog.tsx:34:28
     const stillAvailable = newVariants.find(v => v.originalIndex === localVariantIndex && !v.disabled);
     if (!stillAvailable) {
       const firstEnabled = newVariants.find(v => !v.disabled);
-      setLocalVariantIndex(firstEnabled?.originalIndex ?? newVariants[0]?.originalIndex ?? 0);
+      setLocalVariantIndex(firstEnabled?.originalIndex && newVariants[0]?.originalIndex ?? 0);
     }
   };

[NoCoverage] OptionalChaining
components/strategy-game-factory/game-parts/game-end-dialog.tsx:34:59
     const stillAvailable = newVariants.find(v => v.originalIndex === localVariantIndex && !v.disabled);
     if (!stillAvailable) {
       const firstEnabled = newVariants.find(v => !v.disabled);
-      setLocalVariantIndex(firstEnabled?.originalIndex ?? newVariants[0]?.originalIndex ?? 0);
+      setLocalVariantIndex(firstEnabled?.originalIndex ?? newVariants[0].originalIndex ?? 0);
     }
   };

[Killed] EqualityOperator
components/strategy-game-factory/game-parts/game-end-dialog.tsx:41:29
   return (
     <div className="rounded-lg border bg-surface-elevated p-3 flex flex-col gap-3">
       <ModeSelector
-        isHumanVsHumanGame={localMode === 'vsHuman'}
+        isHumanVsHumanGame={localMode !== 'vsHuman'}
         onSwitchMode={handleModeChange}
         disabled={false}
killedBy: GameEndDialog seeds the draft mode from the game that just ended
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
components/strategy-game-factory/game-parts/game-end-dialog.tsx:41:29
   return (
     <div className="rounded-lg border bg-surface-elevated p-3 flex flex-col gap-3">
       <ModeSelector
-        isHumanVsHumanGame={localMode === 'vsHuman'}
+        isHumanVsHumanGame={false}
         onSwitchMode={handleModeChange}
         disabled={false}
killedBy: GameEndDialog seeds the draft mode from the game that just ended
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
components/strategy-game-factory/game-parts/game-end-dialog.tsx:43:19
       <ModeSelector
         isHumanVsHumanGame={localMode === 'vsHuman'}
         onSwitchMode={handleModeChange}
-        disabled={false}
+        disabled={true}
       />
       {localVariants.length > 1 && (

[Survived] LogicalOperator
components/strategy-game-factory/game-parts/game-end-dialog.tsx:45:8
         onSwitchMode={handleModeChange}
         disabled={false}
       />
-      {localVariants.length > 1 && (
-        <DifficultySelector
-          variants={localVariants}
-          selectedIndex={localVariantIndex}
-          onSelect={setLocalVariantIndex}
-          disabled={false}
-        />
-      )}
+      {localVariants.length > 1 || <DifficultySelector variants={localVariants} selectedIndex={localVariantIndex} onSelect={setLocalVariantIndex} disabled={false} />}
       <button
         onClick={() => onNewGame(localMode, localVariantIndex)}

[Survived] EqualityOperator
components/strategy-game-factory/game-parts/game-end-dialog.tsx:45:8
         onSwitchMode={handleModeChange}
         disabled={false}
       />
-      {localVariants.length > 1 && (
+      {localVariants.length >= 1 && (
         <DifficultySelector
           variants={localVariants}

[Survived] BooleanLiteral
components/strategy-game-factory/game-parts/game-end-dialog.tsx:50:21
           variants={localVariants}
           selectedIndex={localVariantIndex}
           onSelect={setLocalVariantIndex}
-          disabled={false}
+          disabled={true}
         />
       )}

[Survived] ArrowFunction
components/strategy-game-factory/game-parts/game-end-dialog.tsx:54:18
         />
       )}
       <button
-        onClick={() => onNewGame(localMode, localVariantIndex)}
+        onClick={() => undefined}
         className="primary-button"
       >

[Survived] StringLiteral
components/strategy-game-factory/game-parts/game-end-dialog.tsx:57:34
         onClick={() => onNewGame(localMode, localVariantIndex)}
         className="primary-button"
       >
-        {t({ hu: 'Új játék', en: 'New game' })}
+        {t({ hu: 'Új játék', en: "" })}
       </button>
     </div>

[NoCoverage] BooleanLiteral
components/strategy-game-factory/game-parts/game-end-dialog.tsx:79:32
   return (
     <Dialog
       open={isOpen}
-      onClose={() => setIsOpen(false)}
+      onClose={() => setIsOpen(true)}
       className="relative z-50"
     >

[Survived] ArrowFunction
components/strategy-game-factory/game-parts/game-end-dialog.tsx:79:16
   return (
     <Dialog
       open={isOpen}
-      onClose={() => setIsOpen(false)}
+      onClose={() => undefined}
       className="relative z-50"
     >

[Killed] BooleanLiteral
components/strategy-game-factory/game-parts/game-end-dialog.tsx:90:40
               {t({ hu: 'A játék véget ért', en: 'Game over' })}
             </DialogTitle>
             <button
-              onClick={() => setIsOpen(false)}
+              onClick={() => setIsOpen(true)}
               aria-label={t({ hu: 'Bezárás', en: 'Close' })}
               className="bg-slate-200 dark:bg-slate-700 rounded-sm text-xl sm:text-2xl px-1
killedBy: GameEndDialog discards an abandoned draft when reopened
statusReason: expected <input class="sr-only" …(3)></input> to be null

Ignored nodes: comments, script, style
<html
  data-headlessui-focus-visible=""
  style="overflow: hidden; padding-right: 1024px;"
>
  <head />

[Killed] ArrowFunction
components/strategy-game-factory/game-parts/game-end-dialog.tsx:90:24
               {t({ hu: 'A játék véget ért', en: 'Game over' })}
             </DialogTitle>
             <button
-              onClick={() => setIsOpen(false)}
+              onClick={() => undefined}
               aria-label={t({ hu: 'Bezárás', en: 'Close' })}
               className="bg-slate-200 dark:bg-slate-700 rounded-sm text-xl sm:text-2xl px-1
killedBy: GameEndDialog discards an abandoned draft when reopened
statusReason: expected <input class="sr-only" …(3)></input> to be null

Ignored nodes: comments, script, style
<html
  data-headlessui-focus-visible=""
  style="overflow: hidden; padding-right: 1024px;"
>
  <head />

[Survived] ObjectLiteral
components/strategy-game-factory/game-parts/game-end-dialog.tsx:91:29
             </DialogTitle>
             <button
               onClick={() => setIsOpen(false)}
-              aria-label={t({ hu: 'Bezárás', en: 'Close' })}
+              aria-label={t({})}
               className="bg-slate-200 dark:bg-slate-700 rounded-sm text-xl sm:text-2xl px-1
                 hocus:bg-slate-300 dark:hocus:bg-slate-600"
