[NoCoverage] BlockStatement
components/strategy-game-factory/game-parts/game-footer.tsx:6:42
 import { ThemeSwitcher } from '../../../theme';
 import { gameList } from '../../games/gameList';
 
-const toWesternOrder = (name: string) => {
-  const [family, ...given] = name.split(' ');
-  return [...given, family].join(' ');
-};
+const toWesternOrder = (name: string) => {};
 
 export const GameFooter = () => {

[NoCoverage] StringLiteral
components/strategy-game-factory/game-parts/game-footer.tsx:7:41
 import { gameList } from '../../games/gameList';
 
 const toWesternOrder = (name: string) => {
-  const [family, ...given] = name.split(' ');
+  const [family, ...given] = name.split("");
   return [...given, family].join(' ');
 };

[Killed] OptionalChaining
components/strategy-game-factory/game-parts/game-footer.tsx:14:18
 export const GameFooter = () => {
   const { t } = useTranslation();
   const gameId = useLocation().pathname.split('/').pop();
-  const credit = gameList[gameId!]?.credit;
+  const credit = gameList[gameId!].credit;
   return (
     <footer className="text-right">
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Cannot read properties of undefined (reading 'credit')

[Killed] LogicalOperator
components/strategy-game-factory/game-parts/game-footer.tsx:17:9
   const credit = gameList[gameId!]?.credit;
   return (
     <footer className="text-right">
-      { credit !== undefined && (
-        <p className="px-2 font-light text-sm">
-          { (credit.suggestedBy || []).length
-            ? t({
-              hu: `A játékot javasolta: ${credit.suggestedBy!.join(', ')}.`,
-              en: `Suggested by: ${credit.suggestedBy!.map(toWesternOrder).join(', ')}.`
-            })
-            : ''}
-          { (credit.developedBy || []).length
-            ? ' ' + t({
-              hu: `A játékot programozta: ${credit.developedBy!.join(', ')}.`,
-              en: `Developed by: ${credit.developedBy!.map(toWesternOrder).join(', ')}.`
-            })
-            : ''}
-        </p>
-      )}
+      { credit !== undefined || <p className="px-2 font-light text-sm">
+          {(credit.suggestedBy || []).length ? t({
+    hu: `A játékot javasolta: ${credit.suggestedBy!.join(', ')}.`,
+    en: `Suggested by: ${credit.suggestedBy!.map(toWesternOrder).join(', ')}.`
+  }) : ''}
+          {(credit.developedBy || []).length ? ' ' + t({
+    hu: `A játékot programozta: ${credit.developedBy!.join(', ')}.`,
+    en: `Developed by: ${credit.developedBy!.map(toWesternOrder).join(', ')}.`
+  }) : ''}
+        </p>}
       <div className="px-2 md:hidden flex justify-end items-center gap-3">
         <a
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Cannot read properties of undefined (reading 'suggestedBy')

[Killed] ConditionalExpression
components/strategy-game-factory/game-parts/game-footer.tsx:17:9
   const credit = gameList[gameId!]?.credit;
   return (
     <footer className="text-right">
-      { credit !== undefined && (
+      { true && (
         <p className="px-2 font-light text-sm">
           { (credit.suggestedBy || []).length
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Cannot read properties of undefined (reading 'suggestedBy')

[NoCoverage] ConditionalExpression
components/strategy-game-factory/game-parts/game-footer.tsx:19:14
     <footer className="text-right">
       { credit !== undefined && (
         <p className="px-2 font-light text-sm">
-          { (credit.suggestedBy || []).length
+          { (false).length
             ? t({
               hu: `A játékot javasolta: ${credit.suggestedBy!.join(', ')}.`,

[NoCoverage] LogicalOperator
components/strategy-game-factory/game-parts/game-footer.tsx:19:14
     <footer className="text-right">
       { credit !== undefined && (
         <p className="px-2 font-light text-sm">
-          { (credit.suggestedBy || []).length
+          { (credit.suggestedBy && []).length
             ? t({
               hu: `A játékot javasolta: ${credit.suggestedBy!.join(', ')}.`,

[NoCoverage] ObjectLiteral
components/strategy-game-factory/game-parts/game-footer.tsx:20:17
       { credit !== undefined && (
         <p className="px-2 font-light text-sm">
           { (credit.suggestedBy || []).length
-            ? t({
-              hu: `A játékot javasolta: ${credit.suggestedBy!.join(', ')}.`,
-              en: `Suggested by: ${credit.suggestedBy!.map(toWesternOrder).join(', ')}.`
-            })
+            ? t({})
             : ''}
           { (credit.developedBy || []).length

[NoCoverage] StringLiteral
components/strategy-game-factory/game-parts/game-footer.tsx:21:68
         <p className="px-2 font-light text-sm">
           { (credit.suggestedBy || []).length
             ? t({
-              hu: `A játékot javasolta: ${credit.suggestedBy!.join(', ')}.`,
+              hu: `A játékot javasolta: ${credit.suggestedBy!.join("")}.`,
               en: `Suggested by: ${credit.suggestedBy!.map(toWesternOrder).join(', ')}.`
             })

[NoCoverage] ConditionalExpression
components/strategy-game-factory/game-parts/game-footer.tsx:25:14
               en: `Suggested by: ${credit.suggestedBy!.map(toWesternOrder).join(', ')}.`
             })
             : ''}
-          { (credit.developedBy || []).length
+          { (true).length
             ? ' ' + t({
               hu: `A játékot programozta: ${credit.developedBy!.join(', ')}.`,

[NoCoverage] ConditionalExpression
components/strategy-game-factory/game-parts/game-footer.tsx:25:14
               en: `Suggested by: ${credit.suggestedBy!.map(toWesternOrder).join(', ')}.`
             })
             : ''}
-          { (credit.developedBy || []).length
+          { (false).length
             ? ' ' + t({
               hu: `A játékot programozta: ${credit.developedBy!.join(', ')}.`,

[NoCoverage] ObjectLiteral
components/strategy-game-factory/game-parts/game-footer.tsx:26:23
             })
             : ''}
           { (credit.developedBy || []).length
-            ? ' ' + t({
-              hu: `A játékot programozta: ${credit.developedBy!.join(', ')}.`,
-              en: `Developed by: ${credit.developedBy!.map(toWesternOrder).join(', ')}.`
-            })
+            ? ' ' + t({})
             : ''}
         </p>

[NoCoverage] StringLiteral
components/strategy-game-factory/game-parts/game-footer.tsx:27:19
             : ''}
           { (credit.developedBy || []).length
             ? ' ' + t({
-              hu: `A játékot programozta: ${credit.developedBy!.join(', ')}.`,
+              hu: ``,
               en: `Developed by: ${credit.developedBy!.map(toWesternOrder).join(', ')}.`
             })

[NoCoverage] StringLiteral
components/strategy-game-factory/game-parts/game-footer.tsx:28:19
           { (credit.developedBy || []).length
             ? ' ' + t({
               hu: `A játékot programozta: ${credit.developedBy!.join(', ')}.`,
-              en: `Developed by: ${credit.developedBy!.map(toWesternOrder).join(', ')}.`
+              en: ``
             })
             : ''}

[Killed] ObjectLiteral
components/strategy-game-factory/game-parts/game-footer.tsx:39:14
           target="_blank"
           rel="noreferrer"
         >
-          {t({ hu: 'Hibabejelentő', en: 'Bug report' })}
+          {t({})}
         </a>
         <ThemeSwitcher />
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Objects are not valid as a React child (found: object with keys {}). If you meant to render a collection of children, use an array instead.
