[Killed] ConditionalExpression
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:44:28
   onResetStats
 }: GameSidebarProps) => {
   const { t } = useTranslation();
-  const isNewGameAllowed = ctx.phase !== 'play' || ctx.isClientMoveAllowed;
+  const isNewGameAllowed = false;
   const activeVariantHasBotStrategy = !!variants.find(v => v.originalIndex === selectedVariantIndex)?.botStrategy;
 
killedBy: undo vsHuman resetGameState clears the undo snapshot
statusReason: Unable to find an element by: [data-testid="start-hh-game-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"
    >

[Killed] LogicalOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:44:28
   onResetStats
 }: GameSidebarProps) => {
   const { t } = useTranslation();
-  const isNewGameAllowed = ctx.phase !== 'play' || ctx.isClientMoveAllowed;
+  const isNewGameAllowed = ctx.phase !== 'play' && ctx.isClientMoveAllowed;
   const activeVariantHasBotStrategy = !!variants.find(v => v.originalIndex === selectedVariantIndex)?.botStrategy;
 
killedBy: undo vsHuman resetGameState clears the undo snapshot
statusReason: Unable to find an element by: [data-testid="start-hh-game-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"
    >

[Killed] BooleanLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:45:39
 }: GameSidebarProps) => {
   const { t } = useTranslation();
   const isNewGameAllowed = ctx.phase !== 'play' || ctx.isClientMoveAllowed;
-  const activeVariantHasBotStrategy = !!variants.find(v => v.originalIndex === selectedVariantIndex)?.botStrategy;
+  const activeVariantHasBotStrategy = !variants.find(v => v.originalIndex === selectedVariantIndex)?.botStrategy;
 
   const selectedVariant = variants.find(v => v.originalIndex === selectedVariantIndex);
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:45:55
 }: GameSidebarProps) => {
   const { t } = useTranslation();
   const isNewGameAllowed = ctx.phase !== 'play' || ctx.isClientMoveAllowed;
-  const activeVariantHasBotStrategy = !!variants.find(v => v.originalIndex === selectedVariantIndex)?.botStrategy;
+  const activeVariantHasBotStrategy = !!variants.find(() => undefined)?.botStrategy;
 
   const selectedVariant = variants.find(v => v.originalIndex === selectedVariantIndex);
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: expected true to be false // Object.is equality

[Survived] EqualityOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:47:46
   const isNewGameAllowed = ctx.phase !== 'play' || ctx.isClientMoveAllowed;
   const activeVariantHasBotStrategy = !!variants.find(v => v.originalIndex === selectedVariantIndex)?.botStrategy;
 
-  const selectedVariant = variants.find(v => v.originalIndex === selectedVariantIndex);
+  const selectedVariant = variants.find(v => v.originalIndex !== selectedVariantIndex);
   const modeSummaryLabel = t(ctx.isHumanVsHumanGame
     ? { hu: '🤝 2 játékos', en: '🤝 2 players' }

[Survived] ArrowFunction
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:47:41
   const isNewGameAllowed = ctx.phase !== 'play' || ctx.isClientMoveAllowed;
   const activeVariantHasBotStrategy = !!variants.find(v => v.originalIndex === selectedVariantIndex)?.botStrategy;
 
-  const selectedVariant = variants.find(v => v.originalIndex === selectedVariantIndex);
+  const selectedVariant = variants.find(() => undefined);
   const modeSummaryLabel = t(ctx.isHumanVsHumanGame
     ? { hu: '🤝 2 játékos', en: '🤝 2 players' }

[Survived] StringLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:49:33
 
   const selectedVariant = variants.find(v => v.originalIndex === selectedVariantIndex);
   const modeSummaryLabel = t(ctx.isHumanVsHumanGame
-    ? { hu: '🤝 2 játékos', en: '🤝 2 players' }
+    ? { hu: '🤝 2 játékos', en: '""
     : { hu: '🤖 Gép ellen', en: '🤖 vs Computer' }
   );

[Survived] StringLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:49:13
 
   const selectedVariant = variants.find(v => v.originalIndex === selectedVariantIndex);
   const modeSummaryLabel = t(ctx.isHumanVsHumanGame
-    ? { hu: '🤝 2 játékos', en: '🤝 2 players' }
+    ? { hu: "" en: '🤝 2 players' }
     : { hu: '🤖 Gép ellen', en: '🤖 vs Computer' }
   );

[Survived] StringLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:50:13
   const selectedVariant = variants.find(v => v.originalIndex === selectedVariantIndex);
   const modeSummaryLabel = t(ctx.isHumanVsHumanGame
     ? { hu: '🤝 2 játékos', en: '🤝 2 players' }
-    : { hu: '🤖 Gép ellen', en: '🤖 vs Computer' }
+    : { hu: "" en: '🤖 vs Computer' }
   );
   const defaultVariantLabel = { hu: `${selectedVariantIndex + 1}. szint`, en: `Level ${selectedVariantIndex + 1}` };

[Survived] StringLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:50:33
   const selectedVariant = variants.find(v => v.originalIndex === selectedVariantIndex);
   const modeSummaryLabel = t(ctx.isHumanVsHumanGame
     ? { hu: '🤝 2 játékos', en: '🤝 2 players' }
-    : { hu: '🤖 Gép ellen', en: '🤖 vs Computer' }
+    : { hu: '🤖 Gép ellen', en: '""
   );
   const defaultVariantLabel = { hu: `${selectedVariantIndex + 1}. szint`, en: `Level ${selectedVariantIndex + 1}` };

[Survived] ArithmeticOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:52:88
     ? { hu: '🤝 2 játékos', en: '🤝 2 players' }
     : { hu: '🤖 Gép ellen', en: '🤖 vs Computer' }
   );
-  const defaultVariantLabel = { hu: `${selectedVariantIndex + 1}. szint`, en: `Level ${selectedVariantIndex + 1}` };
+  const defaultVariantLabel = { hu: `${selectedVariantIndex + 1}. szint`, en: `Level ${selectedVariantIndex - 1}` };
   const variantSummaryLabel = variants.length > 1
     ? ' · ' + t(selectedVariant?.label ?? defaultVariantLabel)

[Survived] ArithmeticOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:52:40
     ? { hu: '🤝 2 játékos', en: '🤝 2 players' }
     : { hu: '🤖 Gép ellen', en: '🤖 vs Computer' }
   );
-  const defaultVariantLabel = { hu: `${selectedVariantIndex + 1}. szint`, en: `Level ${selectedVariantIndex + 1}` };
+  const defaultVariantLabel = { hu: `${selectedVariantIndex - 1}. szint`, en: `Level ${selectedVariantIndex + 1}` };
   const variantSummaryLabel = variants.length > 1
     ? ' · ' + t(selectedVariant?.label ?? defaultVariantLabel)

[Survived] EqualityOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:53:31
     : { hu: '🤖 Gép ellen', en: '🤖 vs Computer' }
   );
   const defaultVariantLabel = { hu: `${selectedVariantIndex + 1}. szint`, en: `Level ${selectedVariantIndex + 1}` };
-  const variantSummaryLabel = variants.length > 1
+  const variantSummaryLabel = variants.length >= 1
     ? ' · ' + t(selectedVariant?.label ?? defaultVariantLabel)
     : '';

[Survived] EqualityOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:53:31
     : { hu: '🤖 Gép ellen', en: '🤖 vs Computer' }
   );
   const defaultVariantLabel = { hu: `${selectedVariantIndex + 1}. szint`, en: `Level ${selectedVariantIndex + 1}` };
-  const variantSummaryLabel = variants.length > 1
+  const variantSummaryLabel = variants.length <= 1
     ? ' · ' + t(selectedVariant?.label ?? defaultVariantLabel)
     : '';

[Survived] LogicalOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:54:17
   );
   const defaultVariantLabel = { hu: `${selectedVariantIndex + 1}. szint`, en: `Level ${selectedVariantIndex + 1}` };
   const variantSummaryLabel = variants.length > 1
-    ? ' · ' + t(selectedVariant?.label ?? defaultVariantLabel)
+    ? ' · ' + t(selectedVariant?.label && defaultVariantLabel)
     : '';
 

[Survived] OptionalChaining
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:54:17
   );
   const defaultVariantLabel = { hu: `${selectedVariantIndex + 1}. szint`, en: `Level ${selectedVariantIndex + 1}` };
   const variantSummaryLabel = variants.length > 1
-    ? ' · ' + t(selectedVariant?.label ?? defaultVariantLabel)
+    ? ' · ' + t(selectedVariant.label ?? defaultVariantLabel)
     : '';
 

[Survived] EqualityOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:61:13
     <div className="p-2 flex flex-col grow shrink-0 basis-64 gap-3">
       <div className="rounded-lg border bg-slate-100 dark:bg-slate-800 p-2 sm:p-3 mb-2 sm:mb-8 flex flex-col gap-3">
         {ctx.isHumanVsHumanGame
-          ? ctx.phase !== 'roleSelection' && <PlayerTurnPanel ctx={ctx} />
+          ? ctx.phase === 'roleSelection' && <PlayerTurnPanel ctx={ctx} />
           : <p className="text-center font-bold text-base sm:text-lg">{t(getCtaText(ctx))}</p>
         }

[Survived] LogicalOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:61:13
     <div className="p-2 flex flex-col grow shrink-0 basis-64 gap-3">
       <div className="rounded-lg border bg-slate-100 dark:bg-slate-800 p-2 sm:p-3 mb-2 sm:mb-8 flex flex-col gap-3">
         {ctx.isHumanVsHumanGame
-          ? ctx.phase !== 'roleSelection' && <PlayerTurnPanel ctx={ctx} />
+          ? ctx.phase !== 'roleSelection' || <PlayerTurnPanel ctx={ctx} />
           : <p className="text-center font-bold text-base sm:text-lg">{t(getCtaText(ctx))}</p>
         }

[Killed] ConditionalExpression
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:65:10
           : <p className="text-center font-bold text-base sm:text-lg">{t(getCtaText(ctx))}</p>
         }
 
-        {ctx.phase === 'play' && (
-          <div className="flex flex-col gap-2">
-            <div className="relative flex justify-center">
-              {!ctx.isHumanVsHumanGame && !ctx.isClientMoveAllowed && (
-                <div className="absolute inset-0 flex items-center justify-center">
-                  <Spinner />
-                </div>
-              )}
-              <p className={`italic text-justify ${!ctx.isClientMoveAllowed ? 'invisible' : ''}`}>
-                {stepDescription}
-              </p>
-            </div>
-            <button
-              data-testid="undo-btn"
-              className="secondary-button text-sm"
-              disabled={!moves.canUndo}
-              onClick={() => moves.undo()}
-            >
-              ↶ {t({ hu: 'Visszavonás', en: 'Undo' })}
-            </button>
-          </div>
-        )}
+        {true}
 
         {ctx.phase === 'roleSelection' && (
killedBy: undo vsHuman undo button is disabled before any move
statusReason: Unable to find an element by: [data-testid="undo-btn"]

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"
    >

[Killed] LogicalOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:65:10
           : <p className="text-center font-bold text-base sm:text-lg">{t(getCtaText(ctx))}</p>
         }
 
-        {ctx.phase === 'play' && (
-          <div className="flex flex-col gap-2">
-            <div className="relative flex justify-center">
-              {!ctx.isHumanVsHumanGame && !ctx.isClientMoveAllowed && (
-                <div className="absolute inset-0 flex items-center justify-center">
-                  <Spinner />
-                </div>
-              )}
-              <p className={`italic text-justify ${!ctx.isClientMoveAllowed ? 'invisible' : ''}`}>
-                {stepDescription}
-              </p>
-            </div>
-            <button
-              data-testid="undo-btn"
-              className="secondary-button text-sm"
-              disabled={!moves.canUndo}
-              onClick={() => moves.undo()}
-            >
-              ↶ {t({ hu: 'Visszavonás', en: 'Undo' })}
-            </button>
-          </div>
-        )}
+        {ctx.phase === 'play' || <div className="flex flex-col gap-2">
+            <div className="relative flex justify-center">
+              {!ctx.isHumanVsHumanGame && !ctx.isClientMoveAllowed && <div className="absolute inset-0 flex items-center justify-center">
+                  <Spinner />
+                </div>}
+              <p className={`italic text-justify ${!ctx.isClientMoveAllowed ? 'invisible' : ''}`}>
+                {stepDescription}
+              </p>
+            </div>
+            <button data-testid="undo-btn" className="secondary-button text-sm" disabled={!moves.canUndo} onClick={() => moves.undo()}>
+              ↶ {t({
+      hu: 'Visszavonás',
+      en: 'Undo'
+    })}
+            </button>
+          </div>}
 
         {ctx.phase === 'roleSelection' && (
killedBy: undo vsHuman undo button is disabled before any move
statusReason: Unable to find an element by: [data-testid="undo-btn"]

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"
    >

[Killed] LogicalOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:68:16
         {ctx.phase === 'play' && (
           <div className="flex flex-col gap-2">
             <div className="relative flex justify-center">
-              {!ctx.isHumanVsHumanGame && !ctx.isClientMoveAllowed && (
-                <div className="absolute inset-0 flex items-center justify-center">
-                  <Spinner />
-                </div>
-              )}
+              {!ctx.isHumanVsHumanGame && !ctx.isClientMoveAllowed || <div className="absolute inset-0 flex items-center justify-center">
+                  <Spinner />
+                </div>}
               <p className={`italic text-justify ${!ctx.isClientMoveAllowed ? 'invisible' : ''}`}>
                 {stepDescription}
killedBy: GameSidebar shows spinner in vsComputer play when it is the computer turn
statusReason: expected null not to be null

[Killed] BooleanLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:68:16
         {ctx.phase === 'play' && (
           <div className="flex flex-col gap-2">
             <div className="relative flex justify-center">
-              {!ctx.isHumanVsHumanGame && !ctx.isClientMoveAllowed && (
+              {ctx.isHumanVsHumanGame && !ctx.isClientMoveAllowed && (
                 <div className="absolute inset-0 flex items-center justify-center">
                   <Spinner />
killedBy: GameSidebar shows spinner in vsComputer play when it is the computer turn
statusReason: expected null not to be null

[Survived] BooleanLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:73:52
                   <Spinner />
                 </div>
               )}
-              <p className={`italic text-justify ${!ctx.isClientMoveAllowed ? 'invisible' : ''}`}>
+              <p className={`italic text-justify ${ctx.isClientMoveAllowed ? 'invisible' : ''}`}>
                 {stepDescription}
               </p>

[Killed] BooleanLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:80:25
             <button
               data-testid="undo-btn"
               className="secondary-button text-sm"
-              disabled={!moves.canUndo}
+              disabled={moves.canUndo}
               onClick={() => moves.undo()}
             >
killedBy: undo vsHuman undo button is disabled before any move
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:81:24
               data-testid="undo-btn"
               className="secondary-button text-sm"
               disabled={!moves.canUndo}
-              onClick={() => moves.undo()}
+              onClick={() => undefined}
             >
               ↶ {t({ hu: 'Visszavonás', en: 'Undo' })}
killedBy: undo vsHuman clicking undo restores the previous board and player
statusReason: expected 'initial,moved' to be 'initial' // Object.is equality

[Killed] ObjectLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:83:20
               disabled={!moves.canUndo}
               onClick={() => moves.undo()}
             >
-              ↶ {t({ hu: 'Visszavonás', en: 'Undo' })}
+              ↶ {t({})}
             </button>
           </div>
killedBy: isClientMoveAllowed allows both players to move in vsHuman mode
statusReason: Objects are not valid as a React child (found: object with keys {}). If you meant to render a collection of children, use an array instead.

[Survived] StringLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:83:45
               disabled={!moves.canUndo}
               onClick={() => moves.undo()}
             >
-              ↶ {t({ hu: 'Visszavonás', en: 'Undo' })}
+              ↶ {t({ hu: 'Visszavonás', en: "" })}
             </button>
           </div>

[Killed] ConditionalExpression
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:88:10
           </div>
         )}
 
-        {ctx.phase === 'roleSelection' && (
-          ctx.isHumanVsHumanGame
-            ? <PlayerNameSetup
-                roleLabels={roleLabels}
-                playerNames={playerNames}
-                setPlayerNames={moves.setPlayerNames}
-                onStart={moves.startGame}
-              />
-            : <RoleSelector
-                roleLabels={roleLabels}
-                onRoleSelection={moves.startGame}
-                disabled={!activeVariantHasBotStrategy}
-              />
-        )}
+        {true}
       </div>
 
killedBy: isClientMoveAllowed allows both players to move in vsHuman mode
statusReason: Unable to find an element by: [data-testid="start-hh-game-0"]

Ignored nodes: comments, script, style
<body>
  <div />
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"

[Killed] EqualityOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:88:10
           </div>
         )}
 
-        {ctx.phase === 'roleSelection' && (
+        {ctx.phase !== 'roleSelection' && (
           ctx.isHumanVsHumanGame
             ? <PlayerNameSetup
killedBy: isClientMoveAllowed allows both players to move in vsHuman mode
statusReason: Unable to find an element by: [data-testid="start-hh-game-0"]

Ignored nodes: comments, script, style
<body>
  <div />
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"

[Killed] BooleanLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:99:27
             : <RoleSelector
                 roleLabels={roleLabels}
                 onRoleSelection={moves.startGame}
-                disabled={!activeVariantHasBotStrategy}
+                disabled={activeVariantHasBotStrategy}
               />
         )}
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:105:10
       </div>
 
       <div className="mt-auto flex flex-col gap-3">
-        {ctx.phase !== 'play' ? (
+        {true ? (
           <ModeDifficultySelectors
             ctx={ctx}

[Survived] EqualityOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:105:10
       </div>
 
       <div className="mt-auto flex flex-col gap-3">
-        {ctx.phase !== 'play' ? (
+        {ctx.phase === 'play' ? (
           <ModeDifficultySelectors
             ctx={ctx}

[Survived] BooleanLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:111:23
             moves={moves}
             variants={variants}
             selectedVariantIndex={selectedVariantIndex}
-            disabled={!isNewGameAllowed}
+            disabled={isNewGameAllowed}
           />
         ) : (

[Killed] BooleanLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:134:21
         <button
           data-testid="new-game-btn"
           className="secondary-button"
-          disabled={!isNewGameAllowed}
+          disabled={isNewGameAllowed}
           onClick={() => moves.resetGameState()}
         >
killedBy: undo vsHuman resetGameState clears the undo snapshot
statusReason: Unable to find an element by: [data-testid="start-hh-game-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"
    >

[Killed] ArrowFunction
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:135:20
           data-testid="new-game-btn"
           className="secondary-button"
           disabled={!isNewGameAllowed}
-          onClick={() => moves.resetGameState()}
+          onClick={() => undefined}
         >
           {t({ hu: 'Új játék', en: 'New game' })}
killedBy: undo vsHuman resetGameState clears the undo snapshot
statusReason: Unable to find an element by: [data-testid="start-hh-game-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"
    >

[Killed] ObjectLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:137:14
           disabled={!isNewGameAllowed}
           onClick={() => moves.resetGameState()}
         >
-          {t({ hu: 'Új játék', en: 'New game' })}
+          {t({})}
         </button>
       </div>
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Objects are not valid as a React child (found: object with keys {}). If you meant to render a collection of children, use an array instead.

[Killed] LogicalOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:140:8
           {t({ hu: 'Új játék', en: 'New game' })}
         </button>
       </div>
-      {!ctx.isHumanVsHumanGame && stats && (
-        <WinLossCounter stats={stats} onReset={onResetStats!} />
-      )}
+      {!ctx.isHumanVsHumanGame && stats || <WinLossCounter stats={stats} onReset={onResetStats!} />}
     </div>
   );
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Objects are not valid as a React child (found: object with keys {win, loss}). If you meant to render a collection of children, use an array instead.

[Survived] LogicalOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:140:8
           {t({ hu: 'Új játék', en: 'New game' })}
         </button>
       </div>
-      {!ctx.isHumanVsHumanGame && stats && (
+      {!ctx.isHumanVsHumanGame || stats && (
         <WinLossCounter stats={stats} onReset={onResetStats!} />
       )}

[Killed] ArrowFunction
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:147:33
   );
 };
 
-const ModeDifficultySelectors = ({
-  ctx, moves, variants, selectedVariantIndex, disabled
-}: {
-  ctx: Ctx
-  moves: SidebarMoves
-  variants: Variant[]
-  selectedVariantIndex: number
-  disabled: boolean
-}) => (
-  <>
-    <ModeSelector
-      isHumanVsHumanGame={ctx.isHumanVsHumanGame}
-      onSwitchMode={moves.switchMode}
-      disabled={disabled}
-    />
-    {variants.length > 1 && (
-      <DifficultySelector
-        variants={variants}
-        selectedIndex={selectedVariantIndex}
-        onSelect={moves.setDifficulty}
-        disabled={disabled}
-      />
-    )}
-  </>
-);
+const ModeDifficultySelectors = () => undefined;
 
 const RoleSelector = ({ roleLabels, onRoleSelection, disabled }: {
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Found multiple elements by: [data-testid="role-btn-1"]

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  class="primary-button flex-1 min-w-24 sm:flex-none sm:min-w-0"
  data-testid="role-btn-1"

[Killed] LogicalOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:162:6
       onSwitchMode={moves.switchMode}
       disabled={disabled}
     />
-    {variants.length > 1 && (
-      <DifficultySelector
-        variants={variants}
-        selectedIndex={selectedVariantIndex}
-        onSelect={moves.setDifficulty}
-        disabled={disabled}
-      />
-    )}
+    {variants.length > 1 || <DifficultySelector variants={variants} selectedIndex={selectedVariantIndex} onSelect={moves.setDifficulty} disabled={disabled} />}
   </>
 );
killedBy: per-variant rule shows the default variant rule and switches when another variant is selected
statusReason: Cannot read properties of undefined (reading 'querySelectorAll')

[Killed] ConditionalExpression
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:162:6
       onSwitchMode={moves.switchMode}
       disabled={disabled}
     />
-    {variants.length > 1 && (
-      <DifficultySelector
-        variants={variants}
-        selectedIndex={selectedVariantIndex}
-        onSelect={moves.setDifficulty}
-        disabled={disabled}
-      />
-    )}
+    {true}
   </>
 );
killedBy: per-variant rule shows the default variant rule and switches when another variant is selected
statusReason: Cannot read properties of undefined (reading 'querySelectorAll')

[Killed] BlockStatement
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:177:7
   roleLabels?: [I18nString, I18nString]
   onRoleSelection: (roleIndex: number) => void
   disabled: boolean
-}) => {
-  const { t } = useTranslation();
-  return <div className="flex flex-row flex-wrap sm:flex-col gap-2">
-    {[
-      { hu: 'Kezdő leszek', en: "I'll go first" },
-      { hu: 'Második leszek', en: "I'll go second" }
-    ].map((defaultLabel, i) => (
-      <button
-        key={i}
-        data-testid={`role-btn-${i}`}
-        className="primary-button flex-1 min-w-24 sm:flex-none sm:min-w-0"
-        disabled={disabled}
-        onClick={() => onRoleSelection(i)}
-      >
-        {t(roleLabels ? roleLabels[i] : defaultLabel)}
-      </button>
-    ))}
-  </div>;
-};
+}) => {};
 
 const PlayerNameSetup = ({ roleLabels, playerNames, setPlayerNames, onStart }: {
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: Unable to find an element by: [data-testid="role-btn-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"
    >

[Killed] ArrayDeclaration
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:180:6
 }) => {
   const { t } = useTranslation();
   return <div className="flex flex-row flex-wrap sm:flex-col gap-2">
-    {[
-      { hu: 'Kezdő leszek', en: "I'll go first" },
-      { hu: 'Második leszek', en: "I'll go second" }
-    ].map((defaultLabel, i) => (
+    {[].map((defaultLabel, i) => (
       <button
         key={i}
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: Unable to find an element by: [data-testid="role-btn-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"
    >

[Survived] StringLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:182:13
   return <div className="flex flex-row flex-wrap sm:flex-col gap-2">
     {[
       { hu: 'Kezdő leszek', en: "I'll go first" },
-      { hu: 'Második leszek', en: "I'll go second" }
+      { hu: "", en: "I'll go second" }
     ].map((defaultLabel, i) => (
       <button

[Survived] StringLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:182:35
   return <div className="flex flex-row flex-wrap sm:flex-col gap-2">
     {[
       { hu: 'Kezdő leszek', en: "I'll go first" },
-      { hu: 'Második leszek', en: "I'll go second" }
+      { hu: 'Második leszek', en: "" }
     ].map((defaultLabel, i) => (
       <button

[Killed] ArrowFunction
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:183:11
     {[
       { hu: 'Kezdő leszek', en: "I'll go first" },
       { hu: 'Második leszek', en: "I'll go second" }
-    ].map((defaultLabel, i) => (
-      <button
-        key={i}
-        data-testid={`role-btn-${i}`}
-        className="primary-button flex-1 min-w-24 sm:flex-none sm:min-w-0"
-        disabled={disabled}
-        onClick={() => onRoleSelection(i)}
-      >
-        {t(roleLabels ? roleLabels[i] : defaultLabel)}
-      </button>
-    ))}
+    ].map(() => undefined)}
   </div>;
 };
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: Unable to find an element by: [data-testid="role-btn-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"
    >

[Killed] ArrowFunction
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:189:18
         data-testid={`role-btn-${i}`}
         className="primary-button flex-1 min-w-24 sm:flex-none sm:min-w-0"
         disabled={disabled}
-        onClick={() => onRoleSelection(i)}
+        onClick={() => undefined}
       >
         {t(roleLabels ? roleLabels[i] : defaultLabel)}
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:209:17
     {([0, 1] as const).map(i => (
       <div key={i} className="flex items-center gap-2 flex-wrap">
         <Input
-          name={i === 0 ? 'name_of_first_player' : 'name_of_second_player'}
+          name={true ? 'name_of_first_player' : 'name_of_second_player'}
           className="border rounded-md text-slate-600 dark:text-slate-200
            bg-surface-elevated
