[Survived] ConditionalExpression
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:209:17
     {([0, 1] as const).map(i => (
       <div key={i} className="flex items-center gap-2 flex-wrap">
         <Input
-          name={i === 0 ? 'name_of_first_player' : 'name_of_second_player'}
+          name={false ? 'name_of_first_player' : 'name_of_second_player'}
           className="border rounded-md text-slate-600 dark:text-slate-200
            bg-surface-elevated

[Survived] ArrayDeclaration
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:213:26
           className="border rounded-md text-slate-600 dark:text-slate-200
            bg-surface-elevated
             px-2 py-1 text-sm flex-1 min-w-20 focus:outline-none focus:ring-1 focus:ring-blue-400"
-          placeholder={t([
-            { hu: 'Neved (Nyuszika)', en: 'Your name (Pip)' },
-            { hu: 'Neved (Teknős)', en: 'Your name (Dot)' }
-          ][i])}
+          placeholder={t([][i])}
           value={playerNames[i]}
           onChange={e => {

[Survived] StringLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:214:43
            bg-surface-elevated
             px-2 py-1 text-sm flex-1 min-w-20 focus:outline-none focus:ring-1 focus:ring-blue-400"
           placeholder={t([
-            { hu: 'Neved (Nyuszika)', en: 'Your name (Pip)' },
+            { hu: 'Neved (Nyuszika)', en: "" },
             { hu: 'Neved (Teknős)', en: 'Your name (Dot)' }
           ][i])}

[NoCoverage] BlockStatement
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:218:26
             { hu: 'Neved (Teknős)', en: 'Your name (Dot)' }
           ][i])}
           value={playerNames[i]}
-          onChange={e => {
-            const updated: [string, string] = [playerNames[0], playerNames[1]];
-            updated[i] = e.target.value.trim();
-            setPlayerNames(updated);
-          }}
+          onChange={e => {}}
         />
         <button

[NoCoverage] MethodExpression
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:220:26
           value={playerNames[i]}
           onChange={e => {
             const updated: [string, string] = [playerNames[0], playerNames[1]];
-            updated[i] = e.target.value.trim();
+            updated[i] = e.target.value;
             setPlayerNames(updated);
           }}

[Killed] StringLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:225:24
           }}
         />
         <button
-          data-testid={`start-hh-game-${i}`}
+          data-testid={``}
           className="shrink-0 px-2 py-1 text-sm font-semibold rounded-md
             bg-blue-500 text-white hocus:bg-blue-600"
killedBy: isClientMoveAllowed allows both players to move in vsHuman mode
statusReason: Unable to find an element by: [data-testid="start-hh-game-0"]

Ignored nodes: comments, script, style
<body>
  <div />
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"

[Killed] BlockStatement
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:228:26
           data-testid={`start-hh-game-${i}`}
           className="shrink-0 px-2 py-1 text-sm font-semibold rounded-md
             bg-blue-500 text-white hocus:bg-blue-600"
-          onClick={() => {
-            setPlayerNames([playerNames[i], playerNames[1 - i]]);
-            onStart();
-          }}
+          onClick={() => {}}
         >
           {t({ hu: 'Kezdek', en: 'I start' })}
killedBy: isClientMoveAllowed allows both players to move in vsHuman mode
statusReason: expected true to be false // Object.is equality

[Survived] ArithmeticOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:229:57
           className="shrink-0 px-2 py-1 text-sm font-semibold rounded-md
             bg-blue-500 text-white hocus:bg-blue-600"
           onClick={() => {
-            setPlayerNames([playerNames[i], playerNames[1 - i]]);
+            setPlayerNames([playerNames[i], playerNames[1 + i]]);
             onStart();
           }}

[Killed] LogicalOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:234:12
           }}
         >
           {t({ hu: 'Kezdek', en: 'I start' })}
-          {roleLabels && ` (${t(roleLabels[0])})`}
+          {roleLabels || ` (${t(roleLabels[0])})`}
         </button>
       </div>
killedBy: GameSidebar shows name inputs in vsHuman roleSelection
statusReason: Cannot read properties of undefined (reading '0')

[Survived] ConditionalExpression
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:234:12
           }}
         >
           {t({ hu: 'Kezdek', en: 'I start' })}
-          {roleLabels && ` (${t(roleLabels[0])})`}
+          {false}
         </button>
       </div>

[Killed] ArrowFunction
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:242:17
   );
 };
 
-const Spinner = () => (
-  <div
-    role="status" aria-label="Loading"
-    className="animate-spin h-8 w-8 border-t-blue-600 rounded-full border-4"
-  ></div>
-);
+const Spinner = () => undefined;
 
 const PlayerTurnPanel = ({ ctx }: { ctx: Ctx }) => {
killedBy: GameSidebar shows spinner in vsComputer play when it is the computer turn
statusReason: expected null not to be null

[Survived] ArrowFunction
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:250:22
 );
 
 const PlayerTurnPanel = ({ ctx }: { ctx: Ctx }) => {
-  const playerName = (i: number) => ctx.resolvedPlayerNames[i];
+  const playerName = () => undefined;
   const isEnd = ctx.phase === 'gameEnd';
 

[Survived] EqualityOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:251:17
 
 const PlayerTurnPanel = ({ ctx }: { ctx: Ctx }) => {
   const playerName = (i: number) => ctx.resolvedPlayerNames[i];
-  const isEnd = ctx.phase === 'gameEnd';
+  const isEnd = ctx.phase !== 'gameEnd';
 
   return (

[Survived] ConditionalExpression
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:251:17
 
 const PlayerTurnPanel = ({ ctx }: { ctx: Ctx }) => {
   const playerName = (i: number) => ctx.resolvedPlayerNames[i];
-  const isEnd = ctx.phase === 'gameEnd';
+  const isEnd = true;
 
   return (

[Survived] BlockStatement
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:255:24
 
   return (
     <div className="flex flex-row flex-wrap sm:flex-col gap-2" aria-live="polite">
-      {[0, 1].map(i => {
-        const isActive = !isEnd && ctx.currentPlayer === i;
-        const isWinner = isEnd && ctx.winnerIndex === i;
-        const highlighted = isActive || isWinner;
-        return (
-          <div
-            key={i}
-            className={`
-              flex-1 sm:flex-none flex items-center gap-2 rounded-md px-2 py-1 sm:px-3 sm:py-2
-              border-l-4 drop-shadow-sm
-              ${highlighted
-                ? 'bg-blue-50 dark:bg-blue-950 border-blue-400 dark:border-blue-700'
-                : 'bg-surface-elevated'}
-            `}
-          >
-            <span className={`flex-1 ${highlighted ? 'font-bold text-blue-700 dark:text-blue-300' : ''}`}>
-              {playerName(i)}
-            </span>
-            {isWinner && <span>🏆</span>}
-          </div>
-        );
-      })}
+      {[0, 1].map(i => {})}
     </div>
   );

[Survived] ConditionalExpression
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:256:26
   return (
     <div className="flex flex-row flex-wrap sm:flex-col gap-2" aria-live="polite">
       {[0, 1].map(i => {
-        const isActive = !isEnd && ctx.currentPlayer === i;
+        const isActive = false;
         const isWinner = isEnd && ctx.winnerIndex === i;
         const highlighted = isActive || isWinner;

[Survived] LogicalOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:256:26
   return (
     <div className="flex flex-row flex-wrap sm:flex-col gap-2" aria-live="polite">
       {[0, 1].map(i => {
-        const isActive = !isEnd && ctx.currentPlayer === i;
+        const isActive = !isEnd || ctx.currentPlayer === i;
         const isWinner = isEnd && ctx.winnerIndex === i;
         const highlighted = isActive || isWinner;

[Survived] EqualityOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:257:35
     <div className="flex flex-row flex-wrap sm:flex-col gap-2" aria-live="polite">
       {[0, 1].map(i => {
         const isActive = !isEnd && ctx.currentPlayer === i;
-        const isWinner = isEnd && ctx.winnerIndex === i;
+        const isWinner = isEnd && ctx.winnerIndex !== i;
         const highlighted = isActive || isWinner;
         return (

[Survived] ConditionalExpression
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:257:26
     <div className="flex flex-row flex-wrap sm:flex-col gap-2" aria-live="polite">
       {[0, 1].map(i => {
         const isActive = !isEnd && ctx.currentPlayer === i;
-        const isWinner = isEnd && ctx.winnerIndex === i;
+        const isWinner = true;
         const highlighted = isActive || isWinner;
         return (

[Survived] LogicalOperator
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:258:29
       {[0, 1].map(i => {
         const isActive = !isEnd && ctx.currentPlayer === i;
         const isWinner = isEnd && ctx.winnerIndex === i;
-        const highlighted = isActive || isWinner;
+        const highlighted = isActive && isWinner;
         return (
           <div

[Survived] ConditionalExpression
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:258:29
       {[0, 1].map(i => {
         const isActive = !isEnd && ctx.currentPlayer === i;
         const isWinner = isEnd && ctx.winnerIndex === i;
-        const highlighted = isActive || isWinner;
+        const highlighted = true;
         return (
           <div

[Survived] StringLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:267:19
               border-l-4 drop-shadow-sm
               ${highlighted
                 ? 'bg-blue-50 dark:bg-blue-950 border-blue-400 dark:border-blue-700'
-                : 'bg-surface-elevated'}
+                : ""}
             `}
           >

[Survived] StringLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:270:101
                 : 'bg-surface-elevated'}
             `}
           >
-            <span className={`flex-1 ${highlighted ? 'font-bold text-blue-700 dark:text-blue-300' : ''}`}>
+            <span className={`flex-1 ${highlighted ? 'font-bold text-blue-700 dark:text-blue-300' : "Stryker was here!"}`}>
               {playerName(i)}
             </span>

[Survived] ConditionalExpression
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:273:14
             <span className={`flex-1 ${highlighted ? 'font-bold text-blue-700 dark:text-blue-300' : ''}`}>
               {playerName(i)}
             </span>
-            {isWinner && <span>🏆</span>}
+            {false
           </div>
         );

[Survived] ConditionalExpression
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:273:14
             <span className={`flex-1 ${highlighted ? 'font-bold text-blue-700 dark:text-blue-300' : ''}`}>
               {playerName(i)}
             </span>
-            {isWinner && <span>🏆</span>}
+            {true
           </div>
         );

[Survived] BlockStatement
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:281:87
   );
 };
 
-const WinLossCounter = ({ stats, onReset }: { stats: Stats; onReset: () => void }) => {
-  const { t } = useTranslation();
-  return (
-    <div className="flex items-center justify-between text-sm text-slate-500 dark:text-slate-400">
-      <span title={t({
-        hu: `Megnyert játékok: ${stats.win}, Elvesztett játékok: ${stats.loss}`,
-        en: `Wins: ${stats.win}, Losses: ${stats.loss}`
-      })}>
-        🏆 {stats.win} · 💀 {stats.loss}
-      </span>
-      <button
-        onClick={onReset}
-        aria-label={t({ hu: 'Számlálók nullázása', en: 'Reset counters' })}
-        className="text-xs hocus:text-slate-600 dark:hocus:text-slate-300"
-      >
-        ↻
-      </button>
-    </div>
-  );
-};
+const WinLossCounter = ({ stats, onReset }: { stats: Stats; onReset: () => void }) => {};
 

[Survived] StringLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:287:13
     <div className="flex items-center justify-between text-sm text-slate-500 dark:text-slate-400">
       <span title={t({
         hu: `Megnyert játékok: ${stats.win}, Elvesztett játékok: ${stats.loss}`,
-        en: `Wins: ${stats.win}, Losses: ${stats.loss}`
+        en: ``
       })}>
         🏆 {stats.win} · 💀 {stats.loss}

[Survived] ObjectLiteral
strategy-game-factory/game-parts/game-sidebar/game-sidebar.tsx:293:23
       </span>
       <button
         onClick={onReset}
-        aria-label={t({ hu: 'Számlálók nullázása', en: 'Reset counters' })}
+        aria-label={t({})}
         className="text-xs hocus:text-slate-600 dark:hocus:text-slate-300"
       >
