[Survived] StringLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:24:27
 import { stepDelay } from './engine/timing';
 
 const DEFAULT_PLAYER_NAMES: I18nString[] = [
-  { hu: '1. játékos', en: '1st player' },
+  { hu: '1. játékos', en: "" },
   { hu: '2. játékos', en: '2nd player' }
 ];

[Killed] LogicalOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:64:27
   const Game = () => {
     const { t } = useTranslation();
     const [selectedVariantIndex, setSelectedVariantIndex] = useState(defaultVariantIndex);
-    const activeVariant = resolvedVariants[selectedVariantIndex] ?? defaultVariant;
+    const activeVariant = resolvedVariants[selectedVariantIndex] && defaultVariant;
     const defaultGenerateStartBoard = defaultVariant.generateStartBoard!;
     const activeGenerateStartBoard = activeVariant.generateStartBoard ?? defaultGenerateStartBoard;
killedBy: per-variant rule shows the default variant rule and switches when another variant is selected
statusReason: Unable to find an element with the text: RULE_TWO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"
    >

[Survived] LogicalOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:66:38
     const [selectedVariantIndex, setSelectedVariantIndex] = useState(defaultVariantIndex);
     const activeVariant = resolvedVariants[selectedVariantIndex] ?? defaultVariant;
     const defaultGenerateStartBoard = defaultVariant.generateStartBoard!;
-    const activeGenerateStartBoard = activeVariant.generateStartBoard ?? defaultGenerateStartBoard;
+    const activeGenerateStartBoard = activeVariant.generateStartBoard && defaultGenerateStartBoard;
 
     // Authoritative game state lives in a synchronous store outside React (see

[Killed] ArrowFunction
src/components/strategy-game-factory/strategy-game-factory.tsx:71:30
     // Authoritative game state lives in a synchronous store outside React (see
     // engine/store.ts); React renders a snapshot of it. Bots and chained
     // dispatches always read the store, so they can never see stale state.
-    const [store] = useState(() => createGameStore(createInitialCoreState(activeGenerateStartBoard())));
+    const [store] = useState(() => undefined);
     const state = useSyncExternalStore(store.subscribe, store.getState);
     const { board, phase, mode, currentPlayer, chosenRoleIndex, undoSnapshot } = state;
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Cannot read properties of undefined (reading 'subscribe')

[Killed] BooleanLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:75:68
     const state = useSyncExternalStore(store.subscribe, store.getState);
     const { board, phase, mode, currentPlayer, chosenRoleIndex, undoSnapshot } = state;
 
-    const [isGameEndDialogOpen, setIsGameEndDialogOpen] = useState(false);
+    const [isGameEndDialogOpen, setIsGameEndDialogOpen] = useState(true);
     const [gameUuid, setGameUuid] = useState(crypto.randomUUID());
     const botTimeoutRef = useRef<ReturnType<typeof setTimeout> | null>(null);
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Found multiple elements by: [data-testid="role-btn-1"]

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  class="primary-button flex-1 min-w-24 sm:flex-none sm:min-w-0"
  data-testid="role-btn-1"

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:78:76
     const [isGameEndDialogOpen, setIsGameEndDialogOpen] = useState(false);
     const [gameUuid, setGameUuid] = useState(crypto.randomUUID());
     const botTimeoutRef = useRef<ReturnType<typeof setTimeout> | null>(null);
-    const [playerNames, setPlayerNames] = useState<[string, string]>(() => {
-      try {
-        const stored = localStorage.getItem('durer-player-names');
-        if (stored) return JSON.parse(stored) as [string, string];
-      } catch {}
-      return ['', ''];
-    });
+    const [playerNames, setPlayerNames] = useState<[string, string]>(() => {});
 
     useEffect(() => {
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Cannot read properties of undefined (reading '0')

[Survived] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:79:11
     const [gameUuid, setGameUuid] = useState(crypto.randomUUID());
     const botTimeoutRef = useRef<ReturnType<typeof setTimeout> | null>(null);
     const [playerNames, setPlayerNames] = useState<[string, string]>(() => {
-      try {
-        const stored = localStorage.getItem('durer-player-names');
-        if (stored) return JSON.parse(stored) as [string, string];
-      } catch {}
+      try {} catch {}
       return ['', ''];
     });

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:81:13
     const [playerNames, setPlayerNames] = useState<[string, string]>(() => {
       try {
         const stored = localStorage.getItem('durer-player-names');
-        if (stored) return JSON.parse(stored) as [string, string];
+        if (true) return JSON.parse(stored) as [string, string];
       } catch {}
       return ['', ''];
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Cannot read properties of null (reading '0')

[Survived] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:81:13
     const [playerNames, setPlayerNames] = useState<[string, string]>(() => {
       try {
         const stored = localStorage.getItem('durer-player-names');
-        if (stored) return JSON.parse(stored) as [string, string];
+        if (false) return JSON.parse(stored) as [string, string];
       } catch {}
       return ['', ''];

[Survived] StringLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:83:19
         const stored = localStorage.getItem('durer-player-names');
         if (stored) return JSON.parse(stored) as [string, string];
       } catch {}
-      return ['', ''];
+      return ['', "Stryker was here!"];
     });
 

[Survived] StringLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:83:15
         const stored = localStorage.getItem('durer-player-names');
         if (stored) return JSON.parse(stored) as [string, string];
       } catch {}
-      return ['', ''];
+      return ["Stryker was here!", ''];
     });
 

[Survived] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:86:21
       return ['', ''];
     });
 
-    useEffect(() => {
-      localStorage.setItem('durer-player-names', JSON.stringify(playerNames));
-    }, [playerNames]);
+    useEffect(() => {}, [playerNames]);
 
     // A bot step (or auto endOfTurnMove) scheduled when the player navigates

[Survived] StringLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:87:28
     });
 
     useEffect(() => {
-      localStorage.setItem('durer-player-names', JSON.stringify(playerNames));
+      localStorage.setItem("", JSON.stringify(playerNames));
     }, [playerNames]);
 

[Killed] ArrowFunction
src/components/strategy-game-factory/strategy-game-factory.tsx:92:15
 
     // A bot step (or auto endOfTurnMove) scheduled when the player navigates
     // away would otherwise still fire, moving in a game nobody is watching.
-    useEffect(() => () => {
-      if (botTimeoutRef.current !== null) clearTimeout(botTimeoutRef.current);
-    }, []);
+    useEffect(() => undefined, []);
 
     const isHumanVsHumanGame = mode === 'vsHuman';
killedBy: Bot behavior by mode drops a scheduled bot turn when the game unmounts
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:92:27
 
     // A bot step (or auto endOfTurnMove) scheduled when the player navigates
     // away would otherwise still fire, moving in a game nobody is watching.
-    useEffect(() => () => {
-      if (botTimeoutRef.current !== null) clearTimeout(botTimeoutRef.current);
-    }, []);
+    useEffect(() => () => {}, []);
 
     const isHumanVsHumanGame = mode === 'vsHuman';
killedBy: Bot behavior by mode drops a scheduled bot turn when the game unmounts
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:93:11
     // A bot step (or auto endOfTurnMove) scheduled when the player navigates
     // away would otherwise still fire, moving in a game nobody is watching.
     useEffect(() => () => {
-      if (botTimeoutRef.current !== null) clearTimeout(botTimeoutRef.current);
+      if (false) clearTimeout(botTimeoutRef.current);
     }, []);
 
killedBy: Bot behavior by mode drops a scheduled bot turn when the game unmounts
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Killed] EqualityOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:93:11
     // A bot step (or auto endOfTurnMove) scheduled when the player navigates
     // away would otherwise still fire, moving in a game nobody is watching.
     useEffect(() => () => {
-      if (botTimeoutRef.current !== null) clearTimeout(botTimeoutRef.current);
+      if (botTimeoutRef.current === null) clearTimeout(botTimeoutRef.current);
     }, []);
 
killedBy: Bot behavior by mode drops a scheduled bot turn when the game unmounts
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Survived] ArrayDeclaration
src/components/strategy-game-factory/strategy-game-factory.tsx:94:8
     // away would otherwise still fire, moving in a game nobody is watching.
     useEffect(() => () => {
       if (botTimeoutRef.current !== null) clearTimeout(botTimeoutRef.current);
-    }, []);
+    }, ["Stryker was here"]);
 
     const isHumanVsHumanGame = mode === 'vsHuman';

[Killed] EqualityOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:96:32
       if (botTimeoutRef.current !== null) clearTimeout(botTimeoutRef.current);
     }, []);
 
-    const isHumanVsHumanGame = mode === 'vsHuman';
+    const isHumanVsHumanGame = mode !== 'vsHuman';
 
     const gameId = useLocation().pathname.split('/').pop()!;
killedBy: Bot behavior by mode does not call botStrategy in vsHuman mode
statusReason: strategyGameFactory: botStrategy named no move to play

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:96:32
       if (botTimeoutRef.current !== null) clearTimeout(botTimeoutRef.current);
     }, []);
 
-    const isHumanVsHumanGame = mode === 'vsHuman';
+    const isHumanVsHumanGame = true;
 
     const gameId = useLocation().pathname.split('/').pop()!;
killedBy: Bot behavior by mode throws in dev when the bot names a move the game does not have
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:98:49
 
     const isHumanVsHumanGame = mode === 'vsHuman';
 
-    const gameId = useLocation().pathname.split('/').pop()!;
+    const gameId = useLocation().pathname.split("").pop()!;
     const { stats, recordResult, resetStats } = useGameStats(gameId, selectedVariantIndex);
 
killedBy: win/loss tracking records a win when the chosen player wins in vsComputer mode
statusReason: expected null to deeply equal { win: 1, loss: +0 }

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:101:21
     const gameId = useLocation().pathname.split('/').pop()!;
     const { stats, recordResult, resetStats } = useGameStats(gameId, selectedVariantIndex);
 
-    useEffect(() => {
-      if (!isHumanVsHumanGame && phase === 'play' && currentPlayer === (1 - chosenRoleIndex!)) {
-        doBotTurn();
-      }
-      // doBotTurn is recreated every render, so listing it would restart the
-      // bot on every render rather than on a turn change.
-      // eslint-disable-next-line react-hooks/exhaustive-deps
-    }, [currentPlayer, isHumanVsHumanGame, phase, chosenRoleIndex]);
+    useEffect(() => {}, [currentPlayer, isHumanVsHumanGame, phase, chosenRoleIndex]);
 
     const resolvedPlayerNames: [string, string] = [
killedBy: Bot behavior by mode throws in dev when the bot names a move the game does not have
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:102:11
     const { stats, recordResult, resetStats } = useGameStats(gameId, selectedVariantIndex);
 
     useEffect(() => {
-      if (!isHumanVsHumanGame && phase === 'play' && currentPlayer === (1 - chosenRoleIndex!)) {
+      if (true && currentPlayer === (1 - chosenRoleIndex!)) {
         doBotTurn();
       }
killedBy: Bot behavior by mode does not call botStrategy in vsHuman mode
statusReason: strategyGameFactory: botStrategy named no move to play

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:102:11
     const { stats, recordResult, resetStats } = useGameStats(gameId, selectedVariantIndex);
 
     useEffect(() => {
-      if (!isHumanVsHumanGame && phase === 'play' && currentPlayer === (1 - chosenRoleIndex!)) {
+      if (true) {
         doBotTurn();
       }
killedBy: Bot behavior by mode does not call botStrategy in vsHuman mode
statusReason: strategyGameFactory: botStrategy named no move to play

[Survived] ArrayDeclaration
src/components/strategy-game-factory/strategy-game-factory.tsx:110:51
       // eslint-disable-next-line react-hooks/exhaustive-deps
     }, [currentPlayer, isHumanVsHumanGame, phase, chosenRoleIndex]);
 
-    const resolvedPlayerNames: [string, string] = [
-      playerNames[0] || t(DEFAULT_PLAYER_NAMES[0]),
-      playerNames[1] || t(DEFAULT_PLAYER_NAMES[1])
-    ];
+    const resolvedPlayerNames: [string, string] = [];
 
     let wrappedGameMoves: GameMoves<TBoard> = {} as GameMoves<TBoard>;

[Survived] LogicalOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:111:7
     }, [currentPlayer, isHumanVsHumanGame, phase, chosenRoleIndex]);
 
     const resolvedPlayerNames: [string, string] = [
-      playerNames[0] || t(DEFAULT_PLAYER_NAMES[0]),
+      playerNames[0] && t(DEFAULT_PLAYER_NAMES[0]),
       playerNames[1] || t(DEFAULT_PLAYER_NAMES[1])
     ];

[Survived] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:111:7
     }, [currentPlayer, isHumanVsHumanGame, phase, chosenRoleIndex]);
 
     const resolvedPlayerNames: [string, string] = [
-      playerNames[0] || t(DEFAULT_PLAYER_NAMES[0]),
+      false,
       playerNames[1] || t(DEFAULT_PLAYER_NAMES[1])
     ];

[Survived] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:112:7
 
     const resolvedPlayerNames: [string, string] = [
       playerNames[0] || t(DEFAULT_PLAYER_NAMES[0]),
-      playerNames[1] || t(DEFAULT_PLAYER_NAMES[1])
+      true
     ];
 

[Survived] LogicalOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:112:7
 
     const resolvedPlayerNames: [string, string] = [
       playerNames[0] || t(DEFAULT_PLAYER_NAMES[0]),
-      playerNames[1] || t(DEFAULT_PLAYER_NAMES[1])
+      playerNames[1] && t(DEFAULT_PLAYER_NAMES[1])
     ];
 

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:121:85
     // or a correct bot, so reaching here means a bug or tampering. In dev we
     // throw loudly to surface the bug; in prod we fail safe: warn, record it,
     // and no-op so a stray call can't corrupt the board or white-screen a player.
-    const reportIllegalMove = (name: string, moveBoard: TBoard, args: unknown[]) => {
-      const message = `strategyGameFactory: illegal move ${name}(${JSON.stringify(args)}) `
-        + `rejected on board ${JSON.stringify(moveBoard)}`;
-      if (import.meta.env.DEV) {
-        throw new Error(message);
-      }
-      console.warn(message);
-      trackEvent('illegal-move', { game: gameId, move: name });
-    };
+    const reportIllegalMove = (name: string, moveBoard: TBoard, args: unknown[]) => {};
 
     // Game-end side effects (the state transition itself already happened in
killedBy: move validate enforcement throws a loud error in dev when a bot dispatches a move that fails its validator
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:124:11
     const reportIllegalMove = (name: string, moveBoard: TBoard, args: unknown[]) => {
       const message = `strategyGameFactory: illegal move ${name}(${JSON.stringify(args)}) `
         + `rejected on board ${JSON.stringify(moveBoard)}`;
-      if (import.meta.env.DEV) {
+      if (true) {
         throw new Error(message);
       }
killedBy: move validate enforcement in production (import.meta.env.DEV = false) does not throw and leaves the board unchanged on an illegal bot move
statusReason: strategyGameFactory: illegal move guarded(["bad"]) rejected on board ["initial"]

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:124:11
     const reportIllegalMove = (name: string, moveBoard: TBoard, args: unknown[]) => {
       const message = `strategyGameFactory: illegal move ${name}(${JSON.stringify(args)}) `
         + `rejected on board ${JSON.stringify(moveBoard)}`;
-      if (import.meta.env.DEV) {
+      if (false) {
         throw new Error(message);
       }
killedBy: move validate enforcement throws a loud error in dev when a bot dispatches a move that fails its validator
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:128:18
         throw new Error(message);
       }
       console.warn(message);
-      trackEvent('illegal-move', { game: gameId, move: name });
+      trackEvent("", { game: gameId, move: name });
     };
 
killedBy: move validate enforcement in production (import.meta.env.DEV = false) reports an illegal-move umami event
statusReason: expected "vi.fn()" to be called with arguments: [ 'illegal-move', ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   "illegal-move",

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:133:55
 
     // Game-end side effects (the state transition itself already happened in
     // the reducer / store): dialog, win/loss stats, analytics.
-    const handleGameEnd = (resolvedWinner: number) => {
-      const s = store.getState();
-      setIsGameEndDialogOpen(true);
-      if (s.mode !== 'vsHuman') {
-        recordResult(resolvedWinner === s.chosenRoleIndex ? 'win' : 'loss');
-      }
-      trackEvent('game-finished', {
-        game: gameId,
-        mode: s.mode,
-        variant: selectedVariantIndex,
-        ...(s.mode === 'vsHuman' ? {} : { result: resolvedWinner === s.chosenRoleIndex ? 'win' : 'loss' })
-      });
-    };
+    const handleGameEnd = (resolvedWinner: number) => {};
 
     const dispatchMove = (name: string, moveBoard: TBoard, args: unknown[]): MoveOutcome<TBoard> => {
killedBy: win/loss tracking records a win when the chosen player wins in vsComputer mode
statusReason: expected null to deeply equal { win: 1, loss: +0 }

[Survived] BooleanLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:135:30
     // the reducer / store): dialog, win/loss stats, analytics.
     const handleGameEnd = (resolvedWinner: number) => {
       const s = store.getState();
-      setIsGameEndDialogOpen(true);
+      setIsGameEndDialogOpen(false);
       if (s.mode !== 'vsHuman') {
         recordResult(resolvedWinner === s.chosenRoleIndex ? 'win' : 'loss');

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:136:11
     const handleGameEnd = (resolvedWinner: number) => {
       const s = store.getState();
       setIsGameEndDialogOpen(true);
-      if (s.mode !== 'vsHuman') {
+      if (false) {
         recordResult(resolvedWinner === s.chosenRoleIndex ? 'win' : 'loss');
       }
killedBy: win/loss tracking records a win when the chosen player wins in vsComputer mode
statusReason: expected null to deeply equal { win: 1, loss: +0 }

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:136:11
     const handleGameEnd = (resolvedWinner: number) => {
       const s = store.getState();
       setIsGameEndDialogOpen(true);
-      if (s.mode !== 'vsHuman') {
+      if (true) {
         recordResult(resolvedWinner === s.chosenRoleIndex ? 'win' : 'loss');
       }
killedBy: win/loss tracking does not record in localStorage in vsHuman mode
statusReason: expected '{"win":0,"loss":1}' to be null

[Killed] EqualityOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:137:22
       const s = store.getState();
       setIsGameEndDialogOpen(true);
       if (s.mode !== 'vsHuman') {
-        recordResult(resolvedWinner === s.chosenRoleIndex ? 'win' : 'loss');
+        recordResult(resolvedWinner !== s.chosenRoleIndex ? 'win' : 'loss');
       }
       trackEvent('game-finished', {
killedBy: win/loss tracking records a win when the chosen player wins in vsComputer mode
statusReason: expected { win: +0, loss: 1 } to deeply equal { win: 1, loss: +0 }

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:137:22
       const s = store.getState();
       setIsGameEndDialogOpen(true);
       if (s.mode !== 'vsHuman') {
-        recordResult(resolvedWinner === s.chosenRoleIndex ? 'win' : 'loss');
+        recordResult(true ? 'win' : 'loss');
       }
       trackEvent('game-finished', {
killedBy: win/loss tracking records a loss when the opponent wins in vsComputer mode
statusReason: expected { win: 1, loss: +0 } to deeply equal { win: +0, loss: 1 }

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:143:51
         game: gameId,
         mode: s.mode,
         variant: selectedVariantIndex,
-        ...(s.mode === 'vsHuman' ? {} : { result: resolvedWinner === s.chosenRoleIndex ? 'win' : 'loss' })
+        ...(s.mode === 'vsHuman' ? {} : { result: false ? 'win' : 'loss' })
       });
     };
killedBy: umami game-finished event fires with result "win" when the chosen player wins vs computer
statusReason: expected { game: '', mode: 'vsComputer', …(2) } to match object { mode: 'vsComputer', result: 'win' }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:143:51
         game: gameId,
         mode: s.mode,
         variant: selectedVariantIndex,
-        ...(s.mode === 'vsHuman' ? {} : { result: resolvedWinner === s.chosenRoleIndex ? 'win' : 'loss' })
+        ...(s.mode === 'vsHuman' ? {} : { result: resolvedWinner !== s.chosenRoleIndex ? 'win' : 'loss' })
       });
     };
killedBy: umami game-finished event fires with result "win" when the chosen player wins vs computer
statusReason: expected { game: '', mode: 'vsComputer', …(2) } to match object { mode: 'vsComputer', result: 'win' }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:152:11
       // compatibility. A mismatch means a chaining bug — a bot or BoardClient
       // passed a stale board to the second move of a turn — so fail loudly in
       // dev; in prod the store board silently wins.
-      if (import.meta.env.DEV && !isEqual(moveBoard, store.getState().board)) {
+      if (import.meta.env.DEV || !isEqual(moveBoard, store.getState().board)) {
         throw new Error(`strategyGameFactory: stale board passed to move ${name} — `
           + 'pass the latest nextBoard when chaining moves within a turn');
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:152:79
       // compatibility. A mismatch means a chaining bug — a bot or BoardClient
       // passed a stale board to the second move of a turn — so fail loudly in
       // dev; in prod the store board silently wins.
-      if (import.meta.env.DEV && !isEqual(moveBoard, store.getState().board)) {
-        throw new Error(`strategyGameFactory: stale board passed to move ${name} — `
-          + 'pass the latest nextBoard when chaining moves within a turn');
-      }
+      if (import.meta.env.DEV && !isEqual(moveBoard, store.getState().board)) {}
       const transition = reduceMove(
         store.getState(), moves[name]!, name, args, resolvedPlayerNames
killedBy: outcome-returning moves (apply) the external store fixes render-snapshot staleness throws in dev when a BoardClient chains a move onto a stale board
statusReason: Cannot read properties of null (reading 'message')

[Survived] StringLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:154:13
       // dev; in prod the store board silently wins.
       if (import.meta.env.DEV && !isEqual(moveBoard, store.getState().board)) {
         throw new Error(`strategyGameFactory: stale board passed to move ${name} — `
-          + 'pass the latest nextBoard when chaining moves within a turn');
+          + "");
       }
       const transition = reduceMove(

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:159:11
       const transition = reduceMove(
         store.getState(), moves[name]!, name, args, resolvedPlayerNames
       );
-      if (transition.illegal) {
+      if (true) {
         reportIllegalMove(name, moveBoard, args);
         return transition.result;
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:159:31
       const transition = reduceMove(
         store.getState(), moves[name]!, name, args, resolvedPlayerNames
       );
-      if (transition.illegal) {
-        reportIllegalMove(name, moveBoard, args);
-        return transition.result;
-      }
+      if (transition.illegal) {}
       store.setState(transition.state);
       if (transition.gameJustEnded) {
killedBy: move validate enforcement throws a loud error in dev when a bot dispatches a move that fails its validator
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:164:37
         return transition.result;
       }
       store.setState(transition.state);
-      if (transition.gameJustEnded) {
-        handleGameEnd(transition.gameJustEnded.winnerIndex);
-      }
+      if (transition.gameJustEnded) {}
       if (endOfTurnMove && transition.autoEndOfTurn) {
         botTimeoutRef.current = setTimeout(() => {
killedBy: win/loss tracking records a win when the chosen player wins in vsComputer mode
statusReason: expected null to deeply equal { win: 1, loss: +0 }

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:164:11
         return transition.result;
       }
       store.setState(transition.state);
-      if (transition.gameJustEnded) {
+      if (false) {
         handleGameEnd(transition.gameJustEnded.winnerIndex);
       }
killedBy: win/loss tracking records a win when the chosen player wins in vsComputer mode
statusReason: expected null to deeply equal { win: 1, loss: +0 }

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:167:11
       if (transition.gameJustEnded) {
         handleGameEnd(transition.gameJustEnded.winnerIndex);
       }
-      if (endOfTurnMove && transition.autoEndOfTurn) {
+      if (false) {
         botTimeoutRef.current = setTimeout(() => {
           botTimeoutRef.current = null;
killedBy: strategyGameFactory endOfTurnMove calls endOfTurnMove after the step delay when a move returns autoEndOfTurn: true
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] LogicalOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:167:11
       if (transition.gameJustEnded) {
         handleGameEnd(transition.gameJustEnded.winnerIndex);
       }
-      if (endOfTurnMove && transition.autoEndOfTurn) {
+      if (endOfTurnMove || transition.autoEndOfTurn) {
         botTimeoutRef.current = setTimeout(() => {
           botTimeoutRef.current = null;
killedBy: strategyGameFactory endOfTurnMove does not call the bot again while its auto endOfTurnMove is pending
statusReason: expected 'initial,main,auto,auto,auto,auto,auto…' to be 'initial,main,auto' // Object.is equality
