[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:168:50
         handleGameEnd(transition.gameJustEnded.winnerIndex);
       }
       if (endOfTurnMove && transition.autoEndOfTurn) {
-        botTimeoutRef.current = setTimeout(() => {
-          botTimeoutRef.current = null;
-          wrappedGameMoves[endOfTurnMove]!(transition.result.nextBoard);
-        }, stepDelay());
+        botTimeoutRef.current = setTimeout(() => {}, stepDelay());
       }
       return transition.result;
killedBy: strategyGameFactory endOfTurnMove calls endOfTurnMove after the step delay when a move returns autoEndOfTurn: true
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:176:97
       return transition.result;
     };
 
-    const resetGameState = ({ newMode = mode, newVariantIndex = selectedVariantIndex } = {}) => {
-      const newVariant = resolvedVariants[newVariantIndex] ?? defaultVariant;
-      let boardGenerator = newVariant.generateStartBoard ?? defaultGenerateStartBoard;
-      let finalVariantIndex = newVariantIndex;
-      if (newMode === 'vsHuman' && !newVariant.generateStartBoard) {
-        finalVariantIndex = defaultVariantIndex;
-        boardGenerator = defaultGenerateStartBoard;
-      }
-      setSelectedVariantIndex(finalVariantIndex);
-      store.setState(createInitialCoreState(boardGenerator(), newMode));
-      setIsGameEndDialogOpen(false);
-      setGameUuid(crypto.randomUUID());
-    };
+    const resetGameState = ({ newMode = mode, newVariantIndex = selectedVariantIndex } = {}) => {};
 
     const setDifficulty = (index: number) => {
killedBy: isClientMoveAllowed allows both players to move in vsHuman mode
statusReason: Unable to find an element by: [data-testid="start-hh-game-0"]

Ignored nodes: comments, script, style
<body>
  <div />
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"

[Survived] LogicalOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:177:26
     };
 
     const resetGameState = ({ newMode = mode, newVariantIndex = selectedVariantIndex } = {}) => {
-      const newVariant = resolvedVariants[newVariantIndex] ?? defaultVariant;
+      const newVariant = resolvedVariants[newVariantIndex] && defaultVariant;
       let boardGenerator = newVariant.generateStartBoard ?? defaultGenerateStartBoard;
       let finalVariantIndex = newVariantIndex;

[Killed] EqualityOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:180:11
       const newVariant = resolvedVariants[newVariantIndex] ?? defaultVariant;
       let boardGenerator = newVariant.generateStartBoard ?? defaultGenerateStartBoard;
       let finalVariantIndex = newVariantIndex;
-      if (newMode === 'vsHuman' && !newVariant.generateStartBoard) {
+      if (newMode !== 'vsHuman' && !newVariant.generateStartBoard) {
         finalVariantIndex = defaultVariantIndex;
         boardGenerator = defaultGenerateStartBoard;
killedBy: per-variant rule shows the default variant rule and switches when another variant is selected
statusReason: Unable to find an element with the text: RULE_TWO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"
    >

[Killed] LogicalOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:180:11
       const newVariant = resolvedVariants[newVariantIndex] ?? defaultVariant;
       let boardGenerator = newVariant.generateStartBoard ?? defaultGenerateStartBoard;
       let finalVariantIndex = newVariantIndex;
-      if (newMode === 'vsHuman' && !newVariant.generateStartBoard) {
+      if (newMode === 'vsHuman' || !newVariant.generateStartBoard) {
         finalVariantIndex = defaultVariantIndex;
         boardGenerator = defaultGenerateStartBoard;
killedBy: per-variant rule shows the default variant rule and switches when another variant is selected
statusReason: Unable to find an element with the text: RULE_TWO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"
    >

[Killed] BooleanLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:186:30
       }
       setSelectedVariantIndex(finalVariantIndex);
       store.setState(createInitialCoreState(boardGenerator(), newMode));
-      setIsGameEndDialogOpen(false);
+      setIsGameEndDialogOpen(true);
       setGameUuid(crypto.randomUUID());
     };
killedBy: switchMode resets to roleSelection when switching back to vsComputer
statusReason: Found multiple elements by: [data-testid="mode-vsComputer"]

Here are the matching elements:

Ignored nodes: comments, script, style
<input
  class="sr-only"
  data-testid="mode-vsComputer"

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:190:46
       setGameUuid(crypto.randomUUID());
     };
 
-    const setDifficulty = (index: number) => {
-      resetGameState({ newVariantIndex: index });
-    };
+    const setDifficulty = (index: number) => {};
 
     const getVariantsForMode = (m: Mode): DisplayVariant[] => {
killedBy: per-variant rule shows the default variant rule and switches when another variant is selected
statusReason: Unable to find an element with the text: RULE_TWO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:194:63
       resetGameState({ newVariantIndex: index });
     };
 
-    const getVariantsForMode = (m: Mode): DisplayVariant[] => {
-      const humanVsHuman = m === 'vsHuman';
-      return resolvedVariants
-        .map((v, i) => ({ ...v, originalIndex: i, disabled: !humanVsHuman && !v.botStrategy }))
-        .filter(v => !humanVsHuman || !!v.generateStartBoard);
-    };
+    const getVariantsForMode = (m: Mode): DisplayVariant[] => {};
 
     const canUndo = phase === 'play'
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:195:28
     };
 
     const getVariantsForMode = (m: Mode): DisplayVariant[] => {
-      const humanVsHuman = m === 'vsHuman';
+      const humanVsHuman = true;
       return resolvedVariants
         .map((v, i) => ({ ...v, originalIndex: i, disabled: !humanVsHuman && !v.botStrategy }))
killedBy: per-variant rule shows the default variant rule and switches when another variant is selected
statusReason: Cannot read properties of undefined (reading 'querySelectorAll')

[Killed] EqualityOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:195:28
     };
 
     const getVariantsForMode = (m: Mode): DisplayVariant[] => {
-      const humanVsHuman = m === 'vsHuman';
+      const humanVsHuman = m !== 'vsHuman';
       return resolvedVariants
         .map((v, i) => ({ ...v, originalIndex: i, disabled: !humanVsHuman && !v.botStrategy }))
killedBy: per-variant rule shows the default variant rule and switches when another variant is selected
statusReason: Cannot read properties of undefined (reading 'querySelectorAll')

[Survived] MethodExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:196:14
 
     const getVariantsForMode = (m: Mode): DisplayVariant[] => {
       const humanVsHuman = m === 'vsHuman';
-      return resolvedVariants
-        .map((v, i) => ({ ...v, originalIndex: i, disabled: !humanVsHuman && !v.botStrategy }))
-        .filter(v => !humanVsHuman || !!v.generateStartBoard);
+      return resolvedVariants.map((v, i) => ({
+  ...v,
+  originalIndex: i,
+  disabled: !humanVsHuman && !v.botStrategy
+}));
     };
 

[Killed] ArrowFunction
src/components/strategy-game-factory/strategy-game-factory.tsx:197:14
     const getVariantsForMode = (m: Mode): DisplayVariant[] => {
       const humanVsHuman = m === 'vsHuman';
       return resolvedVariants
-        .map((v, i) => ({ ...v, originalIndex: i, disabled: !humanVsHuman && !v.botStrategy }))
+        .map(() => undefined)
         .filter(v => !humanVsHuman || !!v.generateStartBoard);
     };
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Cannot read properties of undefined (reading 'originalIndex')

[Survived] LogicalOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:197:61
     const getVariantsForMode = (m: Mode): DisplayVariant[] => {
       const humanVsHuman = m === 'vsHuman';
       return resolvedVariants
-        .map((v, i) => ({ ...v, originalIndex: i, disabled: !humanVsHuman && !v.botStrategy }))
+        .map((v, i) => ({ ...v, originalIndex: i, disabled: !humanVsHuman || !v.botStrategy }))
         .filter(v => !humanVsHuman || !!v.generateStartBoard);
     };

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:198:22
       const humanVsHuman = m === 'vsHuman';
       return resolvedVariants
         .map((v, i) => ({ ...v, originalIndex: i, disabled: !humanVsHuman && !v.botStrategy }))
-        .filter(v => !humanVsHuman || !!v.generateStartBoard);
+        .filter(v => false);
     };
 
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:198:22
       const humanVsHuman = m === 'vsHuman';
       return resolvedVariants
         .map((v, i) => ({ ...v, originalIndex: i, disabled: !humanVsHuman && !v.botStrategy }))
-        .filter(v => !humanVsHuman || !!v.generateStartBoard);
+        .filter(v => !humanVsHuman && !!v.generateStartBoard);
     };
 
killedBy: per-variant rule shows the default variant rule and switches when another variant is selected
statusReason: Cannot read properties of undefined (reading 'querySelectorAll')

[Killed] LogicalOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:201:21
         .filter(v => !humanVsHuman || !!v.generateStartBoard);
     };
 
-    const canUndo = phase === 'play'
-      && undoSnapshot !== null
+    const canUndo = phase === 'play' || undoSnapshot !== null
       && (isHumanVsHumanGame || undoSnapshot.currentPlayer === chosenRoleIndex);
 
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: Cannot read properties of null (reading 'currentPlayer')

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:201:21
         .filter(v => !humanVsHuman || !!v.generateStartBoard);
     };
 
-    const canUndo = phase === 'play'
-      && undoSnapshot !== null
-      && (isHumanVsHumanGame || undoSnapshot.currentPlayer === chosenRoleIndex);
+    const canUndo = true;
 
     const undo = () => {
killedBy: undo vsHuman undo button is disabled before any move
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:202:10
     };
 
     const canUndo = phase === 'play'
-      && undoSnapshot !== null
+      && undoSnapshot === null
       && (isHumanVsHumanGame || undoSnapshot.currentPlayer === chosenRoleIndex);
 
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: Cannot read properties of null (reading 'currentPlayer')

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:202:10
     };
 
     const canUndo = phase === 'play'
-      && undoSnapshot !== null
+      && true
       && (isHumanVsHumanGame || undoSnapshot.currentPlayer === chosenRoleIndex);
 
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: Cannot read properties of null (reading 'currentPlayer')

[Killed] EqualityOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:203:33
 
     const canUndo = phase === 'play'
       && undoSnapshot !== null
-      && (isHumanVsHumanGame || undoSnapshot.currentPlayer === chosenRoleIndex);
+      && (isHumanVsHumanGame || undoSnapshot.currentPlayer !== chosenRoleIndex);
 
     const undo = () => {
killedBy: undo vsComputer undo enabled immediately after human move (before bot fires)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:203:11
 
     const canUndo = phase === 'play'
       && undoSnapshot !== null
-      && (isHumanVsHumanGame || undoSnapshot.currentPlayer === chosenRoleIndex);
+      && (true);
 
     const undo = () => {
killedBy: undo vsComputer undo disabled after bot completes its move
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:205:24
       && undoSnapshot !== null
       && (isHumanVsHumanGame || undoSnapshot.currentPlayer === chosenRoleIndex);
 
-    const undo = () => {
-      if (!canUndo) return;
-      if (botTimeoutRef.current !== null) {
-        clearTimeout(botTimeoutRef.current);
-        botTimeoutRef.current = null;
-      }
-      store.setState({
-        board: undoSnapshot!.board,
-        currentPlayer: undoSnapshot!.currentPlayer,
-        moveCount: undoSnapshot!.moveCount,
-        turnState: null,
-        undoSnapshot: null,
-        currentTurnHasMoves: false
-      });
-    };
+    const undo = () => {};
 
     const startGame = (roleIndex: number | null = null) => {
killedBy: undo vsHuman clicking undo restores the previous board and player
statusReason: expected 'initial,moved' to be 'initial' // Object.is equality

[Killed] BooleanLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:206:11
       && (isHumanVsHumanGame || undoSnapshot.currentPlayer === chosenRoleIndex);
 
     const undo = () => {
-      if (!canUndo) return;
+      if (canUndo) return;
       if (botTimeoutRef.current !== null) {
         clearTimeout(botTimeoutRef.current);
killedBy: undo vsHuman clicking undo restores the previous board and player
statusReason: expected 'initial,moved' to be 'initial' // Object.is equality

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:206:11
       && (isHumanVsHumanGame || undoSnapshot.currentPlayer === chosenRoleIndex);
 
     const undo = () => {
-      if (!canUndo) return;
+      if (true) return;
       if (botTimeoutRef.current !== null) {
         clearTimeout(botTimeoutRef.current);
killedBy: undo vsHuman clicking undo restores the previous board and player
statusReason: expected 'initial,moved' to be 'initial' // Object.is equality

[Killed] EqualityOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:207:11
 
     const undo = () => {
       if (!canUndo) return;
-      if (botTimeoutRef.current !== null) {
+      if (botTimeoutRef.current === null) {
         clearTimeout(botTimeoutRef.current);
         botTimeoutRef.current = null;
killedBy: undo vsComputer clicking undo before bot fires cancels bot and restores human turn
statusReason: strategyGameFactory: botStrategy named no move to play

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:207:43
 
     const undo = () => {
       if (!canUndo) return;
-      if (botTimeoutRef.current !== null) {
-        clearTimeout(botTimeoutRef.current);
-        botTimeoutRef.current = null;
-      }
+      if (botTimeoutRef.current !== null) {}
       store.setState({
         board: undoSnapshot!.board,
killedBy: undo vsComputer clicking undo before bot fires cancels bot and restores human turn
statusReason: strategyGameFactory: botStrategy named no move to play

[Killed] ObjectLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:211:22
         clearTimeout(botTimeoutRef.current);
         botTimeoutRef.current = null;
       }
-      store.setState({
-        board: undoSnapshot!.board,
-        currentPlayer: undoSnapshot!.currentPlayer,
-        moveCount: undoSnapshot!.moveCount,
-        turnState: null,
-        undoSnapshot: null,
-        currentTurnHasMoves: false
-      });
+      store.setState({});
     };
 
killedBy: undo vsHuman clicking undo restores the previous board and player
statusReason: expected 'initial,moved' to be 'initial' // Object.is equality

[Killed] BooleanLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:217:30
         moveCount: undoSnapshot!.moveCount,
         turnState: null,
         undoSnapshot: null,
-        currentTurnHasMoves: false
+        currentTurnHasMoves: true
       });
     };
killedBy: undo vsHuman a new move after undo re-enables undo
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:221:60
       });
     };
 
-    const startGame = (roleIndex: number | null = null) => {
-      store.setState({ phase: 'play', currentPlayer: 0, chosenRoleIndex: roleIndex });
-    };
+    const startGame = (roleIndex: number | null = null) => {};
 
     const ctx: Ctx = buildCtx(state, resolvedPlayerNames);
killedBy: isClientMoveAllowed allows both players to move in vsHuman mode
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:229:50
 
     // For the BoardClient's mid-turn UI state. Moves never get this; they
     // return `nextTurnState` instead.
-    const setTurnState = (turnState: unknown) => {
-      store.setState({ turnState });
-    };
+    const setTurnState = (turnState: unknown) => {};
 
     wrappedGameMoves = mapValues(moves, (_def, name) => {
killedBy: outcome-returning moves (apply) nextTurnState the setTurnState prop writes turnState without registering a move
statusReason: expected 'null' to be '{"pile":2}' // Object.is equality

[Killed] ObjectLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:230:22
     // For the BoardClient's mid-turn UI state. Moves never get this; they
     // return `nextTurnState` instead.
     const setTurnState = (turnState: unknown) => {
-      store.setState({ turnState });
+      store.setState({});
     };
 
killedBy: outcome-returning moves (apply) nextTurnState the setTurnState prop writes turnState without registering a move
statusReason: expected 'null' to be '{"pile":2}' // Object.is equality

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:233:57
       store.setState({ turnState });
     };
 
-    wrappedGameMoves = mapValues(moves, (_def, name) => {
-      const wrapped: GameMoves<TBoard>[string] = (moveBoard: TBoard, ...args: unknown[]) =>
-        dispatchMove(name, moveBoard, args);
-      return wrapped;
-    });
+    wrappedGameMoves = mapValues(moves, (_def, name) => {});
 
     // What the BoardClient receives: the same moves, but a dispatch is silently
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/components/strategy-game-factory/strategy-game-factory.tsx:234:50
     };
 
     wrappedGameMoves = mapValues(moves, (_def, name) => {
-      const wrapped: GameMoves<TBoard>[string] = (moveBoard: TBoard, ...args: unknown[]) =>
-        dispatchMove(name, moveBoard, args);
+      const wrapped: GameMoves<TBoard>[string] = () => undefined;
       return wrapped;
     });
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:247:95
     // Bots and the auto `endOfTurnMove` dispatch use `wrappedGameMoves` instead:
     // there an illegal move is a bug, and the validator fails loudly (see
     // `reportIllegalMove`).
-    const clientGameMoves: ClientGameMoves<TBoard> = mapValues(moves, ({ validate }, name) => {
-      const isAllowed = (moveBoard: TBoard, ...args: unknown[]) => {
-        const liveCtx = buildCtx(store.getState(), resolvedPlayerNames);
-        return liveCtx.isClientMoveAllowed
-          && (!validate || validate(moveBoard, { ctx: liveCtx }, ...args));
-      };
-      const clientWrapped: ClientGameMoves<TBoard>[string] = Object.assign(
-        (moveBoard: TBoard, ...args: unknown[]) =>
-          isAllowed(moveBoard, ...args)
-            ? wrappedGameMoves[name]!(moveBoard, ...args)
-            : { nextBoard: moveBoard },
-        { isAllowed }
-      );
-      return clientWrapped;
-    });
+    const clientGameMoves: ClientGameMoves<TBoard> = mapValues(moves, ({ validate }, name) => {});
 
     // Asks the bot what it wants to play. Reads the store rather than the
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:248:68
     // there an illegal move is a bug, and the validator fails loudly (see
     // `reportIllegalMove`).
     const clientGameMoves: ClientGameMoves<TBoard> = mapValues(moves, ({ validate }, name) => {
-      const isAllowed = (moveBoard: TBoard, ...args: unknown[]) => {
-        const liveCtx = buildCtx(store.getState(), resolvedPlayerNames);
-        return liveCtx.isClientMoveAllowed
-          && (!validate || validate(moveBoard, { ctx: liveCtx }, ...args));
-      };
+      const isAllowed = (moveBoard: TBoard, ...args: unknown[]) => {};
       const clientWrapped: ClientGameMoves<TBoard>[string] = Object.assign(
         (moveBoard: TBoard, ...args: unknown[]) =>
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:250:16
     const clientGameMoves: ClientGameMoves<TBoard> = mapValues(moves, ({ validate }, name) => {
       const isAllowed = (moveBoard: TBoard, ...args: unknown[]) => {
         const liveCtx = buildCtx(store.getState(), resolvedPlayerNames);
-        return liveCtx.isClientMoveAllowed
-          && (!validate || validate(moveBoard, { ctx: liveCtx }, ...args));
+        return false;
       };
       const clientWrapped: ClientGameMoves<TBoard>[string] = Object.assign(
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:250:16
     const clientGameMoves: ClientGameMoves<TBoard> = mapValues(moves, ({ validate }, name) => {
       const isAllowed = (moveBoard: TBoard, ...args: unknown[]) => {
         const liveCtx = buildCtx(store.getState(), resolvedPlayerNames);
-        return liveCtx.isClientMoveAllowed
-          && (!validate || validate(moveBoard, { ctx: liveCtx }, ...args));
+        return liveCtx.isClientMoveAllowed || !validate || validate(moveBoard, {
+  ctx: liveCtx
+}, ...args);
       };
       const clientWrapped: ClientGameMoves<TBoard>[string] = Object.assign(
killedBy: move validate enforcement silently ignores a client dispatch when it is not the client turn
statusReason: expected 'initial,ok' to be 'initial' // Object.is equality

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:251:15
       const isAllowed = (moveBoard: TBoard, ...args: unknown[]) => {
         const liveCtx = buildCtx(store.getState(), resolvedPlayerNames);
         return liveCtx.isClientMoveAllowed
-          && (!validate || validate(moveBoard, { ctx: liveCtx }, ...args));
+          && (true);
       };
       const clientWrapped: ClientGameMoves<TBoard>[string] = Object.assign(
killedBy: move validate enforcement exposes isAllowed on the wrapped move: turn ownership AND the validator, ctx bound
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] BooleanLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:251:15
       const isAllowed = (moveBoard: TBoard, ...args: unknown[]) => {
         const liveCtx = buildCtx(store.getState(), resolvedPlayerNames);
         return liveCtx.isClientMoveAllowed
-          && (!validate || validate(moveBoard, { ctx: liveCtx }, ...args));
+          && (validate || validate(moveBoard, { ctx: liveCtx }, ...args));
       };
       const clientWrapped: ClientGameMoves<TBoard>[string] = Object.assign(
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/components/strategy-game-factory/strategy-game-factory.tsx:254:9
           && (!validate || validate(moveBoard, { ctx: liveCtx }, ...args));
       };
       const clientWrapped: ClientGameMoves<TBoard>[string] = Object.assign(
-        (moveBoard: TBoard, ...args: unknown[]) =>
-          isAllowed(moveBoard, ...args)
-            ? wrappedGameMoves[name]!(moveBoard, ...args)
-            : { nextBoard: moveBoard },
+        () => undefined,
         { isAllowed }
       );
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: expected false to be true // Object.is equality

[Survived] ObjectLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:257:15
         (moveBoard: TBoard, ...args: unknown[]) =>
           isAllowed(moveBoard, ...args)
             ? wrappedGameMoves[name]!(moveBoard, ...args)
-            : { nextBoard: moveBoard },
+            : {},
         { isAllowed }
       );

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:265:69
 
     // Asks the bot what it wants to play. Reads the store rather than the
     // render this closure came from, which may be long gone by now.
-    const askBot = (botStrategy: BotStrategy<TBoard>): BotMove[] => {
-      const state = store.getState();
-      const named = asBotMoves(botStrategy({
-        board: state.board, ctx: buildCtx(state, resolvedPlayerNames)
-      }));
-      // Naming nothing leaves the turn with the bot forever, so it is a bug in
-      // the strategy — loud in dev, and in prod a stalled bot beats a crash.
-      if (!named.length) {
-        const message = 'strategyGameFactory: botStrategy named no move to play';
-        if (import.meta.env.DEV) throw new Error(message);
-        console.warn(message);
-      }
-      return named;
-    };
+    const askBot = (botStrategy: BotStrategy<TBoard>): BotMove[] => {};
 
     // Plays the bot's named moves one at a time. The pause before each is what
killedBy: Bot behavior by mode throws in dev when the bot names a move the game does not have
statusReason: expected [Function] to throw error matching /named unknown move 'mianMove' \(this …/ but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:272:11
       }));
       // Naming nothing leaves the turn with the bot forever, so it is a bug in
       // the strategy — loud in dev, and in prod a stalled bot beats a crash.
-      if (!named.length) {
+      if (true) {
         const message = 'strategyGameFactory: botStrategy named no move to play';
         if (import.meta.env.DEV) throw new Error(message);
killedBy: Bot behavior by mode throws in dev when the bot names a move the game does not have
statusReason: expected [Function] to throw error matching /named unknown move 'mianMove' \(this …/ but got 'strategyGameFactory: botStrategy name…'

[Killed] BooleanLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:272:11
       }));
       // Naming nothing leaves the turn with the bot forever, so it is a bug in
       // the strategy — loud in dev, and in prod a stalled bot beats a crash.
-      if (!named.length) {
+      if (named.length) {
         const message = 'strategyGameFactory: botStrategy named no move to play';
         if (import.meta.env.DEV) throw new Error(message);
killedBy: Bot behavior by mode throws in dev when the bot names a move the game does not have
statusReason: expected [Function] to throw error matching /named unknown move 'mianMove' \(this …/ but got 'strategyGameFactory: botStrategy name…'

[NoCoverage] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:274:13
       // the strategy — loud in dev, and in prod a stalled bot beats a crash.
       if (!named.length) {
         const message = 'strategyGameFactory: botStrategy named no move to play';
-        if (import.meta.env.DEV) throw new Error(message);
+        if (false) throw new Error(message);
         console.warn(message);
       }
