[NoCoverage] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:274:13
       // the strategy — loud in dev, and in prod a stalled bot beats a crash.
       if (!named.length) {
         const message = 'strategyGameFactory: botStrategy named no move to play';
-        if (import.meta.env.DEV) throw new Error(message);
+        if (true) throw new Error(message);
         console.warn(message);
       }

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:290:13
         botTimeoutRef.current = null;
         const playerBefore = store.getState().currentPlayer!;
         const named = queue.length ? queue : askBot(botStrategy!);
-        if (!named.length) return;
+        if (true) return;
         const [{ move, args = [] }, ...rest] = named;
         if (!moves[move]) {
killedBy: Bot behavior by mode throws in dev when the bot names a move the game does not have
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:290:13
         botTimeoutRef.current = null;
         const playerBefore = store.getState().currentPlayer!;
         const named = queue.length ? queue : askBot(botStrategy!);
-        if (!named.length) return;
+        if (named.length) return;
         const [{ move, args = [] }, ...rest] = named;
         if (!moves[move]) {
killedBy: Bot behavior by mode throws in dev when the bot names a move the game does not have
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:292:13
         const named = queue.length ? queue : askBot(botStrategy!);
         if (!named.length) return;
         const [{ move, args = [] }, ...rest] = named;
-        if (!moves[move]) {
+        if (true) {
           if (import.meta.env.DEV) throw new Error(unknownMoveMessage(move, moves));
           console.warn(unknownMoveMessage(move, moves));
killedBy: Bot behavior by mode calls botStrategy when it becomes the computer turn
statusReason: strategyGameFactory: botStrategy named unknown move 'mainMove' (this game has: mainMove)

[Killed] BooleanLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:292:13
         const named = queue.length ? queue : askBot(botStrategy!);
         if (!named.length) return;
         const [{ move, args = [] }, ...rest] = named;
-        if (!moves[move]) {
+        if (moves[move]) {
           if (import.meta.env.DEV) throw new Error(unknownMoveMessage(move, moves));
           console.warn(unknownMoveMessage(move, moves));
killedBy: Bot behavior by mode throws in dev when the bot names a move the game does not have
statusReason: expected [Function] to throw error matching /named unknown move 'mianMove' \(this …/ but got 'wrappedGameMoves[move] is not a funct…'

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:293:15
         if (!named.length) return;
         const [{ move, args = [] }, ...rest] = named;
         if (!moves[move]) {
-          if (import.meta.env.DEV) throw new Error(unknownMoveMessage(move, moves));
+          if (false) throw new Error(unknownMoveMessage(move, moves));
           console.warn(unknownMoveMessage(move, moves));
           return;
killedBy: Bot behavior by mode throws in dev when the bot names a move the game does not have
statusReason: expected [Function] to throw an error

[Survived] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:293:15
         if (!named.length) return;
         const [{ move, args = [] }, ...rest] = named;
         if (!moves[move]) {
-          if (import.meta.env.DEV) throw new Error(unknownMoveMessage(move, moves));
+          if (true) throw new Error(unknownMoveMessage(move, moves));
           console.warn(unknownMoveMessage(move, moves));
           return;

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:300:13
         // The board comes from the store, so a bot has no board to pass and
         // therefore no way to pass a stale one.
         wrappedGameMoves[move]!(store.getState().board, ...args);
-        if (!isBotTurnUnfinished(store.getState(), playerBefore)) {
+        if (false) {
           // A turn planned as a whole may win partway through — the rest of the
           // plan is then moot rather than wrong.
killedBy: move validate enforcement calls the bot again for a move that did not end its turn
statusReason: expected 'initial,p1,p2,p1' to be 'initial,p1,p2' // Object.is equality

[Killed] BooleanLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:300:13
         // The board comes from the store, so a bot has no board to pass and
         // therefore no way to pass a stale one.
         wrappedGameMoves[move]!(store.getState().board, ...args);
-        if (!isBotTurnUnfinished(store.getState(), playerBefore)) {
+        if (isBotTurnUnfinished(store.getState(), playerBefore)) {
           // A turn planned as a whole may win partway through — the rest of the
           // plan is then moot rather than wrong.
killedBy: move validate enforcement calls the bot again for a move that did not end its turn
statusReason: expected 'initial,p1' to be 'initial,p1,p2' // Object.is equality

[Killed] EqualityOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:303:53
         if (!isBotTurnUnfinished(store.getState(), playerBefore)) {
           // A turn planned as a whole may win partway through — the rest of the
           // plan is then moot rather than wrong.
-          if (import.meta.env.DEV && rest.length && store.getState().phase !== 'gameEnd') {
+          if (import.meta.env.DEV && rest.length && store.getState().phase === 'gameEnd') {
             throw new Error(`strategyGameFactory: botStrategy named moves after ${move} ended its turn`);
           }
killedBy: a turn that wins partway through drops the moves the win made moot, in both
statusReason: strategyGameFactory: botStrategy named moves after take ended its turn

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:303:15
         if (!isBotTurnUnfinished(store.getState(), playerBefore)) {
           // A turn planned as a whole may win partway through — the rest of the
           // plan is then moot rather than wrong.
-          if (import.meta.env.DEV && rest.length && store.getState().phase !== 'gameEnd') {
+          if (true) {
             throw new Error(`strategyGameFactory: botStrategy named moves after ${move} ended its turn`);
           }
killedBy: Bot behavior by mode calls botStrategy when it becomes the computer turn
statusReason: strategyGameFactory: botStrategy named moves after mainMove ended its turn

[NoCoverage] StringLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:304:29
           // A turn planned as a whole may win partway through — the rest of the
           // plan is then moot rather than wrong.
           if (import.meta.env.DEV && rest.length && store.getState().phase !== 'gameEnd') {
-            throw new Error(`strategyGameFactory: botStrategy named moves after ${move} ended its turn`);
+            throw new Error(``);
           }
           return;

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:310:13
         }
         // A pending auto endOfTurnMove occupies the same timeout slot and
         // already owns the rest of the turn, so only carry on without one.
-        if (botTimeoutRef.current === null) {
+        if (false) {
           runBotTurn(rest, stepDelay());
         }
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: expected [ 'a' ] to deeply equal [ 'a', 'b', 'c' ]

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:310:13
         }
         // A pending auto endOfTurnMove occupies the same timeout slot and
         // already owns the rest of the turn, so only carry on without one.
-        if (botTimeoutRef.current === null) {
+        if (true) {
           runBotTurn(rest, stepDelay());
         }
killedBy: strategyGameFactory endOfTurnMove does not call the bot again while its auto endOfTurnMove is pending
statusReason: strategyGameFactory: stale board passed to move autoMove — pass the latest nextBoard when chaining moves within a turn

[Killed] BlockStatement
src/components/strategy-game-factory/strategy-game-factory.tsx:316:29
       }, delay);
     };
 
-    const doBotTurn = () => {
-      if (!activeVariant.botStrategy) {
-        throw new Error('strategyGameFactory: no botStrategy available for vsComputer mode');
-      }
-      runBotTurn([], stepDelay());
-    };
+    const doBotTurn = () => {};
 
     const visibleVariants = getVariantsForMode(mode);
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: expected [] to deeply equal [ 'a', 'b', 'c' ]

[Killed] BooleanLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:317:11
     };
 
     const doBotTurn = () => {
-      if (!activeVariant.botStrategy) {
+      if (activeVariant.botStrategy) {
         throw new Error('strategyGameFactory: no botStrategy available for vsComputer mode');
       }
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: strategyGameFactory: no botStrategy available for vsComputer mode

[Killed] ConditionalExpression
src/components/strategy-game-factory/strategy-game-factory.tsx:317:11
     };
 
     const doBotTurn = () => {
-      if (!activeVariant.botStrategy) {
+      if (true) {
         throw new Error('strategyGameFactory: no botStrategy available for vsComputer mode');
       }
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: strategyGameFactory: no botStrategy available for vsComputer mode

[NoCoverage] StringLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:318:25
 
     const doBotTurn = () => {
       if (!activeVariant.botStrategy) {
-        throw new Error('strategyGameFactory: no botStrategy available for vsComputer mode');
+        throw new Error("");
       }
       runBotTurn([], stepDelay());

[Killed] LogicalOperator
src/components/strategy-game-factory/strategy-game-factory.tsx:330:40
       <GameHeader />
       <div className="flex justify-center grow">
         <div className="max-w-[100ch] w-full">
-          <GameRule ruleDescription={t(activeVariant.rule ?? rule)} />
+          <GameRule ruleDescription={t(activeVariant.rule && rule)} />
           <div className="flex flex-wrap">
             <BoardClient
killedBy: per-variant rule shows the default variant rule and switches when another variant is selected
statusReason: Unable to find an element with the text: RULE_ONE. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"
    >

[Survived] ObjectLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:341:59
             />
             <GameSidebar
               roleLabels={roleLabels}
-              stepDescription={t(getPlayerStepDescription({ board, ctx }))}
+              stepDescription={t(getPlayerStepDescription({}))}
               ctx={ctx}
               playerNames={playerNames}

[Killed] ArrowFunction
src/components/strategy-game-factory/strategy-game-factory.tsx:347:29
               moves={{
                 startGame,
                 resetGameState,
-                switchMode: (newMode) => resetGameState({ newMode }),
+                switchMode: () => undefined,
                 setPlayerNames,
                 setDifficulty,
killedBy: isClientMoveAllowed allows both players to move in vsHuman mode
statusReason: Unable to find an element by: [data-testid="start-hh-game-0"]

Ignored nodes: comments, script, style
<body>
  <div />
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"

[Survived] ArrowFunction
src/components/strategy-game-factory/strategy-game-factory.tsx:368:20
         ctx={ctx}
         selectedVariantIndex={selectedVariantIndex}
         getVariantsForMode={getVariantsForMode}
-        onNewGame={(newMode, variantIndex) => resetGameState({ newMode, newVariantIndex: variantIndex })}
+        onNewGame={() => undefined}
       />
     </main>

[NoCoverage] ObjectLiteral
src/components/strategy-game-factory/strategy-game-factory.tsx:368:62
         ctx={ctx}
         selectedVariantIndex={selectedVariantIndex}
         getVariantsForMode={getVariantsForMode}
-        onNewGame={(newMode, variantIndex) => resetGameState({ newMode, newVariantIndex: variantIndex })}
+        onNewGame={(newMode, variantIndex) => resetGameState({})}
       />
     </main>
