[Killed] ArrowFunction
components/strategy-game-factory/engine/bot-turn.ts:13:27
 // scheduled its own follow-up move with setTimeout could not run outside a
 // browser, which is exactly what an authoritative server would have to do
 // (issue #313).
-export const asBotMoves = (named: BotMove | BotMove[]): BotMove[] =>
-  Array.isArray(named) ? named : [named];
+export const asBotMoves = () => undefined;
 
 // A move name is a string, so a typo in a strategy only shows up here. Say
killedBy: Bot behavior by mode throws in dev when the bot names a move the game does not have
statusReason: expected [Function] to throw error matching /named unknown move 'mianMove' \(this …/ but got 'Cannot read properties of undefined (…'

[Killed] ArrayDeclaration
components/strategy-game-factory/engine/bot-turn.ts:14:34
 // browser, which is exactly what an authoritative server would have to do
 // (issue #313).
 export const asBotMoves = (named: BotMove | BotMove[]): BotMove[] =>
-  Array.isArray(named) ? named : [named];
+  Array.isArray(named) ? named : [];
 
 // A move name is a string, so a typo in a strategy only shows up here. Say
killedBy: smartBotStrategy wins as the replier on 4x6 against the random bot
statusReason: runMatch: the strategy of player 0 named no move

[Killed] ArrowFunction
components/strategy-game-factory/engine/bot-turn.ts:18:35
 
 // A move name is a string, so a typo in a strategy only shows up here. Say
 // which names existed instead of letting `moves[name]` blow up as undefined.
-export const unknownMoveMessage = (name: string, moves: object) =>
-  `strategyGameFactory: botStrategy named unknown move '${name}' `
-    + `(this game has: ${Object.keys(moves).join(', ')})`;
+export const unknownMoveMessage = () => undefined;
 
 // Whether the strategy owes more moves: its turn is still open, so a bot that
killedBy: unknownMoveMessage names the bad move and lists the ones the game has
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArrowFunction
components/strategy-game-factory/engine/bot-turn.ts:24:36
 
 // Whether the strategy owes more moves: its turn is still open, so a bot that
 // named only the first move of a multi-phase turn gets asked for the rest.
-export const isBotTurnUnfinished = <TBoard>(
-  state: CoreState<TBoard>, botPlayerIndex: number
-) => state.phase === 'play' && state.currentPlayer === botPlayerIndex;
+export const isBotTurnUnfinished = () => undefined;
 
killedBy: runMatch plays out a turn named as a whole
statusReason: runMatch: the strategy of player 0 named moves after select ended its turn

[Killed] ConditionalExpression
components/strategy-game-factory/engine/bot-turn.ts:26:32
 // named only the first move of a multi-phase turn gets asked for the rest.
 export const isBotTurnUnfinished = <TBoard>(
   state: CoreState<TBoard>, botPlayerIndex: number
-) => state.phase === 'play' && state.currentPlayer === botPlayerIndex;
+) => state.phase === 'play' && true;
 
killedBy: isBotTurnUnfinished is false once the turn has passed to the other player
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
components/strategy-game-factory/engine/bot-turn.ts:26:32
 // named only the first move of a multi-phase turn gets asked for the rest.
 export const isBotTurnUnfinished = <TBoard>(
   state: CoreState<TBoard>, botPlayerIndex: number
-) => state.phase === 'play' && state.currentPlayer === botPlayerIndex;
+) => state.phase === 'play' && state.currentPlayer !== botPlayerIndex;
 
killedBy: isBotTurnUnfinished is true while the bot is still to move in the play phase
statusReason: expected false to be true // Object.is equality
