[Killed] ArrowFunction
components/strategy-game-factory/engine/build-ctx.ts:15:25
 // `isHumanVsHumanGame`), and `undoSnapshot`/`currentTurnHasMoves` — engine
 // bookkeeping that would silently become public API, and that an authoritative
 // server must never ship to a client.
-export const buildCtx = <TBoard>(
-  state: CoreState<TBoard>, resolvedPlayerNames: [string, string]
-): Ctx => ({
-  isHumanVsHumanGame: state.mode === 'vsHuman',
-  resolvedPlayerNames,
-  chosenRoleIndex: state.chosenRoleIndex,
-  phase: state.phase,
-  turnState: state.turnState,
-  currentPlayer: state.currentPlayer,
-  // The null check is not redundant with the seat comparison below: with no
-  // role chosen both seats are null and would match, opening the board up.
-  isClientMoveAllowed: state.phase === 'play'
-    && state.currentPlayer !== null
-    && (state.mode === 'vsHuman' || state.currentPlayer === state.chosenRoleIndex),
-  winnerIndex: state.winnerIndex,
-  moveCount: state.moveCount
-});
+export const buildCtx = () => undefined;
 
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Cannot read properties of undefined (reading 'currentPlayer')

[Killed] ConditionalExpression
components/strategy-game-factory/engine/build-ctx.ts:18:23
 export const buildCtx = <TBoard>(
   state: CoreState<TBoard>, resolvedPlayerNames: [string, string]
 ): Ctx => ({
-  isHumanVsHumanGame: state.mode === 'vsHuman',
+  isHumanVsHumanGame: true,
   resolvedPlayerNames,
   chosenRoleIndex: state.chosenRoleIndex,
killedBy: buildCtx derives isHumanVsHumanGame from the mode rather than exposing the mode
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
components/strategy-game-factory/engine/build-ctx.ts:18:23
 export const buildCtx = <TBoard>(
   state: CoreState<TBoard>, resolvedPlayerNames: [string, string]
 ): Ctx => ({
-  isHumanVsHumanGame: state.mode === 'vsHuman',
+  isHumanVsHumanGame: false,
   resolvedPlayerNames,
   chosenRoleIndex: state.chosenRoleIndex,
killedBy: isClientMoveAllowed allows both players to move in vsHuman mode
statusReason: Unable to find an element by: [data-testid="start-hh-game-0"]

Ignored nodes: comments, script, style
<body>
  <div />
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"

[Killed] ConditionalExpression
components/strategy-game-factory/engine/build-ctx.ts:26:24
   currentPlayer: state.currentPlayer,
   // The null check is not redundant with the seat comparison below: with no
   // role chosen both seats are null and would match, opening the board up.
-  isClientMoveAllowed: state.phase === 'play'
-    && state.currentPlayer !== null
-    && (state.mode === 'vsHuman' || state.currentPlayer === state.chosenRoleIndex),
+  isClientMoveAllowed: false,
   winnerIndex: state.winnerIndex,
   moveCount: state.moveCount
killedBy: isClientMoveAllowed allows both players to move in vsHuman mode
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
components/strategy-game-factory/engine/build-ctx.ts:26:24
   currentPlayer: state.currentPlayer,
   // The null check is not redundant with the seat comparison below: with no
   // role chosen both seats are null and would match, opening the board up.
-  isClientMoveAllowed: state.phase === 'play'
-    && state.currentPlayer !== null
-    && (state.mode === 'vsHuman' || state.currentPlayer === state.chosenRoleIndex),
+  isClientMoveAllowed: state.phase === 'play' && state.currentPlayer !== null || state.mode === 'vsHuman' || state.currentPlayer === state.chosenRoleIndex,
   winnerIndex: state.winnerIndex,
   moveCount: state.moveCount
killedBy: isClientMoveAllowed allows both players to move in vsHuman mode
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
components/strategy-game-factory/engine/build-ctx.ts:27:8
   // The null check is not redundant with the seat comparison below: with no
   // role chosen both seats are null and would match, opening the board up.
   isClientMoveAllowed: state.phase === 'play'
-    && state.currentPlayer !== null
+    && true
     && (state.mode === 'vsHuman' || state.currentPlayer === state.chosenRoleIndex),
   winnerIndex: state.winnerIndex,
killedBy: buildCtx: isClientMoveAllowed is false while no player is to move, in either mode
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
components/strategy-game-factory/engine/build-ctx.ts:27:8
   // The null check is not redundant with the seat comparison below: with no
   // role chosen both seats are null and would match, opening the board up.
   isClientMoveAllowed: state.phase === 'play'
-    && state.currentPlayer !== null
+    && state.currentPlayer === null
     && (state.mode === 'vsHuman' || state.currentPlayer === state.chosenRoleIndex),
   winnerIndex: state.winnerIndex,
killedBy: isClientMoveAllowed allows both players to move in vsHuman mode
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
components/strategy-game-factory/engine/build-ctx.ts:28:9
   // role chosen both seats are null and would match, opening the board up.
   isClientMoveAllowed: state.phase === 'play'
     && state.currentPlayer !== null
-    && (state.mode === 'vsHuman' || state.currentPlayer === state.chosenRoleIndex),
+    && (false || state.currentPlayer === state.chosenRoleIndex),
   winnerIndex: state.winnerIndex,
   moveCount: state.moveCount
killedBy: buildCtx: isClientMoveAllowed is true for either player while a human-vs-human game is in play
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
components/strategy-game-factory/engine/build-ctx.ts:28:9
   // role chosen both seats are null and would match, opening the board up.
   isClientMoveAllowed: state.phase === 'play'
     && state.currentPlayer !== null
-    && (state.mode === 'vsHuman' || state.currentPlayer === state.chosenRoleIndex),
+    && (state.mode !== 'vsHuman' || state.currentPlayer === state.chosenRoleIndex),
   winnerIndex: state.winnerIndex,
   moveCount: state.moveCount
killedBy: isClientMoveAllowed allows both players to move in vsHuman mode
statusReason: expected true to be false // Object.is equality
