[Killed] ConditionalExpression
components/strategy-game-factory/engine/reducer.ts:29:7
   resolvedPlayerNames: [string, string]
 ): MoveTransition<TBoard> => {
   const ctx = buildCtx(state, resolvedPlayerNames);
-  if (def.validate && !def.validate(state.board, { ctx }, ...args)) {
+  if (false) {
     return { state, illegal: true, result: { nextBoard: state.board } };
   }
killedBy: reduceMove — shared mechanics a failing validator returns the state unchanged (same reference) and flags illegal
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
components/strategy-game-factory/engine/reducer.ts:29:23
   resolvedPlayerNames: [string, string]
 ): MoveTransition<TBoard> => {
   const ctx = buildCtx(state, resolvedPlayerNames);
-  if (def.validate && !def.validate(state.board, { ctx }, ...args)) {
+  if (def.validate && def.validate(state.board, {
+  ctx
+}, ...args)) {
     return { state, illegal: true, result: { nextBoard: state.board } };
   }
killedBy: move validate enforcement applies a client dispatch whose args pass its validator
statusReason: expected 'initial' to be 'initial,ok' // Object.is equality

[Killed] BooleanLiteral
components/strategy-game-factory/engine/reducer.ts:30:30
 ): MoveTransition<TBoard> => {
   const ctx = buildCtx(state, resolvedPlayerNames);
   if (def.validate && !def.validate(state.board, { ctx }, ...args)) {
-    return { state, illegal: true, result: { nextBoard: state.board } };
+    return { state, illegal: false, result: { nextBoard: state.board } };
   }
   const next: CoreState<TBoard> = { ...state };
killedBy: move validate enforcement throws a loud error in dev when a bot dispatches a move that fails its validator
statusReason: expected [Function] to throw an error

[Killed] ObjectLiteral
components/strategy-game-factory/engine/reducer.ts:32:35
   if (def.validate && !def.validate(state.board, { ctx }, ...args)) {
     return { state, illegal: true, result: { nextBoard: state.board } };
   }
-  const next: CoreState<TBoard> = { ...state };
+  const next: CoreState<TBoard> = {};
   if (!state.currentTurnHasMoves) {
     next.undoSnapshot = {
killedBy: smartBotStrategy wins as the replier on 4x6 against the random bot
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
components/strategy-game-factory/engine/reducer.ts:33:7
     return { state, illegal: true, result: { nextBoard: state.board } };
   }
   const next: CoreState<TBoard> = { ...state };
-  if (!state.currentTurnHasMoves) {
+  if (false) {
     next.undoSnapshot = {
       board: cloneDeep(state.board),
killedBy: reduceMove a move that neither ends the turn nor the game leaves the turn open
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
components/strategy-game-factory/engine/reducer.ts:33:7
     return { state, illegal: true, result: { nextBoard: state.board } };
   }
   const next: CoreState<TBoard> = { ...state };
-  if (!state.currentTurnHasMoves) {
+  if (state.currentTurnHasMoves) {
     next.undoSnapshot = {
       board: cloneDeep(state.board),
killedBy: reduceMove a move that neither ends the turn nor the game leaves the turn open
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
components/strategy-game-factory/engine/reducer.ts:39:32
       currentPlayer: state.currentPlayer!,
       moveCount: state.moveCount
     };
-    next.currentTurnHasMoves = true;
+    next.currentTurnHasMoves = false;
   }
   let gameJustEnded: { winnerIndex: number } | undefined;
killedBy: reduceMove a move that neither ends the turn nor the game leaves the turn open
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
components/strategy-game-factory/engine/reducer.ts:43:7
   }
   let gameJustEnded: { winnerIndex: number } | undefined;
   const result: MoveOutcome<TBoard> = def.apply(state.board, { ctx }, ...args);
-  if (result.nextTurnState !== undefined) {
+  if (false) {
     next.turnState = result.nextTurnState;
   }
killedBy: every game plays to a decided end 'CoinsIn3Piles[0]'
statusReason: runMatch: illegal move passAddition([]) rejected on board [2,4,7]

[Killed] ConditionalExpression
components/strategy-game-factory/engine/reducer.ts:43:7
   }
   let gameJustEnded: { winnerIndex: number } | undefined;
   const result: MoveOutcome<TBoard> = def.apply(state.board, { ctx }, ...args);
-  if (result.nextTurnState !== undefined) {
+  if (true) {
     next.turnState = result.nextTurnState;
   }
killedBy: reduceMove nextTurnState sets, undefined keeps, null clears turnState
statusReason: expected undefined to be 's' // Object.is equality

[Killed] ConditionalExpression
components/strategy-game-factory/engine/reducer.ts:46:7
   if (result.nextTurnState !== undefined) {
     next.turnState = result.nextTurnState;
   }
-  if (result.gameEnd) {
+  if (true) {
     if (import.meta.env.DEV && (result.isTurnEnd || result.autoEndOfTurn)) {
       throw new Error(`strategyGameFactory: move ${name} returned gameEnd `
killedBy: every game plays to a decided end 'AddReduceDouble[0]'
statusReason: strategyGameFactory: move moveHalvedPieces returned gameEnd together with isTurnEnd/autoEndOfTurn

[Killed] ConditionalExpression
components/strategy-game-factory/engine/reducer.ts:46:7
   if (result.nextTurnState !== undefined) {
     next.turnState = result.nextTurnState;
   }
-  if (result.gameEnd) {
+  if (false) {
     if (import.meta.env.DEV && (result.isTurnEnd || result.autoEndOfTurn)) {
       throw new Error(`strategyGameFactory: move ${name} returned gameEnd `
killedBy: reduceMove gameEnd sets phase and winner without flipping the player
statusReason: expected 'play' to be 'gameEnd' // Object.is equality

[Killed] ConditionalExpression
components/strategy-game-factory/engine/reducer.ts:47:33
     next.turnState = result.nextTurnState;
   }
   if (result.gameEnd) {
-    if (import.meta.env.DEV && (result.isTurnEnd || result.autoEndOfTurn)) {
+    if (import.meta.env.DEV && (true)) {
       throw new Error(`strategyGameFactory: move ${name} returned gameEnd `
         + 'together with isTurnEnd/autoEndOfTurn');
killedBy: reduceMove gameEnd sets phase and winner without flipping the player
statusReason: strategyGameFactory: move testMove returned gameEnd together with isTurnEnd/autoEndOfTurn

[Killed] ConditionalExpression
components/strategy-game-factory/engine/reducer.ts:47:9
     next.turnState = result.nextTurnState;
   }
   if (result.gameEnd) {
-    if (import.meta.env.DEV && (result.isTurnEnd || result.autoEndOfTurn)) {
+    if (true) {
       throw new Error(`strategyGameFactory: move ${name} returned gameEnd `
         + 'together with isTurnEnd/autoEndOfTurn');
killedBy: reduceMove gameEnd sets phase and winner without flipping the player
statusReason: strategyGameFactory: move testMove returned gameEnd together with isTurnEnd/autoEndOfTurn

[Killed] StringLiteral
components/strategy-game-factory/engine/reducer.ts:51:18
       throw new Error(`strategyGameFactory: move ${name} returned gameEnd `
         + 'together with isTurnEnd/autoEndOfTurn');
     }
-    next.phase = 'gameEnd';
+    next.phase = "";
     next.winnerIndex = result.gameEnd.winnerIndex;
     gameJustEnded = { winnerIndex: result.gameEnd.winnerIndex };
killedBy: reduceMove gameEnd sets phase and winner without flipping the player
statusReason: expected '' to be 'gameEnd' // Object.is equality

[Killed] BlockStatement
components/strategy-game-factory/engine/reducer.ts:54:32
     next.phase = 'gameEnd';
     next.winnerIndex = result.gameEnd.winnerIndex;
     gameJustEnded = { winnerIndex: result.gameEnd.winnerIndex };
-  } else if (result.isTurnEnd) {
-    next.currentTurnHasMoves = false;
-    next.currentPlayer = 1 - next.currentPlayer!;
-  }
+  } else if (result.isTurnEnd) {}
   next.board = result.nextBoard;
   next.moveCount = state.moveCount + 1;
killedBy: reduceMove isTurnEnd flips the player and closes the turn
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
components/strategy-game-factory/engine/reducer.ts:54:14
     next.phase = 'gameEnd';
     next.winnerIndex = result.gameEnd.winnerIndex;
     gameJustEnded = { winnerIndex: result.gameEnd.winnerIndex };
-  } else if (result.isTurnEnd) {
+  } else if (true) {
     next.currentTurnHasMoves = false;
     next.currentPlayer = 1 - next.currentPlayer!;
killedBy: reduceMove a move that neither ends the turn nor the game leaves the turn open
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
components/strategy-game-factory/engine/reducer.ts:55:32
     next.winnerIndex = result.gameEnd.winnerIndex;
     gameJustEnded = { winnerIndex: result.gameEnd.winnerIndex };
   } else if (result.isTurnEnd) {
-    next.currentTurnHasMoves = false;
+    next.currentTurnHasMoves = true;
     next.currentPlayer = 1 - next.currentPlayer!;
   }
killedBy: reduceMove isTurnEnd flips the player and closes the turn
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
components/strategy-game-factory/engine/reducer.ts:56:26
     gameJustEnded = { winnerIndex: result.gameEnd.winnerIndex };
   } else if (result.isTurnEnd) {
     next.currentTurnHasMoves = false;
-    next.currentPlayer = 1 - next.currentPlayer!;
+    next.currentPlayer = 1 + next.currentPlayer!;
   }
   next.board = result.nextBoard;
killedBy: every game plays to a decided end 'AddReduceDouble[0]'
statusReason: strategies[player] is not a function

[Killed] ArithmeticOperator
components/strategy-game-factory/engine/reducer.ts:59:20
     next.currentPlayer = 1 - next.currentPlayer!;
   }
   next.board = result.nextBoard;
-  next.moveCount = state.moveCount + 1;
+  next.moveCount = state.moveCount - 1;
   return {
     state: next,
killedBy: reduceMove isTurnEnd flips the player and closes the turn
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
components/strategy-game-factory/engine/reducer.ts:65:20
     result,
     gameJustEnded,
     // Nothing runs after the game ends, so gameEnd suppresses the scheduling.
-    autoEndOfTurn: !!result.autoEndOfTurn && !result.gameEnd
+    autoEndOfTurn: true
   };
 };
killedBy: reduceMove suppresses autoEndOfTurn when a move ends the game (prod path)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
components/strategy-game-factory/engine/reducer.ts:65:20
     result,
     gameJustEnded,
     // Nothing runs after the game ends, so gameEnd suppresses the scheduling.
-    autoEndOfTurn: !!result.autoEndOfTurn && !result.gameEnd
+    autoEndOfTurn: false
   };
 };
killedBy: strategyGameFactory endOfTurnMove calls endOfTurnMove after the step delay when a move returns autoEndOfTurn: true
statusReason: expected "vi.fn()" to be called once, but got 0 times
