[Survived] StringLiteral
components/strategy-game-factory/engine/run-match.ts:24:46
 
 // Names only ever reach presentation code; a headless match has no players to
 // name, so any placeholder does.
-const PLAYER_NAMES: [string, string] = ['0', '1'];
+const PLAYER_NAMES: [string, string] = ['0', ""];
 
 // Plays a whole game outside React: two strategies, the real moves, the real

[Survived] StringLiteral
components/strategy-game-factory/engine/run-match.ts:24:41
 
 // Names only ever reach presentation code; a headless match has no players to
 // name, so any placeholder does.
-const PLAYER_NAMES: [string, string] = ['0', '1'];
+const PLAYER_NAMES: [string, string] = ["", '1'];
 
 // Plays a whole game outside React: two strategies, the real moves, the real

[Timeout] BlockStatement
components/strategy-game-factory/engine/run-match.ts:55:51
   };
   const history: MatchMove<TBoard>[] = [];
 
-  const play = (name: string, args: unknown[]) => {
-    if (!moves[name]) throw new Error(unknownMoveMessage(name, moves));
-    const transition = reduceMove(state, moves[name]!, name, args, PLAYER_NAMES);
-    if (transition.illegal) {
-      throw new Error(`runMatch: illegal move ${name}(${JSON.stringify(args)}) `
-        + `rejected on board ${JSON.stringify(state.board)}`);
-    }
-    history.push({
-      player: state.currentPlayer!, move: name, args, board: transition.result.nextBoard
-    });
-    state = transition.state;
-    // The shell delays the auto endOfTurnMove only to animate it; headless
-    // there is nothing to animate, so it runs straight away.
-    if (endOfTurnMove && transition.autoEndOfTurn) {
-      play(endOfTurnMove, []);
-    }
-  };
+  const play = (name: string, args: unknown[]) => {};
 
   while (state.phase === 'play') {

[Killed] BooleanLiteral
components/strategy-game-factory/engine/run-match.ts:56:9
   const history: MatchMove<TBoard>[] = [];
 
   const play = (name: string, args: unknown[]) => {
-    if (!moves[name]) throw new Error(unknownMoveMessage(name, moves));
+    if (moves[name]) throw new Error(unknownMoveMessage(name, moves));
     const transition = reduceMove(state, moves[name]!, name, args, PLAYER_NAMES);
     if (transition.illegal) {
killedBy: every game plays to a decided end 'AddReduceDouble[0]'
statusReason: strategyGameFactory: botStrategy named unknown move 'moveHalvedPieces' (this game has: moveHalvedPieces)

[Killed] ConditionalExpression
components/strategy-game-factory/engine/run-match.ts:56:9
   const history: MatchMove<TBoard>[] = [];
 
   const play = (name: string, args: unknown[]) => {
-    if (!moves[name]) throw new Error(unknownMoveMessage(name, moves));
+    if (true) throw new Error(unknownMoveMessage(name, moves));
     const transition = reduceMove(state, moves[name]!, name, args, PLAYER_NAMES);
     if (transition.illegal) {
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: strategyGameFactory: botStrategy named unknown move 'take' (this game has: take)

[Killed] ConditionalExpression
components/strategy-game-factory/engine/run-match.ts:58:9
   const play = (name: string, args: unknown[]) => {
     if (!moves[name]) throw new Error(unknownMoveMessage(name, moves));
     const transition = reduceMove(state, moves[name]!, name, args, PLAYER_NAMES);
-    if (transition.illegal) {
+    if (false) {
       throw new Error(`runMatch: illegal move ${name}(${JSON.stringify(args)}) `
         + `rejected on board ${JSON.stringify(state.board)}`);
killedBy: runMatch throws on an illegal move instead of silently ignoring it
statusReason: expected [Function] to throw error matching /illegal move take\(\[3\]\)/ but got 'runMatch: no game end after 500 moves'

[Killed] ConditionalExpression
components/strategy-game-factory/engine/run-match.ts:58:9
   const play = (name: string, args: unknown[]) => {
     if (!moves[name]) throw new Error(unknownMoveMessage(name, moves));
     const transition = reduceMove(state, moves[name]!, name, args, PLAYER_NAMES);
-    if (transition.illegal) {
+    if (true) {
       throw new Error(`runMatch: illegal move ${name}(${JSON.stringify(args)}) `
         + `rejected on board ${JSON.stringify(state.board)}`);
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: runMatch: illegal move take(["a"]) rejected on board 0

[Killed] ObjectLiteral
components/strategy-game-factory/engine/run-match.ts:62:18
       throw new Error(`runMatch: illegal move ${name}(${JSON.stringify(args)}) `
         + `rejected on board ${JSON.stringify(state.board)}`);
     }
-    history.push({
-      player: state.currentPlayer!, move: name, args, board: transition.result.nextBoard
-    });
+    history.push({});
     state = transition.state;
     // The shell delays the auto endOfTurnMove only to animate it; headless
killedBy: smartBotStrategy moves to a zero (losing-for-opponent) position from a winning board
statusReason: Cannot read properties of undefined (reading 'grid')

[Killed] ConditionalExpression
components/strategy-game-factory/engine/run-match.ts:68:9
     state = transition.state;
     // The shell delays the auto endOfTurnMove only to animate it; headless
     // there is nothing to animate, so it runs straight away.
-    if (endOfTurnMove && transition.autoEndOfTurn) {
+    if (false) {
       play(endOfTurnMove, []);
     }
killedBy: every game plays to a decided end 'ArchitectAndBandits[0]'
statusReason: runMatch: illegal move destroyTower([4]) rejected on board {"architectPosition":4,"towers":[false,false,false,false,false,false,false,false],"day":1,"kmUsedToday":0}

[Killed] LogicalOperator
components/strategy-game-factory/engine/run-match.ts:68:9
     state = transition.state;
     // The shell delays the auto endOfTurnMove only to animate it; headless
     // there is nothing to animate, so it runs straight away.
-    if (endOfTurnMove && transition.autoEndOfTurn) {
+    if (endOfTurnMove || transition.autoEndOfTurn) {
       play(endOfTurnMove, []);
     }
killedBy: every game plays to a decided end 'ArchitectAndBandits[0]'
statusReason: Maximum call stack size exceeded

[Killed] ConditionalExpression
components/strategy-game-factory/engine/run-match.ts:73:10
     }
   };
 
-  while (state.phase === 'play') {
+  while (false) {
     if (history.length >= maxMoves) {
       throw new Error(`runMatch: no game end after ${maxMoves} moves`);
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: expected [] to deeply equal [ 'a', 'b', 'c' ]

[Killed] EqualityOperator
components/strategy-game-factory/engine/run-match.ts:73:10
     }
   };
 
-  while (state.phase === 'play') {
+  while (state.phase !== 'play') {
     if (history.length >= maxMoves) {
       throw new Error(`runMatch: no game end after ${maxMoves} moves`);
killedBy: smartBotStrategy moves to a zero (losing-for-opponent) position from a winning board
statusReason: Cannot read properties of undefined (reading 'board')

[Killed] EqualityOperator
components/strategy-game-factory/engine/run-match.ts:74:9
   };
 
   while (state.phase === 'play') {
-    if (history.length >= maxMoves) {
+    if (history.length < maxMoves) {
       throw new Error(`runMatch: no game end after ${maxMoves} moves`);
     }
killedBy: smartBotStrategy moves to a zero (losing-for-opponent) position from a winning board
statusReason: runMatch: no game end after 500 moves

[Killed] ConditionalExpression
components/strategy-game-factory/engine/run-match.ts:74:9
   };
 
   while (state.phase === 'play') {
-    if (history.length >= maxMoves) {
+    if (true) {
       throw new Error(`runMatch: no game end after ${maxMoves} moves`);
     }
killedBy: smartBotStrategy moves to a zero (losing-for-opponent) position from a winning board
statusReason: runMatch: no game end after 500 moves

[Killed] ArithmeticOperator
components/strategy-game-factory/engine/run-match.ts:82:42
     // vsComputer the bot is always the role the human did not choose. Both
     // seats here are bots, so the seat about to move is "the computer" and the
     // other one is the notional human.
-    state = { ...state, chosenRoleIndex: 1 - player };
+    state = { ...state, chosenRoleIndex: 1 + player };
     const named = asBotMoves(
       strategies[player]({ board: state.board, ctx: buildCtx(state, PLAYER_NAMES) })
killedBy: runMatch gives the strategy about to move the ctx of the computer player
statusReason: expected [ 1, 2, 1 ] to deeply equal [ 1, +0, 1 ]

[Killed] ObjectLiteral
components/strategy-game-factory/engine/run-match.ts:82:13
     // vsComputer the bot is always the role the human did not choose. Both
     // seats here are bots, so the seat about to move is "the computer" and the
     // other one is the notional human.
-    state = { ...state, chosenRoleIndex: 1 - player };
+    state = {};
     const named = asBotMoves(
       strategies[player]({ board: state.board, ctx: buildCtx(state, PLAYER_NAMES) })
killedBy: runMatch plays a game to the end and reports the winner
statusReason: Cannot read properties of undefined (reading 'stones')

[Killed] ObjectLiteral
components/strategy-game-factory/engine/run-match.ts:84:26
     // other one is the notional human.
     state = { ...state, chosenRoleIndex: 1 - player };
     const named = asBotMoves(
-      strategies[player]({ board: state.board, ctx: buildCtx(state, PLAYER_NAMES) })
+      strategies[player]({})
     );
     if (!named.length) {
killedBy: runMatch asks a strategy again while its move has not ended the turn
statusReason: Cannot read properties of undefined (reading 'turnState')

[Killed] BooleanLiteral
components/strategy-game-factory/engine/run-match.ts:86:9
     const named = asBotMoves(
       strategies[player]({ board: state.board, ctx: buildCtx(state, PLAYER_NAMES) })
     );
-    if (!named.length) {
+    if (named.length) {
       throw new Error(`runMatch: the strategy of player ${player} named no move`);
     }
killedBy: runMatch plays a game to the end and reports the winner
statusReason: runMatch: the strategy of player 0 named no move

[Killed] ConditionalExpression
components/strategy-game-factory/engine/run-match.ts:86:9
     const named = asBotMoves(
       strategies[player]({ board: state.board, ctx: buildCtx(state, PLAYER_NAMES) })
     );
-    if (!named.length) {
+    if (true) {
       throw new Error(`runMatch: the strategy of player ${player} named no move`);
     }
killedBy: runMatch plays a game to the end and reports the winner
statusReason: runMatch: the strategy of player 0 named no move

[Timeout] BlockStatement
components/strategy-game-factory/engine/run-match.ts:89:61
     if (!named.length) {
       throw new Error(`runMatch: the strategy of player ${player} named no move`);
     }
-    for (const [i, { move, args = [] }] of named.entries()) {
-      if (i > 0 && !isBotTurnUnfinished(state, player)) {
-        // A turn planned as a whole may win partway through — the rest of the
-        // plan is then moot rather than wrong.
-        if (state.phase === 'gameEnd') break;
-        throw new Error(`runMatch: the strategy of player ${player} named moves after `
-          + `${named[i - 1]!.move} ended its turn`);
-      }
-      play(move, args);
-    }
+    for (const [i, { move, args = [] }] of named.entries()) {}
     // Nothing to schedule and nothing to pace: a strategy that named only the
     // first move of its turn is simply asked again by the loop.

[Killed] ConditionalExpression
components/strategy-game-factory/engine/run-match.ts:90:11
       throw new Error(`runMatch: the strategy of player ${player} named no move`);
     }
     for (const [i, { move, args = [] }] of named.entries()) {
-      if (i > 0 && !isBotTurnUnfinished(state, player)) {
+      if (true) {
         // A turn planned as a whole may win partway through — the rest of the
         // plan is then moot rather than wrong.
killedBy: smartBotStrategy wins as the replier from every start square in optimal-vs-optimal play
statusReason: Cannot read properties of undefined (reading 'move')

[Killed] BooleanLiteral
components/strategy-game-factory/engine/run-match.ts:90:20
       throw new Error(`runMatch: the strategy of player ${player} named no move`);
     }
     for (const [i, { move, args = [] }] of named.entries()) {
-      if (i > 0 && !isBotTurnUnfinished(state, player)) {
+      if (i > 0 && isBotTurnUnfinished(state, player)) {
         // A turn planned as a whole may win partway through — the rest of the
         // plan is then moot rather than wrong.
killedBy: smartBotStrategy wins as the replier from every start square in optimal-vs-optimal play
statusReason: runMatch: the strategy of player 1 named moves after addPiece ended its turn

[Killed] ConditionalExpression
components/strategy-game-factory/engine/run-match.ts:93:13
       if (i > 0 && !isBotTurnUnfinished(state, player)) {
         // A turn planned as a whole may win partway through — the rest of the
         // plan is then moot rather than wrong.
-        if (state.phase === 'gameEnd') break;
+        if (false) break;
         throw new Error(`runMatch: the strategy of player ${player} named moves after `
           + `${named[i - 1]!.move} ended its turn`);
killedBy: runMatch stops playing a named turn that has already won the game
statusReason: runMatch: the strategy of player 0 named moves after take ended its turn

[Killed] EqualityOperator
components/strategy-game-factory/engine/run-match.ts:93:13
       if (i > 0 && !isBotTurnUnfinished(state, player)) {
         // A turn planned as a whole may win partway through — the rest of the
         // plan is then moot rather than wrong.
-        if (state.phase === 'gameEnd') break;
+        if (state.phase !== 'gameEnd') break;
         throw new Error(`runMatch: the strategy of player ${player} named moves after `
           + `${named[i - 1]!.move} ended its turn`);
killedBy: every game plays to a decided end 'PolicemanthiefC[0]'
statusReason: runMatch: the strategy of player 0 named moves after moveCop ended its turn

[Killed] StringLiteral
components/strategy-game-factory/engine/run-match.ts:94:25
         // A turn planned as a whole may win partway through — the rest of the
         // plan is then moot rather than wrong.
         if (state.phase === 'gameEnd') break;
-        throw new Error(`runMatch: the strategy of player ${player} named moves after `
+        throw new Error(``
           + `${named[i - 1]!.move} ended its turn`);
       }
killedBy: runMatch throws when a strategy names moves after its turn ended
statusReason: expected [Function] to throw error matching /named moves after take ended its turn/ but got 'take ended its turn'

[Killed] ArithmeticOperator
components/strategy-game-factory/engine/run-match.ts:95:22
         // plan is then moot rather than wrong.
         if (state.phase === 'gameEnd') break;
         throw new Error(`runMatch: the strategy of player ${player} named moves after `
-          + `${named[i - 1]!.move} ended its turn`);
+          + `${named[i + 1]!.move} ended its turn`);
       }
       play(move, args);
killedBy: runMatch throws when a strategy names moves after its turn ended
statusReason: expected [Function] to throw error matching /named moves after take ended its turn/ but got 'Cannot read properties of undefined (…'

[Killed] StringLiteral
components/strategy-game-factory/engine/run-match.ts:95:13
         // plan is then moot rather than wrong.
         if (state.phase === 'gameEnd') break;
         throw new Error(`runMatch: the strategy of player ${player} named moves after `
-          + `${named[i - 1]!.move} ended its turn`);
+          + ``);
       }
       play(move, args);
killedBy: runMatch throws when a strategy names moves after its turn ended
statusReason: expected [Function] to throw error matching /named moves after take ended its turn/ but got 'runMatch: the strategy of player 0 na…'
