[Killed] ArrowFunction
components/strategy-game-factory/engine/timing.ts:9:26
 // The spread is what keeps it from feeling mechanical: a machine that always
 // answers after exactly the same interval reads as a metronome rather than as
 // an opponent thinking.
-export const stepDelay = () => Math.floor(Math.random() * 500 + 750);
+export const stepDelay = () => undefined;
 
killedBy: strategyGameFactory endOfTurnMove does not call endOfTurnMove when a move does not return autoEndOfTurn
statusReason: strategyGameFactory: botStrategy named no move to play

[Killed] ArithmeticOperator
components/strategy-game-factory/engine/timing.ts:9:43
 // The spread is what keeps it from feeling mechanical: a machine that always
 // answers after exactly the same interval reads as a metronome rather than as
 // an opponent thinking.
-export const stepDelay = () => Math.floor(Math.random() * 500 + 750);
+export const stepDelay = () => Math.floor(Math.random() / 500 + 750);
 
killedBy: strategyGameFactory endOfTurnMove does not call endOfTurnMove when a move does not return autoEndOfTurn
statusReason: strategyGameFactory: botStrategy named no move to play
