[Killed] BlockStatement
strategy-game-factory/game-parts/common/cta-text.ts:12:24
   winnerIndex,
   chosenRoleIndex,
   resolvedPlayerNames
-}: Ctx): I18nString => {
-  if (phase === 'roleSelection') {
-    return isHumanVsHumanGame
-      ? { hu: 'Döntsétek el, hogy ki kezd.', en: 'Decide who goes first.' }
-      : { hu: 'Válassz szerepet!', en: 'Choose a role!' };
-  }
-  if (phase === 'play') {
-    return isHumanVsHumanGame
-      ? { hu: `Következik: ${resolvedPlayerNames[currentPlayer!]}`, en: `Next: ${resolvedPlayerNames[currentPlayer!]}` }
-      : isClientMoveAllowed
-        ? { hu: 'Te jössz', en: 'Your turn' }
-        : { hu: 'Mi jövünk', en: "Computer's turn" };
-  }
-  else {
-    return isHumanVsHumanGame
-      ? { hu: `A játékot nyerte: ${resolvedPlayerNames[winnerIndex!]}`,
-          en: `Winner: ${resolvedPlayerNames[winnerIndex!]}` }
-      : winnerIndex === chosenRoleIndex
-        ? { hu: 'Nyertél. Gratulálunk! :)', en: 'You won. Congratulations! :)' }
-        : {
-          hu: 'Sajnos, most nem nyertél, de ne add fel.',
-          en: "Unfortunately you didn't win this time, but don't give up."
-        };
-  }
-};
+}: Ctx): I18nString => {};
 
killedBy: getCtaText vsHuman mode roleSelection: returns "Decide who goes first"
statusReason: expected undefined to deeply equal { …(2) }

[Killed] BlockStatement
strategy-game-factory/game-parts/common/cta-text.ts:13:34
   chosenRoleIndex,
   resolvedPlayerNames
 }: Ctx): I18nString => {
-  if (phase === 'roleSelection') {
-    return isHumanVsHumanGame
-      ? { hu: 'Döntsétek el, hogy ki kezd.', en: 'Decide who goes first.' }
-      : { hu: 'Válassz szerepet!', en: 'Choose a role!' };
-  }
+  if (phase === 'roleSelection') {}
   if (phase === 'play') {
     return isHumanVsHumanGame
killedBy: getCtaText vsHuman mode roleSelection: returns "Decide who goes first"
statusReason: expected { …(2) } to deeply equal { …(2) }

[Killed] ConditionalExpression
strategy-game-factory/game-parts/common/cta-text.ts:13:7
   chosenRoleIndex,
   resolvedPlayerNames
 }: Ctx): I18nString => {
-  if (phase === 'roleSelection') {
+  if (true) {
     return isHumanVsHumanGame
       ? { hu: 'Döntsétek el, hogy ki kezd.', en: 'Decide who goes first.' }
killedBy: getCtaText vsHuman mode play: returns "Next: [player name]"
statusReason: expected { …(2) } to deeply equal { hu: 'Következik: Alice', …(1) }

[Killed] ObjectLiteral
strategy-game-factory/game-parts/common/cta-text.ts:16:9
   if (phase === 'roleSelection') {
     return isHumanVsHumanGame
       ? { hu: 'Döntsétek el, hogy ki kezd.', en: 'Decide who goes first.' }
-      : { hu: 'Válassz szerepet!', en: 'Choose a role!' };
+      : {};
   }
   if (phase === 'play') {
killedBy: getCtaText vsComputer mode roleSelection: returns "Choose a role"
statusReason: expected {} to deeply equal { hu: 'Válassz szerepet!', …(1) }

[Killed] StringLiteral
strategy-game-factory/game-parts/common/cta-text.ts:16:40
   if (phase === 'roleSelection') {
     return isHumanVsHumanGame
       ? { hu: 'Döntsétek el, hogy ki kezd.', en: 'Decide who goes first.' }
-      : { hu: 'Válassz szerepet!', en: 'Choose a role!' };
+      : { hu: 'Válassz szerepet!', en: "" };
   }
   if (phase === 'play') {
killedBy: getCtaText vsComputer mode roleSelection: returns "Choose a role"
statusReason: expected { hu: 'Válassz szerepet!', en: '' } to deeply equal { hu: 'Válassz szerepet!', …(1) }

[Killed] ConditionalExpression
strategy-game-factory/game-parts/common/cta-text.ts:18:7
       ? { hu: 'Döntsétek el, hogy ki kezd.', en: 'Decide who goes first.' }
       : { hu: 'Válassz szerepet!', en: 'Choose a role!' };
   }
-  if (phase === 'play') {
+  if (true) {
     return isHumanVsHumanGame
       ? { hu: `Következik: ${resolvedPlayerNames[currentPlayer!]}`, en: `Next: ${resolvedPlayerNames[currentPlayer!]}` }
killedBy: getCtaText vsHuman mode gameEnd: returns "Winner: [winner name]"
statusReason: expected { hu: 'Következik: undefined', …(1) } to deeply equal { hu: 'A játékot nyerte: Bob', …(1) }

[Killed] ConditionalExpression
strategy-game-factory/game-parts/common/cta-text.ts:18:7
       ? { hu: 'Döntsétek el, hogy ki kezd.', en: 'Decide who goes first.' }
       : { hu: 'Válassz szerepet!', en: 'Choose a role!' };
   }
-  if (phase === 'play') {
+  if (false) {
     return isHumanVsHumanGame
       ? { hu: `Következik: ${resolvedPlayerNames[currentPlayer!]}`, en: `Next: ${resolvedPlayerNames[currentPlayer!]}` }
killedBy: getCtaText vsHuman mode play: returns "Next: [player name]"
statusReason: expected { …(2) } to deeply equal { hu: 'Következik: Alice', …(1) }

[Killed] StringLiteral
strategy-game-factory/game-parts/common/cta-text.ts:20:15
   }
   if (phase === 'play') {
     return isHumanVsHumanGame
-      ? { hu: `Következik: ${resolvedPlayerNames[currentPlayer!]}`, en: `Next: ${resolvedPlayerNames[currentPlayer!]}` }
+      ? { hu: ``, en: `Next: ${resolvedPlayerNames[currentPlayer!]}` }
       : isClientMoveAllowed
         ? { hu: 'Te jössz', en: 'Your turn' }
killedBy: getCtaText vsHuman mode play: returns "Next: [player name]"
statusReason: expected { hu: '', en: 'Next: Alice' } to deeply equal { hu: 'Következik: Alice', …(1) }

[Killed] StringLiteral
strategy-game-factory/game-parts/common/cta-text.ts:20:73
   }
   if (phase === 'play') {
     return isHumanVsHumanGame
-      ? { hu: `Következik: ${resolvedPlayerNames[currentPlayer!]}`, en: `Next: ${resolvedPlayerNames[currentPlayer!]}` }
+      ? { hu: `Következik: ${resolvedPlayerNames[currentPlayer!]}`, en: `` }
       : isClientMoveAllowed
         ? { hu: 'Te jössz', en: 'Your turn' }
killedBy: getCtaText vsHuman mode play: returns "Next: [player name]"
statusReason: expected { hu: 'Következik: Alice', en: '' } to deeply equal { hu: 'Következik: Alice', …(1) }

[Killed] BlockStatement
strategy-game-factory/game-parts/common/cta-text.ts:25:8
         ? { hu: 'Te jössz', en: 'Your turn' }
         : { hu: 'Mi jövünk', en: "Computer's turn" };
   }
-  else {
-    return isHumanVsHumanGame
-      ? { hu: `A játékot nyerte: ${resolvedPlayerNames[winnerIndex!]}`,
-          en: `Winner: ${resolvedPlayerNames[winnerIndex!]}` }
-      : winnerIndex === chosenRoleIndex
-        ? { hu: 'Nyertél. Gratulálunk! :)', en: 'You won. Congratulations! :)' }
-        : {
-          hu: 'Sajnos, most nem nyertél, de ne add fel.',
-          en: "Unfortunately you didn't win this time, but don't give up."
-        };
-  }
+  else {}
 };
 
killedBy: getCtaText vsHuman mode gameEnd: returns "Winner: [winner name]"
statusReason: expected undefined to deeply equal { hu: 'A játékot nyerte: Bob', …(1) }

[Killed] ObjectLiteral
strategy-game-factory/game-parts/common/cta-text.ts:27:9
   }
   else {
     return isHumanVsHumanGame
-      ? { hu: `A játékot nyerte: ${resolvedPlayerNames[winnerIndex!]}`,
-          en: `Winner: ${resolvedPlayerNames[winnerIndex!]}` }
+      ? {}
       : winnerIndex === chosenRoleIndex
         ? { hu: 'Nyertél. Gratulálunk! :)', en: 'You won. Congratulations! :)' }
killedBy: getCtaText vsHuman mode gameEnd: returns "Winner: [winner name]"
statusReason: expected {} to deeply equal { hu: 'A játékot nyerte: Bob', …(1) }

[Killed] ConditionalExpression
strategy-game-factory/game-parts/common/cta-text.ts:29:9
     return isHumanVsHumanGame
       ? { hu: `A játékot nyerte: ${resolvedPlayerNames[winnerIndex!]}`,
           en: `Winner: ${resolvedPlayerNames[winnerIndex!]}` }
-      : winnerIndex === chosenRoleIndex
+      : false
         ? { hu: 'Nyertél. Gratulálunk! :)', en: 'You won. Congratulations! :)' }
         : {
killedBy: getCtaText vsComputer mode gameEnd: returns win message when role selector won
statusReason: expected { …(2) } to deeply equal { Object (hu, en) }

[Killed] ConditionalExpression
strategy-game-factory/game-parts/common/cta-text.ts:29:9
     return isHumanVsHumanGame
       ? { hu: `A játékot nyerte: ${resolvedPlayerNames[winnerIndex!]}`,
           en: `Winner: ${resolvedPlayerNames[winnerIndex!]}` }
-      : winnerIndex === chosenRoleIndex
+      : true
         ? { hu: 'Nyertél. Gratulálunk! :)', en: 'You won. Congratulations! :)' }
         : {
killedBy: getCtaText vsComputer mode gameEnd: returns lose message when role selector did not win
statusReason: expected { Object (hu, en) } to deeply equal { …(2) }

[Killed] StringLiteral
strategy-game-factory/game-parts/common/cta-text.ts:32:15
       : winnerIndex === chosenRoleIndex
         ? { hu: 'Nyertél. Gratulálunk! :)', en: 'You won. Congratulations! :)' }
         : {
-          hu: 'Sajnos, most nem nyertél, de ne add fel.',
+          hu: "",
           en: "Unfortunately you didn't win this time, but don't give up."
         };
killedBy: getCtaText vsComputer mode gameEnd: returns lose message when role selector did not win
statusReason: expected { hu: '', …(1) } to deeply equal { …(2) }

[Killed] StringLiteral
strategy-game-factory/game-parts/common/cta-text.ts:33:15
         ? { hu: 'Nyertél. Gratulálunk! :)', en: 'You won. Congratulations! :)' }
         : {
           hu: 'Sajnos, most nem nyertél, de ne add fel.',
-          en: "Unfortunately you didn't win this time, but don't give up."
+          en: ""
         };
   }
killedBy: getCtaText vsComputer mode gameEnd: returns lose message when role selector did not win
statusReason: expected { …(2) } to deeply equal { …(2) }
