[Killed] BlockStatement
components/strategy-game-factory/helpers/resolve-variants.ts:3:79
 import type { VariantInput } from '../types';
 
-export const resolveVariants = <TBoard,>(variants: VariantInput<TBoard>[]) => {
-  if (!variants || variants.length === 0) {
-    throw new Error('strategyGameFactory: variants must be a non-empty array');
-  }
-  if (variants.length > 1 && variants.filter(v => v.isDefault).length !== 1) {
-    throw new Error('strategyGameFactory: exactly one variant must have isDefault: true');
-  }
-  const defaultVariantIndex = Math.max(variants.findIndex(v => v.isDefault), 0);
-  const defaultVariant = variants[defaultVariantIndex];
-  if (!defaultVariant.generateStartBoard) {
-    throw new Error('strategyGameFactory: the default variant must define generateStartBoard');
-  }
-  const fallbackBotStrategy = defaultVariant.botStrategy
-    ?? variants.find(v => v.botStrategy)?.botStrategy;
-  const resolvedVariants = variants.map(v => ({ ...v, botStrategy: v.botStrategy ?? fallbackBotStrategy }));
-  return { defaultVariantIndex, defaultVariant, resolvedVariants };
-};
+export const resolveVariants = <TBoard,>(variants: VariantInput<TBoard>[]) => {};
 
killedBy: resolveVariants throws when variants is empty
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
components/strategy-game-factory/helpers/resolve-variants.ts:4:43
 import type { VariantInput } from '../types';
 
 export const resolveVariants = <TBoard,>(variants: VariantInput<TBoard>[]) => {
-  if (!variants || variants.length === 0) {
-    throw new Error('strategyGameFactory: variants must be a non-empty array');
-  }
+  if (!variants || variants.length === 0) {}
   if (variants.length > 1 && variants.filter(v => v.isDefault).length !== 1) {
     throw new Error('strategyGameFactory: exactly one variant must have isDefault: true');
killedBy: resolveVariants throws when variants is empty
statusReason: expected [Function] to throw error including 'variants must be a non-empty array' but got 'Cannot read properties of undefined (…'

[Killed] BooleanLiteral
components/strategy-game-factory/helpers/resolve-variants.ts:4:7
 import type { VariantInput } from '../types';
 
 export const resolveVariants = <TBoard,>(variants: VariantInput<TBoard>[]) => {
-  if (!variants || variants.length === 0) {
+  if (variants || variants.length === 0) {
     throw new Error('strategyGameFactory: variants must be a non-empty array');
   }
killedBy: resolveVariants throws when multiple variants have no isDefault
statusReason: expected [Function] to throw error including 'exactly one variant must have isDefau…' but got 'strategyGameFactory: variants must be…'

[Killed] EqualityOperator
components/strategy-game-factory/helpers/resolve-variants.ts:7:7
   if (!variants || variants.length === 0) {
     throw new Error('strategyGameFactory: variants must be a non-empty array');
   }
-  if (variants.length > 1 && variants.filter(v => v.isDefault).length !== 1) {
+  if (variants.length >= 1 && variants.filter(v => v.isDefault).length !== 1) {
     throw new Error('strategyGameFactory: exactly one variant must have isDefault: true');
   }
killedBy: resolveVariants throws when the default variant has no generateStartBoard
statusReason: expected [Function] to throw error including 'the default variant must define gener…' but got 'strategyGameFactory: exactly one vari…'

[Killed] ConditionalExpression
components/strategy-game-factory/helpers/resolve-variants.ts:7:30
   if (!variants || variants.length === 0) {
     throw new Error('strategyGameFactory: variants must be a non-empty array');
   }
-  if (variants.length > 1 && variants.filter(v => v.isDefault).length !== 1) {
+  if (variants.length > 1 && true) {
     throw new Error('strategyGameFactory: exactly one variant must have isDefault: true');
   }
killedBy: resolveVariants picks the variant marked isDefault as the default
statusReason: strategyGameFactory: exactly one variant must have isDefault: true

[Killed] StringLiteral
components/strategy-game-factory/helpers/resolve-variants.ts:8:21
     throw new Error('strategyGameFactory: variants must be a non-empty array');
   }
   if (variants.length > 1 && variants.filter(v => v.isDefault).length !== 1) {
-    throw new Error('strategyGameFactory: exactly one variant must have isDefault: true');
+    throw new Error("");
   }
   const defaultVariantIndex = Math.max(variants.findIndex(v => v.isDefault), 0);
killedBy: resolveVariants throws when multiple variants have no isDefault
statusReason: expected [Function] to throw error including 'exactly one variant must have isDefau…' but got ''

[Killed] ArrowFunction
components/strategy-game-factory/helpers/resolve-variants.ts:10:59
   if (variants.length > 1 && variants.filter(v => v.isDefault).length !== 1) {
     throw new Error('strategyGameFactory: exactly one variant must have isDefault: true');
   }
-  const defaultVariantIndex = Math.max(variants.findIndex(v => v.isDefault), 0);
+  const defaultVariantIndex = Math.max(variants.findIndex(() => undefined), 0);
   const defaultVariant = variants[defaultVariantIndex];
   if (!defaultVariant.generateStartBoard) {
killedBy: resolveVariants picks the variant marked isDefault as the default
statusReason: expected +0 to be 1 // Object.is equality

[Killed] MethodExpression
components/strategy-game-factory/helpers/resolve-variants.ts:10:31
   if (variants.length > 1 && variants.filter(v => v.isDefault).length !== 1) {
     throw new Error('strategyGameFactory: exactly one variant must have isDefault: true');
   }
-  const defaultVariantIndex = Math.max(variants.findIndex(v => v.isDefault), 0);
+  const defaultVariantIndex = Math.min(variants.findIndex(v => v.isDefault), 0);
   const defaultVariant = variants[defaultVariantIndex];
   if (!defaultVariant.generateStartBoard) {
killedBy: resolveVariants throws when the default variant has no generateStartBoard
statusReason: expected [Function] to throw error including 'the default variant must define gener…' but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
components/strategy-game-factory/helpers/resolve-variants.ts:12:43
   }
   const defaultVariantIndex = Math.max(variants.findIndex(v => v.isDefault), 0);
   const defaultVariant = variants[defaultVariantIndex];
-  if (!defaultVariant.generateStartBoard) {
-    throw new Error('strategyGameFactory: the default variant must define generateStartBoard');
-  }
+  if (!defaultVariant.generateStartBoard) {}
   const fallbackBotStrategy = defaultVariant.botStrategy
     ?? variants.find(v => v.botStrategy)?.botStrategy;
killedBy: resolveVariants throws when the default variant has no generateStartBoard
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
components/strategy-game-factory/helpers/resolve-variants.ts:12:7
   }
   const defaultVariantIndex = Math.max(variants.findIndex(v => v.isDefault), 0);
   const defaultVariant = variants[defaultVariantIndex];
-  if (!defaultVariant.generateStartBoard) {
+  if (false) {
     throw new Error('strategyGameFactory: the default variant must define generateStartBoard');
   }
killedBy: resolveVariants throws when the default variant has no generateStartBoard
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
components/strategy-game-factory/helpers/resolve-variants.ts:15:31
   if (!defaultVariant.generateStartBoard) {
     throw new Error('strategyGameFactory: the default variant must define generateStartBoard');
   }
-  const fallbackBotStrategy = defaultVariant.botStrategy
-    ?? variants.find(v => v.botStrategy)?.botStrategy;
+  const fallbackBotStrategy = defaultVariant.botStrategy && variants.find(v => v.botStrategy)?.botStrategy;
   const resolvedVariants = variants.map(v => ({ ...v, botStrategy: v.botStrategy ?? fallbackBotStrategy }));
   return { defaultVariantIndex, defaultVariant, resolvedVariants };
killedBy: resolveVariants falls back to first available botStrategy when default has none
statusReason: expected undefined to be [Function otherBot] // Object.is equality

[Killed] ArrowFunction
components/strategy-game-factory/helpers/resolve-variants.ts:16:22
     throw new Error('strategyGameFactory: the default variant must define generateStartBoard');
   }
   const fallbackBotStrategy = defaultVariant.botStrategy
-    ?? variants.find(v => v.botStrategy)?.botStrategy;
+    ?? variants.find(() => undefined)?.botStrategy;
   const resolvedVariants = variants.map(v => ({ ...v, botStrategy: v.botStrategy ?? fallbackBotStrategy }));
   return { defaultVariantIndex, defaultVariant, resolvedVariants };
killedBy: resolveVariants falls back to first available botStrategy when default has none
statusReason: expected undefined to be [Function otherBot] // Object.is equality

[Killed] OptionalChaining
components/strategy-game-factory/helpers/resolve-variants.ts:16:8
     throw new Error('strategyGameFactory: the default variant must define generateStartBoard');
   }
   const fallbackBotStrategy = defaultVariant.botStrategy
-    ?? variants.find(v => v.botStrategy)?.botStrategy;
+    ?? variants.find(v => v.botStrategy).botStrategy;
   const resolvedVariants = variants.map(v => ({ ...v, botStrategy: v.botStrategy ?? fallbackBotStrategy }));
   return { defaultVariantIndex, defaultVariant, resolvedVariants };
killedBy: resolveVariants leaves botStrategy undefined when no variant has one
statusReason: Cannot read properties of undefined (reading 'botStrategy')

[Killed] ArrowFunction
components/strategy-game-factory/helpers/resolve-variants.ts:17:41
   }
   const fallbackBotStrategy = defaultVariant.botStrategy
     ?? variants.find(v => v.botStrategy)?.botStrategy;
-  const resolvedVariants = variants.map(v => ({ ...v, botStrategy: v.botStrategy ?? fallbackBotStrategy }));
+  const resolvedVariants = variants.map(() => undefined);
   return { defaultVariantIndex, defaultVariant, resolvedVariants };
 };
killedBy: resolveVariants fills missing botStrategy from the default variant
statusReason: Cannot read properties of undefined (reading 'botStrategy')

[Killed] LogicalOperator
components/strategy-game-factory/helpers/resolve-variants.ts:17:68
   }
   const fallbackBotStrategy = defaultVariant.botStrategy
     ?? variants.find(v => v.botStrategy)?.botStrategy;
-  const resolvedVariants = variants.map(v => ({ ...v, botStrategy: v.botStrategy ?? fallbackBotStrategy }));
+  const resolvedVariants = variants.map(v => ({ ...v, botStrategy: v.botStrategy && fallbackBotStrategy }));
   return { defaultVariantIndex, defaultVariant, resolvedVariants };
 };
killedBy: resolveVariants fills missing botStrategy from the default variant
statusReason: expected undefined to be [Function defaultBot] // Object.is equality
