[Killed] BlockStatement
components/strategy-game-factory/hooks/use-deferred-move.ts:17:24
   const timeoutRef = useRef<ReturnType<typeof setTimeout> | null>(null);
   const scheduledAfterRef = useRef<number | null>(null);
 
-  const cancel = () => {
-    if (timeoutRef.current !== null) clearTimeout(timeoutRef.current);
-    timeoutRef.current = null;
-    scheduledAfterRef.current = null;
-  };
+  const cancel = () => {};
 
   // The pending move is the only thing that should advance the count from here,
killedBy: useDeferredMove drops a pending move when the game restarts inside the beat
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] EqualityOperator
components/strategy-game-factory/hooks/use-deferred-move.ts:18:9
   const scheduledAfterRef = useRef<number | null>(null);
 
   const cancel = () => {
-    if (timeoutRef.current !== null) clearTimeout(timeoutRef.current);
+    if (timeoutRef.current === null) clearTimeout(timeoutRef.current);
     timeoutRef.current = null;
     scheduledAfterRef.current = null;
killedBy: useDeferredMove drops a pending move when the game restarts inside the beat
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] ConditionalExpression
components/strategy-game-factory/hooks/use-deferred-move.ts:18:9
   const scheduledAfterRef = useRef<number | null>(null);
 
   const cancel = () => {
-    if (timeoutRef.current !== null) clearTimeout(timeoutRef.current);
+    if (false) clearTimeout(timeoutRef.current);
     timeoutRef.current = null;
     scheduledAfterRef.current = null;
killedBy: useDeferredMove drops a pending move when the game restarts inside the beat
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] BlockStatement
components/strategy-game-factory/hooks/use-deferred-move.ts:25:19
 
   // The pending move is the only thing that should advance the count from here,
   // so anything that does not advance it has replaced the position instead.
-  useEffect(() => {
-    if (scheduledAfterRef.current !== null && moveCount <= scheduledAfterRef.current) cancel();
-  }, [moveCount]);
+  useEffect(() => {}, [moveCount]);
 
   useEffect(() => cancel, []);
killedBy: useDeferredMove drops a pending move when the game restarts inside the beat
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] EqualityOperator
components/strategy-game-factory/hooks/use-deferred-move.ts:26:9
   // The pending move is the only thing that should advance the count from here,
   // so anything that does not advance it has replaced the position instead.
   useEffect(() => {
-    if (scheduledAfterRef.current !== null && moveCount <= scheduledAfterRef.current) cancel();
+    if (scheduledAfterRef.current === null && moveCount <= scheduledAfterRef.current) cancel();
   }, [moveCount]);
 
killedBy: useDeferredMove drops a pending move when the game restarts inside the beat
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] ConditionalExpression
components/strategy-game-factory/hooks/use-deferred-move.ts:26:9
   // The pending move is the only thing that should advance the count from here,
   // so anything that does not advance it has replaced the position instead.
   useEffect(() => {
-    if (scheduledAfterRef.current !== null && moveCount <= scheduledAfterRef.current) cancel();
+    if (false) cancel();
   }, [moveCount]);
 
killedBy: useDeferredMove drops a pending move when the game restarts inside the beat
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] ArrowFunction
components/strategy-game-factory/hooks/use-deferred-move.ts:29:13
     if (scheduledAfterRef.current !== null && moveCount <= scheduledAfterRef.current) cancel();
   }, [moveCount]);
 
-  useEffect(() => cancel, []);
+  useEffect(() => undefined, []);
 
   return (playSecondMove: () => void) => {
killedBy: useDeferredMove drops a pending move when the player navigates away
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] BlockStatement
components/strategy-game-factory/hooks/use-deferred-move.ts:31:42
 
   useEffect(() => cancel, []);
 
-  return (playSecondMove: () => void) => {
-    cancel();
-    scheduledAfterRef.current = moveCount;
-    timeoutRef.current = setTimeout(() => {
-      timeoutRef.current = null;
-      scheduledAfterRef.current = null;
-      playSecondMove();
-    }, stepDelay());
-  };
+  return (playSecondMove: () => void) => {};
 };
 
killedBy: useDeferredMove plays the second move a beat later, not straight away
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
components/strategy-game-factory/hooks/use-deferred-move.ts:34:43
   return (playSecondMove: () => void) => {
     cancel();
     scheduledAfterRef.current = moveCount;
-    timeoutRef.current = setTimeout(() => {
-      timeoutRef.current = null;
-      scheduledAfterRef.current = null;
-      playSecondMove();
-    }, stepDelay());
+    timeoutRef.current = setTimeout(() => {}, stepDelay());
   };
 };
killedBy: useDeferredMove plays the second move a beat later, not straight away
statusReason: expected "vi.fn()" to be called once, but got 0 times
