[Killed] BlockStatement
components/strategy-game-factory/hooks/use-game-stats.ts:7:43
 
 const EMPTY_STATS: Stats = { win: 0, loss: 0 };
 
-const readStats = (key: string): Stats => {
-  try {
-    return JSON.parse(localStorage.getItem(key)!) ?? EMPTY_STATS;
-  } catch {
-    return EMPTY_STATS;
-  }
-};
+const readStats = (key: string): Stats => {};
 
 export const useGameStats = (gameId: string, variantIndex: number) => {
killedBy: useGameStats starts at zero when nothing has been stored yet
statusReason: expected undefined to deeply equal { win: +0, loss: +0 }

[Killed] BlockStatement
components/strategy-game-factory/hooks/use-game-stats.ts:8:7
 const EMPTY_STATS: Stats = { win: 0, loss: 0 };
 
 const readStats = (key: string): Stats => {
-  try {
-    return JSON.parse(localStorage.getItem(key)!) ?? EMPTY_STATS;
-  } catch {
+  try {} catch {
     return EMPTY_STATS;
   }
killedBy: win/loss tracking records a win when the chosen player wins in vsComputer mode
statusReason: Cannot read properties of undefined (reading 'win')

[Killed] LogicalOperator
components/strategy-game-factory/hooks/use-game-stats.ts:9:12
 
 const readStats = (key: string): Stats => {
   try {
-    return JSON.parse(localStorage.getItem(key)!) ?? EMPTY_STATS;
+    return JSON.parse(localStorage.getItem(key)!) && EMPTY_STATS;
   } catch {
     return EMPTY_STATS;
killedBy: win/loss tracking records a win when the chosen player wins in vsComputer mode
statusReason: Cannot read properties of null (reading 'win')

[Killed] BlockStatement
components/strategy-game-factory/hooks/use-game-stats.ts:10:11
 const readStats = (key: string): Stats => {
   try {
     return JSON.parse(localStorage.getItem(key)!) ?? EMPTY_STATS;
-  } catch {
-    return EMPTY_STATS;
-  }
+  } catch {}
 };
 
killedBy: useGameStats falls back to zero on unparseable JSON
statusReason: expected undefined to deeply equal { win: +0, loss: +0 }

[Killed] ArrowFunction
components/strategy-game-factory/hooks/use-game-stats.ts:22:40
   // useMoveScopedState: switching variant reads the new key during render, so
   // the previous variant's counts are never shown for a frame. An effect
   // re-reading on `storageKey` would repair it one render too late.
-  const [stored, setStored] = useState(() => ({ key: storageKey, stats: readStats(storageKey) }));
+  const [stored, setStored] = useState(() => undefined);
   const stats = stored.key === storageKey ? stored.stats : readStats(storageKey);
 
killedBy: useGameStats starts at zero when nothing has been stored yet
statusReason: Cannot read properties of undefined (reading 'key')

[Killed] ConditionalExpression
components/strategy-game-factory/hooks/use-game-stats.ts:23:17
   // the previous variant's counts are never shown for a frame. An effect
   // re-reading on `storageKey` would repair it one render too late.
   const [stored, setStored] = useState(() => ({ key: storageKey, stats: readStats(storageKey) }));
-  const stats = stored.key === storageKey ? stored.stats : readStats(storageKey);
+  const stats = true ? stored.stats : readStats(storageKey);
 
   const recordResult = useCallback((result: keyof Stats) => {
killedBy: useGameStats swaps to the other tally when the variant changes, and keeps them apart
statusReason: expected { win: 5, loss: +0 } to deeply equal { win: 1, loss: 9 }

[Killed] EqualityOperator
components/strategy-game-factory/hooks/use-game-stats.ts:23:17
   // the previous variant's counts are never shown for a frame. An effect
   // re-reading on `storageKey` would repair it one render too late.
   const [stored, setStored] = useState(() => ({ key: storageKey, stats: readStats(storageKey) }));
-  const stats = stored.key === storageKey ? stored.stats : readStats(storageKey);
+  const stats = stored.key !== storageKey ? stored.stats : readStats(storageKey);
 
   const recordResult = useCallback((result: keyof Stats) => {
killedBy: useGameStats swaps to the other tally when the variant changes, and keeps them apart
statusReason: expected { win: 5, loss: +0 } to deeply equal { win: 1, loss: 9 }

[Killed] BlockStatement
components/strategy-game-factory/hooks/use-game-stats.ts:25:61
   const [stored, setStored] = useState(() => ({ key: storageKey, stats: readStats(storageKey) }));
   const stats = stored.key === storageKey ? stored.stats : readStats(storageKey);
 
-  const recordResult = useCallback((result: keyof Stats) => {
-    setStored(stale => {
-      const current = stale.key === storageKey ? stale.stats : readStats(storageKey);
-      const next = { ...current, [result]: current[result] + 1 };
-      localStorage.setItem(storageKey, JSON.stringify(next));
-      return { key: storageKey, stats: next };
-    });
-  }, [storageKey]);
+  const recordResult = useCallback((result: keyof Stats) => {}, [storageKey]);
 
   const resetStats = useCallback(() => {
killedBy: win/loss tracking records a win when the chosen player wins in vsComputer mode
statusReason: expected null to deeply equal { win: 1, loss: +0 }

[Killed] BlockStatement
components/strategy-game-factory/hooks/use-game-stats.ts:26:24
   const stats = stored.key === storageKey ? stored.stats : readStats(storageKey);
 
   const recordResult = useCallback((result: keyof Stats) => {
-    setStored(stale => {
-      const current = stale.key === storageKey ? stale.stats : readStats(storageKey);
-      const next = { ...current, [result]: current[result] + 1 };
-      localStorage.setItem(storageKey, JSON.stringify(next));
-      return { key: storageKey, stats: next };
-    });
+    setStored(stale => {});
   }, [storageKey]);
 
killedBy: win/loss tracking records a win when the chosen player wins in vsComputer mode
statusReason: Cannot read properties of undefined (reading 'key')

[Killed] ConditionalExpression
components/strategy-game-factory/hooks/use-game-stats.ts:27:23
 
   const recordResult = useCallback((result: keyof Stats) => {
     setStored(stale => {
-      const current = stale.key === storageKey ? stale.stats : readStats(storageKey);
+      const current = true ? stale.stats : readStats(storageKey);
       const next = { ...current, [result]: current[result] + 1 };
       localStorage.setItem(storageKey, JSON.stringify(next));
killedBy: useGameStats swaps to the other tally when the variant changes, and keeps them apart
statusReason: expected { win: 6, loss: +0 } to deeply equal { win: 2, loss: 9 }

[Killed] EqualityOperator
components/strategy-game-factory/hooks/use-game-stats.ts:27:23
 
   const recordResult = useCallback((result: keyof Stats) => {
     setStored(stale => {
-      const current = stale.key === storageKey ? stale.stats : readStats(storageKey);
+      const current = stale.key !== storageKey ? stale.stats : readStats(storageKey);
       const next = { ...current, [result]: current[result] + 1 };
       localStorage.setItem(storageKey, JSON.stringify(next));
killedBy: useGameStats swaps to the other tally when the variant changes, and keeps them apart
statusReason: expected { win: 6, loss: +0 } to deeply equal { win: 2, loss: 9 }

[Killed] ArithmeticOperator
components/strategy-game-factory/hooks/use-game-stats.ts:28:44
   const recordResult = useCallback((result: keyof Stats) => {
     setStored(stale => {
       const current = stale.key === storageKey ? stale.stats : readStats(storageKey);
-      const next = { ...current, [result]: current[result] + 1 };
+      const next = { ...current, [result]: current[result] - 1 };
       localStorage.setItem(storageKey, JSON.stringify(next));
       return { key: storageKey, stats: next };
killedBy: useGameStats counts a win and a loss, persisting each
statusReason: expected { win: -2, loss: -1 } to deeply equal { win: 2, loss: 1 }

[Killed] ObjectLiteral
components/strategy-game-factory/hooks/use-game-stats.ts:28:20
   const recordResult = useCallback((result: keyof Stats) => {
     setStored(stale => {
       const current = stale.key === storageKey ? stale.stats : readStats(storageKey);
-      const next = { ...current, [result]: current[result] + 1 };
+      const next = {};
       localStorage.setItem(storageKey, JSON.stringify(next));
       return { key: storageKey, stats: next };
killedBy: win/loss tracking records a win when the chosen player wins in vsComputer mode
statusReason: expected {} to deeply equal { win: 1, loss: +0 }

[Survived] ObjectLiteral
components/strategy-game-factory/hooks/use-game-stats.ts:30:14
       const current = stale.key === storageKey ? stale.stats : readStats(storageKey);
       const next = { ...current, [result]: current[result] + 1 };
       localStorage.setItem(storageKey, JSON.stringify(next));
-      return { key: storageKey, stats: next };
+      return {};
     });
   }, [storageKey]);

[Killed] BlockStatement
components/strategy-game-factory/hooks/use-game-stats.ts:34:40
     });
   }, [storageKey]);
 
-  const resetStats = useCallback(() => {
-    localStorage.removeItem(storageKey);
-    setStored({ key: storageKey, stats: EMPTY_STATS });
-  }, [storageKey]);
+  const resetStats = useCallback(() => {}, [storageKey]);
 
   return { stats, recordResult, resetStats };
killedBy: useGameStats clears both the counters and the stored value on reset
statusReason: expected { win: 4, loss: 1 } to deeply equal { win: +0, loss: +0 }

[Killed] ObjectLiteral
components/strategy-game-factory/hooks/use-game-stats.ts:39:10
     setStored({ key: storageKey, stats: EMPTY_STATS });
   }, [storageKey]);
 
-  return { stats, recordResult, resetStats };
+  return {};
 };
 
killedBy: useGameStats starts at zero when nothing has been stored yet
statusReason: expected undefined to deeply equal { win: +0, loss: +0 }
