[Killed] BlockStatement
components/strategy-game-factory/hooks/use-hover-preview.ts:25:55
  * preview, or handlers that filter by `pointerType`. Values set this way get
  * the same moveCount stamp, so they are invalidated by the next move too.
  */
-export function useHoverPreview<T>(moveCount: number) {
-  const [value, setHovered, clear] = useMoveScopedState<T | null>(moveCount, null);
-
-  const set = (v: T) => setHovered(v);
-
-  const hoverProps = (v: T) => ({
-    onPointerEnter: () => set(v),
-    onPointerMove: () => set(v),
-    onPointerLeave: clear,
-    onFocus: () => set(v),
-    onBlur: clear
-  });
-
-  return { value, hoverProps, set, clear };
-}
+export function useHoverPreview<T>(moveCount: number) {}
 
killedBy: useHoverPreview starts with no value
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ArrowFunction
components/strategy-game-factory/hooks/use-hover-preview.ts:28:15
 export function useHoverPreview<T>(moveCount: number) {
   const [value, setHovered, clear] = useMoveScopedState<T | null>(moveCount, null);
 
-  const set = (v: T) => setHovered(v);
+  const set = () => undefined;
 
   const hoverProps = (v: T) => ({
killedBy: useHoverPreview sets the value on enter/focus and clears on leave/blur
statusReason: expected null to be 'x' // Object.is equality

[Killed] ArrowFunction
components/strategy-game-factory/hooks/use-hover-preview.ts:30:22
 
   const set = (v: T) => setHovered(v);
 
-  const hoverProps = (v: T) => ({
-    onPointerEnter: () => set(v),
-    onPointerMove: () => set(v),
-    onPointerLeave: clear,
-    onFocus: () => set(v),
-    onBlur: clear
-  });
+  const hoverProps = () => undefined;
 
   return { value, hoverProps, set, clear };
killedBy: useHoverPreview sets the value on enter/focus and clears on leave/blur
statusReason: Cannot read properties of undefined (reading 'onPointerEnter')

[Killed] ArrowFunction
components/strategy-game-factory/hooks/use-hover-preview.ts:31:21
   const set = (v: T) => setHovered(v);
 
   const hoverProps = (v: T) => ({
-    onPointerEnter: () => set(v),
+    onPointerEnter: () => undefined,
     onPointerMove: () => set(v),
     onPointerLeave: clear,
killedBy: useHoverPreview sets the value on enter/focus and clears on leave/blur
statusReason: expected null to be 'x' // Object.is equality

[Survived] ArrowFunction
components/strategy-game-factory/hooks/use-hover-preview.ts:32:20
 
   const hoverProps = (v: T) => ({
     onPointerEnter: () => set(v),
-    onPointerMove: () => set(v),
+    onPointerMove: () => undefined,
     onPointerLeave: clear,
     onFocus: () => set(v),

[Killed] ArrowFunction
components/strategy-game-factory/hooks/use-hover-preview.ts:34:14
     onPointerEnter: () => set(v),
     onPointerMove: () => set(v),
     onPointerLeave: clear,
-    onFocus: () => set(v),
+    onFocus: () => undefined,
     onBlur: clear
   });
killedBy: useHoverPreview sets the value on enter/focus and clears on leave/blur
statusReason: expected null to be 'y' // Object.is equality
