[Killed] BlockStatement
components/strategy-game-factory/hooks/use-move-scoped-state.ts:27:70
  * `getPlayerStepDescription` reads — use `ctx.turnState` and `setTurnState`
  * instead. This hook is local to the component.
  */
-export function useMoveScopedState<T>(moveCount: number, initial: T) {
-  const [stamped, setStamped] = useState<{ value: T; moveCount: number } | null>(null);
-
-  const value = stamped?.moveCount === moveCount ? stamped.value : initial;
-
-  // The updater form reads through the stamp rather than the raw state, so a
-  // toggle written as `set(prev => ...)` sees `initial` after a move rather
-  // than the value that move invalidated. Deriving it inside setStamped (not
-  // from `value` above) also keeps two set calls in one handler correct.
-  const set = (next: T | ((prev: T) => T)) =>
-    setStamped(stale => {
-      const current = stale?.moveCount === moveCount ? stale.value : initial;
-      const resolved = typeof next === 'function' ? (next as (prev: T) => T)(current) : next;
-      return { value: resolved, moveCount };
-    });
-
-  const reset = () => setStamped(null);
-
-  return [value, set, reset] as const;
-}
+export function useMoveScopedState<T>(moveCount: number, initial: T) {}
 
killedBy: useHoverPreview starts with no value
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] EqualityOperator
components/strategy-game-factory/hooks/use-move-scoped-state.ts:30:17
 export function useMoveScopedState<T>(moveCount: number, initial: T) {
   const [stamped, setStamped] = useState<{ value: T; moveCount: number } | null>(null);
 
-  const value = stamped?.moveCount === moveCount ? stamped.value : initial;
+  const value = stamped?.moveCount !== moveCount ? stamped.value : initial;
 
   // The updater form reads through the stamp rather than the raw state, so a
killedBy: useHoverPreview starts with no value
statusReason: Cannot read properties of null (reading 'value')

[Killed] ConditionalExpression
components/strategy-game-factory/hooks/use-move-scoped-state.ts:30:17
 export function useMoveScopedState<T>(moveCount: number, initial: T) {
   const [stamped, setStamped] = useState<{ value: T; moveCount: number } | null>(null);
 
-  const value = stamped?.moveCount === moveCount ? stamped.value : initial;
+  const value = false ? stamped.value : initial;
 
   // The updater form reads through the stamp rather than the raw state, so a
killedBy: useHoverPreview sets the value on enter/focus and clears on leave/blur
statusReason: expected null to be 'x' // Object.is equality

[Killed] ArrowFunction
components/strategy-game-factory/hooks/use-move-scoped-state.ts:36:15
   // toggle written as `set(prev => ...)` sees `initial` after a move rather
   // than the value that move invalidated. Deriving it inside setStamped (not
   // from `value` above) also keeps two set calls in one handler correct.
-  const set = (next: T | ((prev: T) => T)) =>
-    setStamped(stale => {
-      const current = stale?.moveCount === moveCount ? stale.value : initial;
-      const resolved = typeof next === 'function' ? (next as (prev: T) => T)(current) : next;
-      return { value: resolved, moveCount };
-    });
+  const set = () => undefined;
 
   const reset = () => setStamped(null);
killedBy: useHoverPreview sets the value on enter/focus and clears on leave/blur
statusReason: expected null to be 'x' // Object.is equality

[Killed] BlockStatement
components/strategy-game-factory/hooks/use-move-scoped-state.ts:37:25
   // than the value that move invalidated. Deriving it inside setStamped (not
   // from `value` above) also keeps two set calls in one handler correct.
   const set = (next: T | ((prev: T) => T)) =>
-    setStamped(stale => {
-      const current = stale?.moveCount === moveCount ? stale.value : initial;
-      const resolved = typeof next === 'function' ? (next as (prev: T) => T)(current) : next;
-      return { value: resolved, moveCount };
-    });
+    setStamped(stale => {});
 
   const reset = () => setStamped(null);
killedBy: useMoveScopedState holds a value set during the same move
statusReason: expected null to be 7 // Object.is equality

[Killed] ConditionalExpression
components/strategy-game-factory/hooks/use-move-scoped-state.ts:38:23
   // from `value` above) also keeps two set calls in one handler correct.
   const set = (next: T | ((prev: T) => T)) =>
     setStamped(stale => {
-      const current = stale?.moveCount === moveCount ? stale.value : initial;
+      const current = false ? stale.value : initial;
       const resolved = typeof next === 'function' ? (next as (prev: T) => T)(current) : next;
       return { value: resolved, moveCount };
killedBy: useMoveScopedState the updater form sees the current value, so a toggle works
statusReason: expected 5 to be null

[Killed] ConditionalExpression
components/strategy-game-factory/hooks/use-move-scoped-state.ts:38:23
   // from `value` above) also keeps two set calls in one handler correct.
   const set = (next: T | ((prev: T) => T)) =>
     setStamped(stale => {
-      const current = stale?.moveCount === moveCount ? stale.value : initial;
+      const current = true ? stale.value : initial;
       const resolved = typeof next === 'function' ? (next as (prev: T) => T)(current) : next;
       return { value: resolved, moveCount };
killedBy: useHoverPreview sets the value on enter/focus and clears on leave/blur
statusReason: Cannot read properties of null (reading 'value')

[Killed] ConditionalExpression
components/strategy-game-factory/hooks/use-move-scoped-state.ts:39:24
   const set = (next: T | ((prev: T) => T)) =>
     setStamped(stale => {
       const current = stale?.moveCount === moveCount ? stale.value : initial;
-      const resolved = typeof next === 'function' ? (next as (prev: T) => T)(current) : next;
+      const resolved = false ? (next as (prev: T) => T)(current) : next;
       return { value: resolved, moveCount };
     });
killedBy: useMoveScopedState the updater form sees the current value, so a toggle works
statusReason: expected [Function] to be null

[Killed] EqualityOperator
components/strategy-game-factory/hooks/use-move-scoped-state.ts:39:24
   const set = (next: T | ((prev: T) => T)) =>
     setStamped(stale => {
       const current = stale?.moveCount === moveCount ? stale.value : initial;
-      const resolved = typeof next === 'function' ? (next as (prev: T) => T)(current) : next;
+      const resolved = typeof next !== 'function' ? (next as (prev: T) => T)(current) : next;
       return { value: resolved, moveCount };
     });
killedBy: useHoverPreview sets the value on enter/focus and clears on leave/blur
statusReason: next is not a function

[Killed] ArrowFunction
components/strategy-game-factory/hooks/use-move-scoped-state.ts:43:17
       return { value: resolved, moveCount };
     });
 
-  const reset = () => setStamped(null);
+  const reset = () => undefined;
 
   return [value, set, reset] as const;
killedBy: useMoveScopedState resets on demand, for a deselect that is not a move
statusReason: expected 5 to be null
