[Killed] ArrowFunction
components/strategy-game-factory/engine/store.ts:24:39
   currentTurnHasMoves: boolean
 }
 
-export const createInitialCoreState = <TBoard>(
-  board: TBoard, mode: Mode = 'vsComputer'
-): CoreState<TBoard> => ({
-  board,
-  phase: 'roleSelection',
-  mode,
-  currentPlayer: null,
-  chosenRoleIndex: null,
-  turnState: null,
-  moveCount: 0,
-  winnerIndex: null,
-  undoSnapshot: null,
-  currentTurnHasMoves: false
-});
+export const createInitialCoreState = () => undefined;
 
 export type GameStore<TBoard> = {
killedBy: smartBotStrategy wins as the replier on 4x6 against the random bot
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ObjectLiteral
components/strategy-game-factory/engine/store.ts:26:26
 
 export const createInitialCoreState = <TBoard>(
   board: TBoard, mode: Mode = 'vsComputer'
-): CoreState<TBoard> => ({
-  board,
-  phase: 'roleSelection',
-  mode,
-  currentPlayer: null,
-  chosenRoleIndex: null,
-  turnState: null,
-  moveCount: 0,
-  winnerIndex: null,
-  undoSnapshot: null,
-  currentTurnHasMoves: false
-});
+): CoreState<TBoard> => ({});
 
 export type GameStore<TBoard> = {
killedBy: createGameStore returns the initial state and keeps the same reference between writes
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] BlockStatement
components/strategy-game-factory/engine/store.ts:48:91
 // Minimal hand-rolled store: getState returns the same object between writes
 // (a requirement of useSyncExternalStore), setState merges a partial patch and
 // notifies subscribers synchronously.
-export const createGameStore = <TBoard>(initial: CoreState<TBoard>): GameStore<TBoard> => {
-  let state = initial;
-  const listeners = new Set<() => void>();
-  return {
-    getState: () => state,
-    setState: (patch) => {
-      state = { ...state, ...patch };
-      listeners.forEach(listener => listener());
-    },
-    subscribe: (listener) => {
-      listeners.add(listener);
-      return () => { listeners.delete(listener); };
-    }
-  };
-};
+export const createGameStore = <TBoard>(initial: CoreState<TBoard>): GameStore<TBoard> => {};
 
killedBy: createGameStore returns the initial state and keeps the same reference between writes
statusReason: Cannot read properties of undefined (reading 'getState')

[Killed] ArrowFunction
components/strategy-game-factory/engine/store.ts:52:15
   let state = initial;
   const listeners = new Set<() => void>();
   return {
-    getState: () => state,
+    getState: () => undefined,
     setState: (patch) => {
       state = { ...state, ...patch };
killedBy: createGameStore returns the initial state and keeps the same reference between writes
statusReason: Cannot read properties of undefined (reading 'board')

[Killed] BlockStatement
components/strategy-game-factory/engine/store.ts:53:26
   const listeners = new Set<() => void>();
   return {
     getState: () => state,
-    setState: (patch) => {
-      state = { ...state, ...patch };
-      listeners.forEach(listener => listener());
-    },
+    setState: (patch) => {},
     subscribe: (listener) => {
       listeners.add(listener);
killedBy: createGameStore setState merges a partial patch and notifies subscribers synchronously
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ObjectLiteral
components/strategy-game-factory/engine/store.ts:54:15
   return {
     getState: () => state,
     setState: (patch) => {
-      state = { ...state, ...patch };
+      state = {};
       listeners.forEach(listener => listener());
     },
killedBy: isClientMoveAllowed allows both players to move in vsHuman mode
statusReason: Unable to find an element by: [data-testid="start-hh-game-0"]

Ignored nodes: comments, script, style
<body>
  <div />
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"

[Killed] ArrowFunction
components/strategy-game-factory/engine/store.ts:55:25
     getState: () => state,
     setState: (patch) => {
       state = { ...state, ...patch };
-      listeners.forEach(listener => listener());
+      listeners.forEach(() => undefined);
     },
     subscribe: (listener) => {
killedBy: isClientMoveAllowed disables moves during the computer turn in vsComputer mode
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
components/strategy-game-factory/engine/store.ts:57:30
       state = { ...state, ...patch };
       listeners.forEach(listener => listener());
     },
-    subscribe: (listener) => {
-      listeners.add(listener);
-      return () => { listeners.delete(listener); };
-    }
+    subscribe: (listener) => {}
   };
 };
killedBy: createGameStore setState merges a partial patch and notifies subscribers synchronously
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
components/strategy-game-factory/engine/store.ts:59:20
     },
     subscribe: (listener) => {
       listeners.add(listener);
-      return () => { listeners.delete(listener); };
+      return () => {};
     }
   };
killedBy: createGameStore unsubscribe stops notifications
statusReason: expected "vi.fn()" to be called once, but got 2 times
