[Survived] StringLiteral
components/strategy-game-factory/game-parts/game-header.tsx:8:47
 
 export const GameHeader = () => {
   const { t } = useTranslation();
-  const gameId = useLocation().pathname.split('/').pop();
+  const gameId = useLocation().pathname.split("").pop();
   const gameEntry = gameList[gameId!];
   const title = t(gameEntry?.title ?? gameEntry?.name ?? '');

[Killed] OptionalChaining
components/strategy-game-factory/game-parts/game-header.tsx:10:19
   const { t } = useTranslation();
   const gameId = useLocation().pathname.split('/').pop();
   const gameEntry = gameList[gameId!];
-  const title = t(gameEntry?.title ?? gameEntry?.name ?? '');
+  const title = t(gameEntry.title ?? gameEntry?.name ?? '');
   return (
   <>
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Cannot read properties of undefined (reading 'title')

[Killed] OptionalChaining
components/strategy-game-factory/game-parts/game-header.tsx:10:39
   const { t } = useTranslation();
   const gameId = useLocation().pathname.split('/').pop();
   const gameEntry = gameList[gameId!];
-  const title = t(gameEntry?.title ?? gameEntry?.name ?? '');
+  const title = t(gameEntry?.title ?? gameEntry.name ?? '');
   return (
   <>
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Cannot read properties of undefined (reading 'name')

[Survived] StringLiteral
components/strategy-game-factory/game-parts/game-header.tsx:18:80
         to='/'
         className="md:basis-36 text-sm whitespace-nowrap"
       >
-        ← <span className="hidden md:inline">{t({ hu: 'Vissza a listához', en: 'Back to list' })}</span>
+        ← <span className="hidden md:inline">{t({ hu: 'Vissza a listához', en: "" })}</span>
       </Link>
       <h1 className="grow text-blue-600 dark:text-blue-400 text-center">
