[Killed] ArrowFunction
components/strategy-game-factory/game-parts/game-rule.tsx:9:8
   const { t } = useTranslation();
   return <section className="flex justify-center mb-4 mt-1 max-w-[100ch]">
     <Disclosure defaultOpen>
-      {({ open }) => (
-        <div className="border-2 rounded-sm grow">
-          <DisclosureButton
-            className="w-full bg-slate-200 dark:bg-slate-700 text-lg sm:text-xl flex justify-center"
-          >
-            <span className="grow">{t({ hu: 'Játékszabályok', en: 'Game rules' })}</span>
-            <span className="pr-4" aria-hidden="true">
-              <span
-                className="inline-block transition-transform"
-                style={{ transform: open ? 'rotate(90deg)' : undefined }}
-              >▸</span>
-            </span>
-          </DisclosureButton>
-            <DisclosurePanel className="w-full p-2">
-              <p className="text-justify">
-                {ruleDescription}
-              </p>
-            </DisclosurePanel>
-        </div>
-      )}
+      {() => undefined}
     </Disclosure>
   </section>;
killedBy: per-variant rule shows the default variant rule and switches when another variant is selected
statusReason: Unable to find an element with the text: RULE_ONE. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="flex flex-col p-2 min-h-screen"
    >

[Killed] ObjectLiteral
components/strategy-game-factory/game-parts/game-rule.tsx:14:39
           <DisclosureButton
             className="w-full bg-slate-200 dark:bg-slate-700 text-lg sm:text-xl flex justify-center"
           >
-            <span className="grow">{t({ hu: 'Játékszabályok', en: 'Game rules' })}</span>
+            <span className="grow">{t({})}</span>
             <span className="pr-4" aria-hidden="true">
               <span
killedBy: a turn named whole plays the same moves in the shell as headless
statusReason: Objects are not valid as a React child (found: object with keys {}). If you meant to render a collection of children, use an array instead.

[Survived] StringLiteral
components/strategy-game-factory/game-parts/game-rule.tsx:14:67
           <DisclosureButton
             className="w-full bg-slate-200 dark:bg-slate-700 text-lg sm:text-xl flex justify-center"
           >
-            <span className="grow">{t({ hu: 'Játékszabályok', en: 'Game rules' })}</span>
+            <span className="grow">{t({ hu: 'Játékszabályok', en: "" })}</span>
             <span className="pr-4" aria-hidden="true">
               <span

[Survived] ObjectLiteral
components/strategy-game-factory/game-parts/game-rule.tsx:18:24
             <span className="pr-4" aria-hidden="true">
               <span
                 className="inline-block transition-transform"
-                style={{ transform: open ? 'rotate(90deg)' : undefined }}
+                style={{}}
               >▸</span>
             </span>
